{
  "slug": "remote-investment-manager-wintermute-1093149",
  "id": "1093149",
  "epoch": 1746824406,
  "date": "2025-05-09T21:00:06+00:00",
  "company": "Wintermute",
  "company_logo": "https://remoteok.com/assets/img/jobs/6389826d60c54532271dee34a99009c71746824406.png",
  "position": "Investment Manager",
  "tags": [
    "manager",
    "web3",
    "defi",
    "crypto",
    "cryptocurrency",
    "technical",
    "support",
    "software",
    "growth",
    "financial",
    "investment",
    "finance",
    "admin",
    "management"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/6389826d60c54532271dee34a99009c71746824406.png",
  "description": "<p><b style=\"font-size: 18px\">About Wintermute</b></p><p><br></p><p>Wintermute is one of the largest crypto native algorithmic trading companies in digital assets. We provide liquidity across most cryptocurrency exchanges and trading platforms, a broad range of OTC trading solutions as well as support high profile blockchain projects and traditional financial institutions moving into crypto. Wintermute also has a Wintermute Ventures arm that invests in early stage DeFi projects.&nbsp;</p><p><br></p><p>Wintermute was founded in 2017 and has successfully navigated industry cycles. Culturally, we combine the best of the two worlds: the technology standards of high-frequency trading firms in traditional markets and the innovative and entrepreneurial culture of technology startups. To Wintermute digital assets is not just another asset class, we believe in the innovative potential of blockchain, the fundamental innovations, we have a long-term view on the digital asset market and are taking a leadership position in building an innovative and compliant market. You can read more&nbsp;<a class=\"postings-link\" href=\"https://www.wintermute.com/about/\">here</a>.<span style=\"font-size: 10.5pt\">&nbsp;</span></p><p><br></p><p><b style=\"font-size: 18px\">About Wintermute Ventures </b></p><p><br></p><p>Wintermute Ventures is the investment arm of Wintermute. Drawing from Wintermute's expertise in pioneering DeFi trading and powering liquidity across the entire ecosystem, Wintermute Ventures is uniquely positioned to back early-stage Web3 projects with hands-on support. Focused on long-term growth, the company takes a flexible approach, investing from early ideation to later-stage expansion. Committed to developing strategic relationships and driving positive outcomes, Wintermute Ventures prioritizes decentralized ownership, ensuring its investments align with the companyâ\u0080\u0099s broader vision of a decentralized future. Since 2020, it has invested in over 100 projects.</p><p><br></p><p>You will play an integral part in growing our investment portfolio, be part of building our pipeline of new investments, and establish a strong network with founders in the industry. You will join an investment team where your main focus will be leading our direct investment efforts in growth-stage technology / blockchain companies in the United States.</p>\\n<p></p><p><br></p><b>Responsibilities - You will need to be flexible and adaptable. Some examples of your role:</b><ul><li>Sourcing: proactively identifying new investment opportunities with crypto infrastructure (Defi, Cefi etc.) and qualifying inbound leads for the firm by meeting with entrepreneurs.</li><li>Analysis: Conduct analysis on market and investment trends in the blockchain industry, inclusive of market research, data collection and feasibility studies on potential blockchain investments;</li><li>Due Diligence: Performing due diligence on investment prospects to drive investment decisions including market research, product reviews, competitive analysis, metrics analysis, customer/user reviews and technical diligence.</li><li>Portfolio Work: Communicating with the Wintermute portfolio founders to provide support</li><li>Ecosystem Building: being an active contributor to the blockchain/cryptocurrencies community by organizing activities, participating in local events and looking for ways to help grow the Wintermute Ventures franchisee.</li><li>Admin: Assist with admin projects such as liaising and coordinating with internal / external parties including auditors, custody providers, cap table management software and general administrative support as needed across the venture business</li></ul><p><br></p><b>Hard Skills Requirements</b><ul><li>Experience interacting with DeFi protocols and a native understanding of blockchain technology with experience reviewing white papers or crypto projects.</li><li>Bachelor degree in Business, Science Finance, Commerce, Economics or related field, or equivalent practical experience</li><li>An understanding of venture capital and crypto deal terms</li><li>A minimum of 3 years of professional experience in consulting, investing or high growth tech with financial modelling capability</li><li>The ability to think analytically and strategically about investment decisions and ongoing work with existing portfolio companies.</li><li>The ability to work well within a team and be self-guided on a day-to-day basis</li><li>Strong written and analytical skills for deal analysis and internal reporting.</li><li>Strong relationship building skills and enjoy networking with project founders and broader community</li><li>A demonstrated history of being proactive.</li></ul><p><br></p><b>Bonus Requirements </b><ul><li>A technical background or experience in data science is a plus.</li><li>Strong network in crypto is a plus</li><li>Former background from working within the crypto industry at a infrastructure player (custodian, trading firm, exchange or similar)</li></ul><p><br></p><b>Perks</b><ul><li>Engaging projects offering accelerated responsibility and ownership compared to traditional finance environments</li><li>Performance-based compensation with significant earning potential</li><li>Flat company structure: your ideas get heard by the right people very quickly</li></ul><ul><li>Work flexibility: This role is open to remote candidates located in the US</li><li>Dynamic and Multicultural work environment (20 nationalities and counting!)</li></ul><p><br></p><p></p>\\n<br/><br/>Please mention the word **SPARKLING** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "USA / Remote",
  "salary_min": 50000,
  "salary_max": 80000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-investment-manager-wintermute-1093149",
  "url": "https://remoteOK.com/remote-jobs/remote-investment-manager-wintermute-1093149"
}