{
  "slug": "remote-software-engineer-ii-android-alltrails-1093238",
  "id": "1093238",
  "epoch": 1748217755,
  "date": "2025-05-26T00:02:35+00:00",
  "company": "AllTrails",
  "company_logo": "https://remoteok.com/assets/img/jobs/2e04a84feaf7a634f7bd8cb877b079411748217756.png",
  "position": "Software Engineer II Android",
  "tags": [
    "software",
    "design",
    "training",
    "testing",
    "test",
    "ui",
    "education",
    "investment",
    "java",
    "mobile",
    "android",
    "go",
    "engineer",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/2e04a84feaf7a634f7bd8cb877b079411748217756.png",
  "description": "<p><b><span style=\"font-size: 16px\">About AllTrails</span></b></p><p><br></p><p><span style=\"font-size: 16px\">AllTrails is the worldâ\u0080\u0099s most popular and trusted platform for outdoor exploration. We connect people to the outdoors, help them discover new places, and elevate their experiences on the trail. With the most comprehensive collection of trails in the world, AllTrails supports inclusive access to nature for a global community of millions of trailgoers. Every day, we solve incredibly hard problems to get more people outside, for their wellbeing and the collective care of the natural world. Join us!</span></p><p><br></p><p><span style=\"font-size: 16px\">This is a U.S.-based remote position. San Francisco Bay Area employees are highly encouraged to come into the office one day a week.</span></p><p><br></p><p><b style=\"font-size: 24px;\">Software Engineer II, Android</b></p><p><span style=\"font-size: 10pt;\">&nbsp;</span></p>\\n<p></p><p><br></p><b>What Youâ\u0080\u0099ll Be Doing:</b><ul><li>Design, build and implement new product features for the AllTrails Android app</li><li>Coordinate tasks with your teammates and self-pilot through each sprint</li><li>Identify and squash bugs</li><li>Deliver performant, reliable, scalable, and secure code</li><li>Monitor performance and address scaling issues</li></ul><p><br></p><b>Requirements:</b><ul><li>Demonstrable projects and results from 3+ years of developing native Android applications</li><li>Bachelorâ\u0080\u0099s degree in Computer Science or equivalent</li><li>Significant Kotlin, Java and Android Studio experience&nbsp;</li><li>Familiarity with RESTful APIs</li><li>Experience with Compose</li><li>Experience with Android UI themes, styles, and attributes</li><li>Proficient in Kotlin Flows</li><li>Experience with SQLite and other persistence technologies</li><li>Proficiency with Git/Github or other distributed version control systems</li><li>Self-motivation and a deep sense of pride in your work</li><li>Curiosity, humility, and open-mindedness</li><li>Passion about mobile technologies and AllTrailsâ\u0080\u0099 mission to connect people to the outdoors</li><li>Experience collaborating with cross functional teams (product, analytics, design)</li></ul><p><br></p><b>Bonus Points:</b><ul><li>Fluency with A/B testing</li><li>A keen eye for interaction design and finishing touches</li><li>Proven ability to quickly learn new technology and processes</li><li>Unit testing in the Android environment</li><li>Experience working with design systems</li></ul><div><br></div><p><br></p><b>What We Offer: </b><ul><li>A competitive and equitable compensation plan. This is a full-time, salaried position that includes equity.</li><li>Physical &amp; mental well-being including health, dental and vision benefits.</li><li>Trail Days: No meetings first Friday of each month to go test the app and explore new trails!</li><li>Unlimited PTO</li><li>Flexible parental leave&nbsp;</li><li>Remote employee equipment stipend to create a great remote work environment. </li><li>Annual continuing education stipend.</li><li>Discounts on subscription and merchandise for you and your friends &amp; family.</li><li>An authentic investment in you as a human being and your career as a professional.</li></ul><p><br></p><p></p>\\n<div>$140,000 - $180,000 a year</div><small><div><span style=\"font-size: 13.3333px;\">A successful candidateâ\u0080\u0099s starting salary will be determined based on various factors such as skills, experience, training and credentials, as well as other business purposes or needs.&nbsp; It is not typical for a candidate to be hired at or near the top of the range of their role and compensation decisions are dependent on the factors and circumstances of each case.&nbsp;</span></div></small>\\n<p>Nature celebrates you just the way you are and so do we! At AllTrails weâ\u0080\u0099re passionate about nurturing an inclusive workplace that values diversity. Itâ\u0080\u0099s no secret that companies that are diverse in background, age, gender identity, race, sexual orientation, physical or mental ability, ethnicity, and perspective are proven to be more successful. Weâ\u0080\u0099re focused on creating an environment where everyone can do their best work and thrive. </p><p><br></p><p>AllTrails participates in the E-Verify program for all remote locations.</p><p>By submitting my application, I acknowledge and agree to AllTrails' <a class=\"postings-link\" href=\"https://privacy.alltrails.com/policies/en-US?name=job-applicant-privacy-notice\">Job Applicant Privacy Notice</a>. </p><br/><br/>Please mention the word **HEARTFELT** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Remote",
  "salary_min": 77500,
  "salary_max": 125000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-software-engineer-ii-android-alltrails-1093238",
  "url": "https://remoteOK.com/remote-jobs/remote-software-engineer-ii-android-alltrails-1093238"
}