{
  "slug": "remote-testing-engineer-trial-library-1093169",
  "id": "1093169",
  "epoch": 1747180807,
  "date": "2025-05-14T00:00:07+00:00",
  "company": "Trial Library",
  "company_logo": "https://remoteok.com/assets/img/jobs/64ce4fe8454b560cca1a63f5e9bb87f81747180809.png",
  "position": "Testing Engineer",
  "tags": [
    "testing",
    "system",
    "frontend",
    "security",
    "python",
    "software",
    "test",
    "code",
    "qa",
    "typescript",
    "api",
    "reliability",
    "health",
    "healthcare",
    "engineer",
    "engineering",
    "backend"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/64ce4fe8454b560cca1a63f5e9bb87f81747180809.png",
  "description": "<p><b style=\"font-size: 18px\">Our mission is to improve health equity by expanding access to cancer precision medicine.</b></p><p><br></p><p>Trial Library, Inc. is a venture-backed startup founded in 2022 on a mission to advance equity in oncology clinical trials.&nbsp;</p><p><br></p><p>We are a diverse team of experts who believe that health equity starts with patient and provider empowerment.&nbsp;We believe that inequities in clinical trial access need to be addressed <b>creatively and intentionally. </b>We believe that inclusive research environments can answer questions that <b>improve health outcomes for all</b>, not just the few who participate in clinical trials. We believe in the power of technology to disseminate <b>high quality health information</b> about clinical trials sustainably. We believe in the <b>power of representation</b> in online health communication.</p><p><br></p><p>We are seeking a talented and experienced <b>Testing Engineer</b> to join our team. This person will play a key part in ensuring the quality and reliability of Trial Libraryâ\u0080\u0099s suite of solutions to accelerate clinical trial recruitment. This role will be responsible for designing and implementing comprehensive testing strategies across our technology stack, including AI-powered services, clinical trial search, and user-facing applications. This position is critical to maintaining the highest quality standards as we work towards our company mission.</p>\\n<p></p><p><br></p><ul><li>Design, develop, and execute test plans, test cases, and integration tests to ensure comprehensive testing coverage across our technology stack</li><li>Develop and implement QA processes and best practices to improve overall product quality</li><li>Maintain thorough documentation of testing procedures and results</li><li>Maintain automated testing frameworks for backend services (Python), and frontend applications (Typescript)</li><li>Design and implement continuous integration and continuous delivery (CI/CD) testing pipelines</li><li>Conduct API, performance, and security testing to ensure system reliability and data integrity</li><li>Collaborate with product and engineering to understand requirements and QA features to make sure they meet quality standards before release</li><li>Perform thorough regression testing to prevent new code changes from affecting existing functionality</li><li>Identify, document, and track bugs in our issue tracking system (Jira)</li><li>Work with healthcare and clinical trial datasets, ensuring compliance with privacy and regulatory standards (e.g., HIPAA)</li></ul><p><br></p><ul><li>Bachelor's degree or similar in Computer Science, Software Engineering, or a related field</li><li>3+ years of experience in software quality assurance, with expertise in both manual and automated testing</li><li>Proficiency in both <b>Python</b> and <b>Typescript</b></li><li>Experience with test automation frameworks for Python (e.g., Pytest) and TypeScript (e.g., Jest, Cypress)</li><li>Experience with API testing tools and performance testing methodologies</li><li>Familiarity with relational database systems (e.g., Postgres)</li><li>Experience with CI/CD pipelines (e.g., Jenkins, Bitbucket)</li><li>Experience testing AI/ML models and systems is a significant plus</li><li>Experience with healthcare tech or clinical trials is a significant plus</li><li>Respect for compliance and privacy requirements in healthcare (e.g. HIPAA)</li></ul><p><br></p><p></p>\\n<p><b style=\"font-size: 18px\">Our Core Values</b></p><p><br></p><p>1. <b>Ally</b> is our favorite moniker</p><p>2. The most <b>inclusive</b> approach is worth the work</p><p>3. Celebrate measurable improvements in <b>equity </b>outcomes</p><p>4. Fearless advocates for <b>diversity</b></p><p>5. <b>Incentives matter </b>to stakeholders choosing our products</p><p>6. Taking <b>initiative </b>is actually giving&nbsp;</p><p>7. We are <b>accountable</b> for the experience of patients and providers</p><p>8. <b>Empathy </b>and <b>humility</b> are the real dynamic duo</p><p><br></p><p><span style=\"font-size: 10px\">Trial Library, Inc. provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations, and ordinances.</span></p><p><br></p><br/><br/>Please mention the word **JUBILATE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "San Francisco, CA",
  "salary_min": 70000,
  "salary_max": 120000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-testing-engineer-trial-library-1093169",
  "url": "https://remoteOK.com/remote-jobs/remote-testing-engineer-trial-library-1093169"
}