{
  "slug": "remote-sales-engineer-en-tameson-1093298",
  "id": "1093298",
  "epoch": 1748937652,
  "date": "2025-06-03T08:00:52+00:00",
  "company": "Tameson",
  "company_logo": "https://remoteok.com/assets/img/jobs/d17872142e42a7820a2154b47b0467151748937652.png",
  "position": "Sales Engineer EN",
  "tags": [
    "technical",
    "software",
    "marketing",
    "sales",
    "engineer",
    "ecommerce"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/d17872142e42a7820a2154b47b0467151748937652.png",
  "description": "<p><strong>For this role, you must be physically located in the GMT+1 or GMT+2.</strong> Although this is a <strong>remote position</strong>, we will not consider candidates outside these regions as the job requires communication with customers during business hours (<strong>32-40h</strong> per week Mon-Fri). Please apply in English only.</p><p><strong><br />What we're working on</strong></p><p>Tameson is more than just an online store for industrial products. Our goal is to make it as easy as possible to find the best products for your project. We accomplish this through our website, service, and product offerings. We pay a lot of attention to excellent product advice. This is reflected in our high customer reviews and we are very proud of that. Weâ\u0080\u0099re scaling internationally and for this weâ\u0080\u0099re looking for a remotely based Sales Engineer.<strong><br /></strong></p><p></p><p><strong>What you will be doing</strong></p><ul><li><p>Support customers with your technical knowledge. Fluid control knowledgeÂ is not required (we can train you in this).</p></li><li><p>Develop relationships with new customers and retaining current customers.</p></li><li><p>You show potential customers why they will benefit from putting their trust in Tameson as their industrial supplier.</p></li><li><p>Proactively identify and propose process improvements by leveraging software tools and AI to optimize workflows and enhance the customer experience.</p></li><li><p>Work closely with our product and marketing team to improve customer experience and impact the evolution of Tamesonâ\u0080\u0099s products and services.</p></li></ul><br /><p><strong>Your profile</strong></p><ul><li><p>This position will make you happy when you enjoy talking to people, and helping them with their questions.</p></li><li><p>You possess a strong understanding and technical knowledge in order to speak confidently to customers and provide them with advice.</p></li><li><p>Your degree in higher professional technical educationÂ or previous work experience provides a solid base for this.</p></li><li><p>You take ownership and seek collaboration with colleagues.</p></li><li><p>You have an affinity with ecommerce and youâ\u0080\u0099re interested in process improvements, and automations. </p></li><li><p>You are customer-oriented and are able to find the optimum solution for both customer and Tameson.</p></li><li><p>Fluency in English is required for this position; proficiency in an additional language such as Spanish, German, Dutch, or French is considered an asset.</p></li><li><p>Youâ\u0080\u0099re able to work independent andÂ remotely, and you enjoy working in an international dynamic team.</p></li></ul><img src=\"https://recruitee-main.s3.eu-central-1.amazonaws.com/uploads/uct5dvvl18/Additional_images-6.jpg\" /><p><strong>What we offer</strong></p><p>You will join a young, fast-growing company on a mission. You will become part of an international team with different backgrounds and cultures. There are various directions to grow in because we look primarily at you as a person, and from there at what suits you. Of course a competitive salary and secondary conditions are part of the deal.<br /><br /><strong>Important:Â </strong><span>You will join us as an independent contractor. Due to the substantial differences between labor and business laws in each country, the easiest way to hire talent outside of our registered countries is through freelance contracts.</span></p><br/><br/>Please mention the word **PLEASURABLE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 47500,
  "salary_max": 70000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-sales-engineer-en-tameson-1093298",
  "verified": true,
  "url": "https://remoteOK.com/remote-jobs/remote-sales-engineer-en-tameson-1093298"
}