{
  "slug": "remote-senior-react-native-sdk-engineer-nami-ml-1093276",
  "id": "1093276",
  "epoch": 1748558206,
  "date": "2025-05-29T22:36:46+00:00",
  "company": "Nami ML",
  "company_logo": "https://remoteOK.com/assets/img/jobs/66181e93b3633645adbd55f32fa7c0f71748558206.png",
  "position": "Senior React Native SDK Engineer",
  "tags": [
    "dev",
    "javascript",
    "react native",
    "mobile",
    "typescript"
  ],
  "logo": "https://remoteOK.com/assets/img/jobs/66181e93b3633645adbd55f32fa7c0f71748558206.png",
  "description": "<p>Remote OK, Contract Role, Open toÂ Transaction to Full-Time</p><h3><strong>About Nami ML</strong></h3><p>Nami helps large enterprises accelerate subscription revenue. We provide a powerful no-code platform for building, optimizing, and growing subscription-based productions. Our customers trust Nami to help them move faster, optimize the funnel, and outperform revenue targets.</p><h3><strong>The Role</strong></h3><p>Weâ\u0080\u0099re looking for a <strong>Senior React Native Engineer</strong> whoâ\u0080\u0099s deeply experienced with the New Architecture (including TurboModules &amp; Fabric) and is excited about building production-ready SDKs and mobile features that are integrated into apps used by millions.</p><p>This is a hands-on, high-impact role working at the intersection of performance, developer experience, and mobile innovation.</p><p>Compensation for this position is between $50,000 â\u0080\u0093 $180,000 USD annually, depending on experience and location. This is a contract role with the potential to transition to full-time.</p><h3><strong>What Youâ\u0080\u0099ll Do</strong></h3><ul><li>Lead development of React Native features using the New Architecture (Fabric + TurboModules)</li><li>Build reusable, high-performance native SDK modules and libraries</li><li>Integrate with and extend native platforms (iOS/Android) as needed</li><li>Own and expand our automated mobile test coverage using Detox</li><li>Help define internal best practices for React Native, component structure, and CI/CD</li><li>Collaborate directly with product and design to create fast, fluid mobile experiences</li><li>Stay on top of evolving trends in React Native and native mobile development</li></ul><h3><strong>What Weâ\u0080\u0099re Looking For</strong></h3><ul><li>5+ years in React Native development, and specific experience with Â <br /><ul><li>Deep familiarity with the React Nativeâ\u0080\u0099s New Architecture</li><li>TurboModules</li><li>Fabric Renderer</li><li>Native module development (bridge-free architecture)</li></ul></li><li>Experience building production-ready SDKs or libraries</li><li>Comfortable writing and debugging native code in Swift and Kotlin</li><li>Proficient with automated testing tools like Detox</li><li>Clear communicator who thrives in a startup-paced, remote environment</li><li>Bonus: Familiarity with analytics SDKs, Firebase, Amplitude, or mobile monetization tools</li></ul><h3><strong>Why Nami</strong></h3><ul><li>Impact mission-critical components used in top-tier products</li><li>Fully remote team with high ownership and low bureaucracy</li><li>Collaborate with experienced entrepreneurs and technologists</li><li>Help shape the next generation of subscription growth tools</li></ul><br/><br/>Please mention the word **ACCOMMODATIVE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 50000,
  "salary_max": 180000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-senior-react-native-sdk-engineer-nami-ml-1093276",
  "original": true,
  "url": "https://remoteOK.com/remote-jobs/remote-senior-react-native-sdk-engineer-nami-ml-1093276"
}