{
  "slug": "remote-defi-sales-business-development-manager-helix-1093261",
  "id": "1093261",
  "epoch": 1748458805,
  "date": "2025-05-28T19:00:05+00:00",
  "company": "HELIX",
  "company_logo": "https://remoteok.com/assets/img/jobs/285467c46a9e58db5430729e8d90c24d1748458805.jpg",
  "position": "DeFi Sales & Business Development Manager",
  "tags": [
    "defi",
    "manager",
    "web3",
    "crypto",
    "growth",
    "investor",
    "strategy",
    "marketing",
    "sales"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/285467c46a9e58db5430729e8d90c24d1748458805.jpg",
  "description": "<p>About Us</p><p>HELIX is building the Blackstone of Web3! It offers USHD, a compliant, dollar-pegged stablecoin designed for DeFi â\u0080\u0094 the first RWA multi-strategy stablecoin providing opportunities across the risk-reward curve.</p><p>HELIX is led by TradFi experts with a $500M+ track record and zero defaults over seven years, HELIX combines institutional-grade credit with DeFi composability.</p><p>Winner of the Tokenized Debt &amp; Bond Award at the 2023 TADS Awards, HELIX distinguishes itself through its strong Web2 institutional backing, proprietary Bank-grade credit analytics, a robust asset origination pipeline and solid investor support. </p><p>HELIX is backed by VCs like - Taisu Ventures, Saison Capital, Superscrypt, Outlier Ventures, Comma3 Ventures, Wave Digital, NewTribe Capital, Aptos, Gallet Capital and more as well as select angels from organisation like - Fireblocks, BlockTower, NeoClassic Capital, Algorand, Hedera, Wormhole, Synthetix, Milken Institute and more.</p><p></p><p>Role Overview</p><p>As a Business Development Manager, your primary responsibility will be to drive the growth of our RWA DeFi platform by driving sales and revenue growth, securing strategic partnerships, and leading fundraising initiatives. This role demands a proactive individual with a deep understanding of the DeFi landscape and a deep network with the broader DeFi ecosystem, liquidity providers and investors, capable of identifying and capitalising on new business opportunities.</p><p></p><p>Key Responsibilities</p><p>Sales &amp; Revenue Growth</p><ul> <li>Drive user acquisition and platform adoption through targeted sales initiatives.</li> <li>Develop and manage a sales pipeline, tracking leads from initial contact to conversion.</li> <li>Collaborate with marketing and product teams to align sales strategies with product offerings.</li> </ul><p>Strategic Partnerships &amp; Ecosystem Expansion</p><ul> <li>Identify, engage, and establish partnerships with DeFi protocols, Layer 1/Layer 2 networks, DAOs, and institutional players.</li> <li>Negotiate and close partnership deals that align with our strategic objectives.</li> <li>Manage the integration of new partnerships into our platform, ensuring mutual value creation.</li> </ul><p>Fundraising &amp; Capital Acquisition</p><ul> <li>Develop and execute fundraising strategies targeting accredited investors, VCs, and institutional partners.</li> <li>Lead the end-to-end fundraising process from investor outreach to due diligence phase to closure .</li> <li>Maintain relationships with existing investors, providing regular updates and exploring opportunities for additional funding. </li> </ul><p>Market Analysis &amp; Strategy Development</p><ul> <li>Conduct in-depth research on DeFi trends, competitor activities, and emerging opportunities.</li> <li>Provide strategic insights to inform product development and market positioning.</li> <li>Represent the company at industry events, conferences, and forums to enhance brand visibility. </li> </ul>\n<ul> <li>3+ years of experience in business development, sales, or partnerships within RWAs, DeFi and/or the broader Web3.0 space. </li> <li>Proven track record of securing partnerships and driving revenue growth</li> <li>Strong understanding of DeFi protocols, tokenomics, and the broader Web3 ecosystem</li> <li>Excellent negotiation, communication, and interpersonal skills</li> <li>Ability to work independently in a fast-paced, remote environment </li> <li>Experience with fundraising and investor relations in the crypto space</li> <li>Established network within the DeFi and Web3 communities</li> <li>Familiarity with regulatory considerations related to DeFi and digital assets</li> <li>Fluent in spoken and written English</li> </ul><p></p><br/><br/>Please mention the word **POLISHED** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 42500,
  "salary_max": 75000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-defi-sales-business-development-manager-helix-1093261",
  "url": "https://remoteOK.com/remote-jobs/remote-defi-sales-business-development-manager-helix-1093261"
}