{
  "slug": "remote-senior-product-manager-payments-europe-hostaway-1093300",
  "id": "1093300",
  "epoch": 1748937724,
  "date": "2025-06-03T08:02:04+00:00",
  "company": "Hostaway",
  "company_logo": "https://remoteok.com/assets/img/jobs/50fb847b89000b6fa4243f623805354d1748937725.png",
  "position": "Senior Product Manager Payments Europe",
  "tags": [
    "manager",
    "saas",
    "security",
    "growth",
    "management",
    "senior",
    "health"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/50fb847b89000b6fa4243f623805354d1748937725.png",
  "description": "<p style=\"text-align: start;\"><strong>NOTE: This is a FULLY remote role, but the candidate must be within Europe to collaborate with their team, peers, and internal customers. You do not have to be in the specific city shown in this listing, but <u>please only apply if you are physically based within Europe.</u></strong></p><p style=\"text-align: start;min-height: 1.7em;\"></p><p style=\"text-align: start;\"><span style=\"color: #000000\">Hostaway is the market-leading SaaS scale-up transforming the vacation rental industry. With innovative solutions and partnerships with giants like Airbnb, Expedia Group (Vrbo), and Booking.com, we're taking on the competition and winning. Leveraging our customer-centric core values, we consistently deliver results that encourage growth, learning, and innovation for our team, our customers, and the industry.</span></p><p style=\"text-align: start;min-height: 1.7em;\"></p><p style=\"text-align: start;\"><span style=\"color: #000000\">As a profitable and growing company, this role is necessitated by our continued growth. Check out more about our recent funding round of $365 million </span><u><a rel=\"noopener\" target=\"_blank\" href=\"https://www.hostaway.com/blog/hostaway-raises-365-million/?placement=&amp;keyword=hostaway&amp;utm_campaign=gg_emea_dg_search_brand_exact&amp;utm_source=google&amp;utm_medium=paid_search&amp;utm_content=brand_exact&amp;utm_term=hostaway&amp;hsa_acc=1558130764&amp;hsa_cam=20285764070&amp;hsa_grp=149795465945&amp;hsa_ad=703390329010&amp;hsa_src=g&amp;hsa_tgt=kwd-323175560058&amp;hsa_kw=hostaway&amp;hsa_mt=e&amp;hsa_net=adwords&amp;hsa_ver=3&amp;gad_source=1&amp;gclid=CjwKCAiA9bq6BhAKEiwAH6bqoFzIiBxWyYjgj1eHkWBbx21yE_0H832dTtEPhfNCYj-TMlL-GnknahoCGzkQAvD_BwE\"><span style=\"color: #1155CC\">here</span></a></u><span style=\"color: #000000\">.</span></p><p style=\"min-height: 1.7em;\"></p><h3 style=\"text-align: start;\"><strong>About this role</strong></h3><p><span style=\"color: #000000\">We are seeking a Senior Product Manager to take ownership of our B2B2C product features, which include, but are not limited to our Payments integrations, Guest Payments, and Invoicing.</span></p><p style=\"min-height: 1.7em;\"></p><p><span style=\"color: #000000\">In this role, you'll drive our Payments team, and you'll leverage your analytical capabilities to develop impactful product roadmaps. If you're passionate about data-driven products and delivering exceptional customer experiences, this is your opportunity!</span></p><p style=\"text-align: start;\"><br /></p><h3 style=\"text-align: start;\"><strong>What you will do</strong></h3><ul><li><p><span style=\"color: #000000\">Drive the evolution of our Payments domain, leading the launch and optimisation of our B2B and B2C payments product features for Property Managers, Owners and guests while ensuring robust security standards and PCI compliance.</span></p></li><li><p><span style=\"color: #000000\">Use data to guide prioritization of features, establish KPIs such as authorization rate, and surface insights to drive measurable improvements in payment conversion, cost, and reliability.</span></p></li><li><p><span style=\"color: #000000\">Engage with customers directly, particularly those who provide critical feedback and conduct user interviews to gather insights on pain points and develop actionable plans to improve customer experiences and optimize features based on recurring themes.</span></p></li><li><p><span style=\"color: #000000\">Engage other product leaders within Hostawayâ\u0080\u0099s teams to define development priorities for the product, gather requirements, and define scopes</span></p></li><li><p><span style=\"color: #000000\">Develop and maintain forward-looking product roadmaps, balancing immediate priorities with long-term strategic vision and aligning stakeholders.</span></p></li></ul><br></br><h4><strong>What you will need to succeed</strong></h4><ul><li><p><span style=\"color: #000000\">7 - 10 years of experience as a Product Manager in SaaS, ideally within the Payments domain.</span></p></li><li><p><span style=\"color: #000000\">Exceptional analytical skills and a proven ability to interpret complex data sets, draw actionable insights, and guide strategic decisions.</span></p></li><li><p><span style=\"color: #000000\">Proven ability to independently solve complex problems using structured frameworks and cross-functional collaboration.</span></p></li><li><p><span style=\"color: #000000\">Excellent product specification skills with attention to detail and strategic alignment.</span></p></li><li><p><span style=\"color: #000000\">Demonstrated capability in project execution, coordinating complex projects, and ensuring product reliability.</span></p></li><li><p><span style=\"color: #000000\">Ability to create comprehensive, forward-looking product roadmaps that balance short-term execution with long-term strategic goals.</span></p></li><li><p><span style=\"color: #000000\">You have exceptional interpersonal skills with a proven ability to collaborate, influence, and drive consensus amongst team members and various management levels.</span></p></li><li><p><span style=\"color: #000000\">Strong experience conducting user research and effectively translating customer insights into actionable product strategies.</span></p></li></ul><p style=\"min-height: 1.7em;\"></p><h3>What we offer</h3><ul><li><p><strong>Competitive Compensation:</strong> We offer competitive pay based on market rates in the country of the applicant.</p></li><li><p><strong>100% Remote:</strong> Enjoy the freedom to work from anywhere within your country of residenceâ\u0080\u0094be it a co-working space, your home office, or even your dining room table. The choice is yours. Just donâ\u0080\u0099t ask to work in our office (we donâ\u0080\u0099t have one).</p></li><li><p><strong>Equity:</strong> Every role in our company comes with valuable stock options in a fast-growing and profitable company. This ensures we all share in the companyâ\u0080\u0099s success.</p></li><li><p><strong>Values-Driven Leadership:</strong> Our Core Values are not just words weâ\u0080\u0099ve written to make us feel good. We leverage them daily when making strategic and tactical decisions.</p></li><li><p><strong>Professional Growth:</strong> Our rapid growth offers unparalleled learning and development opportunities, along with a multitude of career advancement opportunities.</p></li><li><p><strong>Annual Paid Leave:</strong> The specific amounts vary by country and are aligned with country and/or contract-specific norms.</p></li><li><p><strong>Geographic Specific Benefits:</strong> As an international employer, we offer different country-specific benefits such as Health Insurance and Pensions in countries where these perks are customary. The specifics depend on the country of the applicant.</p></li><li><p><strong>Dynamic Team Culture:</strong> As a global company with team members in over 40 countries, our diverse and international culture fuels our innovation and creativity, providing a key pillar to our success (and making it a lot of fun to work here).</p><p style=\"min-height: 1.7em;\"></p></li></ul><p style=\"text-align: start;\">Thank you for your interest. If you apply for this role, you will receive an email from our Talent Acquisition team after your application has been reviewed alongside the qualifications for this role and the qualifications of others who have applied.</p><p style=\"min-height: 1.7em;\"></p><br/><br/>Please mention the word **LAVISH** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 50000,
  "salary_max": 95000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-senior-product-manager-payments-europe-hostaway-1093300",
  "verified": true,
  "url": "https://remoteOK.com/remote-jobs/remote-senior-product-manager-payments-europe-hostaway-1093300"
}