{
  "slug": "remote-staff-mobile-engineer-react-native-europe-hostaway-1093235",
  "id": "1093235",
  "epoch": 1748217723,
  "date": "2025-05-26T00:02:03+00:00",
  "company": "Hostaway",
  "company_logo": "https://remoteok.com/assets/img/jobs/4a1b68b68e038ce196513696543d9e561748217724.png",
  "position": "Staff Mobile Engineer React Native Europe",
  "tags": [
    "react",
    "design",
    "ios",
    "saas",
    "security",
    "technical",
    "testing",
    "test",
    "growth",
    "web",
    "javascript",
    "git",
    "api",
    "mobile",
    "management",
    "android",
    "health",
    "engineer",
    "backend",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/4a1b68b68e038ce196513696543d9e561748217724.png",
  "description": "<p><strong><span style=\"color: #121317\">NOTE: This is a FULLY remote role, but the candidate must be within Europe to collaborate with their team, peers, and internal customers. You do not have to be in the specific city shown in this listing, but </span><u><span style=\"color: #121317\">please only apply if you are physically based within Europe.</span></u><br /></strong></p><p><strong><br /></strong></p><p>Hostaway is the market-leading SaaS scale-up transforming the vacation rental industry. With innovative solutions and partnerships with giants like Airbnb, VRBO, and Booking, we're taking on the competition and winning. Leveraging our customer-centric core values, we consistently deliver results that encourage growth, learning, and innovation for our team, our customers, and the industry.</p><p><br /></p><p>As a profitable and growing company, this role is necessitated by our continued growth. Check out more about our recent funding round of $365 million <u><a rel=\"noopener\" target=\"_blank\" href=\"https://www.hostaway.com/blog/hostaway-raises-365-million/?placement=&amp;keyword=hostaway&amp;utm_campaign=gg_emea_dg_search_brand_exact&amp;utm_source=google&amp;utm_medium=paid_search&amp;utm_content=brand_exact&amp;utm_term=hostaway&amp;hsa_acc=1558130764&amp;hsa_cam=20285764070&amp;hsa_grp=149795465945&amp;hsa_ad=703390329010&amp;hsa_src=g&amp;hsa_tgt=kwd-323175560058&amp;hsa_kw=hostaway&amp;hsa_mt=e&amp;hsa_net=adwords&amp;hsa_ver=3&amp;gad_source=1&amp;gclid=CjwKCAiA9bq6BhAKEiwAH6bqoFzIiBxWyYjgj1eHkWBbx21yE_0H832dTtEPhfNCYj-TMlL-GnknahoCGzkQAvD_BwE\">here</a></u>.</p><h4><strong><br /></strong></h4><h3><strong>About the role</strong></h3><p>As our<strong>Â Staff Mobile Engineer</strong>, you will be responsible for leading the continued development, optimization, and expansion of our mobile application built with React Native. You will be in a pivotal technical leadership role to ensure cross-functional teams build the right solutions that solve customer problems in a way that is secure, extensible, and scalable for the future. You will be expected to govern the technical maturity of the respective domain, having a clear view of the architectural challenges and how to remediate them over time.</p><h3><br /><strong>Key Responsibilities</strong></h3><ul><li><p>Lead the mobile development team, providing technical leadership and mentorship.</p></li><li><p>Architect and implement mobile application features for iOS and Android according to the design provided by the design team.</p></li><li><p>Ensure feature parity between the mobile app and the SaaS web platform.</p></li><li><p>Develop and maintain a high-performance, scalable mobile application using React Native.</p></li><li><p>Conduct comprehensive performance optimization and stability improvements.</p></li><li><p>Implement robust testing strategies.</p></li><li><p>Improve continuous integration/continuous deployment (CI/CD) processes with Fastlane.</p></li><li><p>Collaborate closely with product management, design, and backend teams.</p></li><li><p>Review code, provide technical guidance, and maintain high coding standards.</p></li><li><p>Identify and resolve performance bottlenecks and technical debt.</p></li><li><p>Stay updated with the latest mobile development trends and React Native best practices.</p></li></ul><p><br /></p><br></br><ul><li><p>7+ years of professional mobile application development experience</p></li><li><p>5+ years of experience with React Native</p></li><li><p>Proficiency in JavaScript and TypeScript</p></li><li><p>Proven experience in developing and maintaining cross-platform mobile applications</p></li><li><p>Strong understanding of iOS and Android platform-specific considerations</p></li><li><p>Experience with state management solutions (Redux)</p></li><li><p>Experience with mobile app performance optimization techniques</p></li><li><p>Experience with mobile app testing frameworks</p></li><li><p>Understanding of RESTful API integration</p></li><li><p>Proficiency with Git and version control workflows</p></li><li><p>Experience with continuous integration and deployment pipelines using Fastlane</p></li></ul><h3><br /><strong>Nice to have skills for this role:</strong></h3><ul><li><p>Knowledge of performance profiling toolsÂ </p></li><li><p>Familiarity with GraphQL</p></li><li><p>Understanding of mobile security best practicesÂ </p></li><li><p>Experience with mobile design systems</p></li></ul><p><br /></p><h3><strong>Technical Challenges You Will Work On</strong></h3><ul><li><p>Improving app performance and reducing load times.<br /></p></li><li><p>Implementing complex features with a modern user experience.<br /></p></li><li><p>Maintaining consistent functionality across iOS and Android platforms.<br /></p></li><li><p>Maintaining high test coverage.<br /></p></li><li><p>Implementing robust error handling and logging.<br /><br /></p></li></ul><h3><strong>What we offer</strong></h3><ul><li><p><strong>Competitive Compensation:</strong> We offer competitive pay based on market rates in the country of the applicant.</p></li><li><p><strong>100% Remote:</strong> Enjoy the freedom to work from anywhere within your country of residenceâ\u0080\u0094be it a co-working space, your home office, or even your dining room table. The choice is yours. Just donâ\u0080\u0099t ask to work in our office (we donâ\u0080\u0099t have one).</p></li><li><p><strong>Equity:</strong> Every role in our company comes with valuable stock options in a fast-growing and profitable company. This ensures we all share in the companyâ\u0080\u0099s success.</p></li><li><p><strong>Values-Driven Leadership:</strong> Our Core Values are not just words weâ\u0080\u0099ve written to make us feel good. We leverage them daily when making strategic and tactical decisions.</p></li><li><p><strong>Professional Growth:</strong> Our rapid growth offers unparalleled learning and development opportunities, along with a multitude of career advancement opportunities.</p></li><li><p><strong>Annual Paid Leave:</strong> The specific amounts vary by country and are aligned with country and/or contract-specific norms.</p></li><li><p><strong>Geographic Specific Benefits:</strong> As an international employer, we offer different country-specific benefits such as Health Insurance and Pensions in countries where these perks are customary. The specifics depend on the country of the applicant.</p></li><li><p><strong>Dynamic Team Culture:</strong> As a global company with team members in over 40 countries, our diverse and international culture fuels our innovation and creativity, providing a key pillar to our success (and making it a lot of fun to work here).</p></li></ul><p><br /></p><p>Thank you for your interest. If you apply for this role, you will receive an email from our Talent Acquisition team after your application has been reviewed alongside the qualifications for this role and the qualifications of others who have applied.</p><p><br /></p><p>Only candidates applying withÂ <strong>CV + link to a GitHub projects </strong>will be considered for this role.<br /><a rel=\"noopener\" target=\"_blank\" href=\"https://www.instagram.com/hostawaycom/\"><br /></a></p><br/><br/>Please mention the word **STIRRINGLY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 72500,
  "salary_max": 112500,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-staff-mobile-engineer-react-native-europe-hostaway-1093235",
  "verified": true,
  "url": "https://remoteOK.com/remote-jobs/remote-staff-mobile-engineer-react-native-europe-hostaway-1093235"
}