{
  "slug": "remote-senior-account-lead-sanctuary-computer-1093250",
  "id": "1093250",
  "epoch": 1748274389,
  "date": "2025-05-26T15:46:29+00:00",
  "company": "Sanctuary Computer",
  "company_logo": "https://remoteOK.com/assets/img/jobs/ce615089d7b8a83eb463f9340c4386fb1748543365.png",
  "position": "Senior Account Lead",
  "tags": [
    "dev",
    "exec",
    "sys admin",
    "saas",
    "devops"
  ],
  "logo": "https://remoteOK.com/assets/img/jobs/ce615089d7b8a83eb463f9340c4386fb1748543365.png",
  "description": "<p><strong>Original job post link:</strong></p><p><a href=\"https://garden3d.notion.site/Senior-Account-Lead-1fc131fea2c7809ca54ee4bb35e67d31\" title=\"Senior Account Lead\">https://garden3d.notion.site/Senior-Account-Lead-1fc131fea2c7809ca54ee4bb35e67d31</a></p><p><br /></p><p>ð\u009f\u008c\u008e About garden3d</p><p>We are a worker-owned creative collective, innovating on everything from brands and IRL communities to IoT devices and cross-platform apps. We share profit, open source everything, spin out new businesses, and invest in exciting ideas through financial and/or in-kind contributions.</p><p><br /></p><p>Our client roster includes Google, Stripe, Figma, Hinge, Black Socialists in America, ACLU, Pratt, Parsons, Mozilla, The Nobel Prize, MIT, Gnosis, Etsy &amp; Gagosian. Weâ\u0080\u0099re the software team behind innovative products like The Light Phone &amp; Mill, and we a global, decentralized community space collective called Index Space.</p><p><br /></p><p>We think of our garden3d as collective for creative people, prioritizing a happy, talented, and diverse studio culture. We work on projects that bring value to our world, and we balance deep care for the work we do with a genuine curiosity about life outside of our jobs.</p><p><br /></p><p>â\u009b°ï¸\u008f<strong>The Account Lead Role</strong></p><p>As garden3dâ\u0080\u0099s Senior Account Lead, youâ\u0080\u0099ll own the end-to-end client experience and revenue portfolio for our 30-person, ~$6 MM/year collective specializing in digital design and development.</p><p>You will play a pivotal role in driving account growth, ensuring client satisfaction, and maintaining project profitability. This role is perfect for a strategic relationship-builder with a keen eye for detail and extensive experience managing complex engagements.</p><p>Beyond high-level account oversight, youâ\u0080\u0099ll develop multi-year growth plans, lead executive-level conversations, and implement clear governance and change-management processes to keep projects on time, on budget, and aligned with business goals. Youâ\u0080\u0099ll partner closely with our Founder and our cross-functional Team Leads to translate garden3dâ\u0080\u0099s strategic vision into tangible results for our clientsâ\u0080\u0094and our bottom line.</p><p><br /></p><p>ð\u009f\u0092¸<strong> Compensation</strong></p><p>At garden3d, we believe that those who drive the shoulder the most responsibility, and create the greatest impact should be paid accordingly.</p><p>As such â\u0080\u0094 this role operates like a partner at a law firm, offering a commission-based compensation model that grows alongside the success one has in the role. This structure recognizes deep expertise and accountability, and also encourages knowledge-sharing and mentorship, as veteran colleagues invest in developing high-performing teammates.</p><p><strong>â\u0086\u0092 The Account Lead role is paid 8% of all gross revenue that they steward from the new business to completion, and beyond â\u0080\u0094 for up to a year per project. Additionally, this role will receive a dividend in our Quarterly Profit Share.</strong></p><p>Our business receives around 100 â\u0080\u0094 150 leads per year. Based on our current revenue patterns, a highly accountable, capable and ambitious senior Account Lead whoâ\u0080\u0099s built a full roster of client projects should expect to make between <strong>$150,000 â\u0080\u0094 $300,000+ USD per year.</strong></p><p><br /></p><p><strong>Responsibilities:</strong></p><p><br /></p><p>ð\u009f\u0092¸<strong>Stewardship of New Business</strong></p><p>Our Senior Account Lead champions every stage of the sales cycleâ\u0080\u0094from outbound prospecting and first outreach through handoff to deliveryâ\u0080\u0094ensuring a seamless transition for the client.</p><p>By owning pipeline health, crafting compelling proposals, and collaborating with marketing and delivery teams, they safeguard both our brand reputation and revenue goals.</p><p><br /></p><p>ð\u009f\u008f·ï¸\u008f <strong>Consultative Selling and Negotiation</strong></p><p>Leveraging deep industry insight, they diagnose client challenges and articulate tailored solutions that align with business outcomes. Through value-based frameworks and skillful contract negotiations, they secure agreements that maximize ROI for clients and profitability for garden3d.</p><p><br /></p><p>ð\u009f\u0097£ï¸\u008f <strong>Proactive Client Engagement</strong></p><p>Establishing a regular cadence of check-ins, supporting our Team Leads to anticipate needs, surface risks, and celebrate milestones. This forward-leaning communication style builds trust, keeps projects on track, and turns clients into advocates.</p><p><br /></p><p>ð\u009f\u0096\u0087ï¸\u008f <strong>Transparent Scope &amp; Change Management</strong></p><p>By documenting deliverables in a paper trail and enforcing formal change-request processes, they ensure every enhancement is tied to updated timelines, budgets, and resource allocationsâ\u0080\u0094eliminating surprises and maintaining alignment.</p><p><br /></p><p>ð\u009f\u0091\u0094 <strong>Executive-level Relationship Management</strong></p><p>They engage C-suite and senior stakeholders as trusted advisors, translating technical roadmaps into strategic business imperatives. Their credibility at the top table opens doors for cross-sell opportunities and multi-year engagements.</p><p><br /></p><p>â\u009a ï¸\u008f <strong>Escalation &amp; Issue Resolution</strong></p><p>Adhering to a â\u0080\u009cno-surprisesâ\u0080\u009d pledge, they own any client or team concernâ\u0080\u0094whether a payment discrepancy or delivery snagâ\u0080\u0094and mobilize the right experts to resolve it within 48 hours. Post-mortems on each incident drive continuous improvement.</p><p><br /></p><p>ð\u009f\u0094\u0081 <strong>Operational Excellence &amp; Process Improvement</strong></p><p>Championing best practices in CRM, resource planning, and forecasting, they refine workflows to boost efficiency and accuracy. By analyzing performance metrics and leading retrospectives, they iterate our playbooks to deliver ever-higher quality.</p><p><br /></p><p>ð\u009f\u008c­ <strong>Culture</strong></p><p>They model garden3dâ\u0080\u0099s values of partnership, curiosity, and accountability, fostering an environment where every team member feels empowered and supported. Through mentorship and recognition, they knit together diverse talents into a cohesive, high-performing team.</p><p><br /></p><p><strong>How we Interview</strong></p><p>After you submit your application, a member of our team will reach out. Our interview process starts with an intro call to answer any questions you have about the role and to learn a bit more about your experience and interests.</p><p>From there, weâ\u0080\u0099ll follow up with a panel interview call where you get to meet a few members of our team, to openly discuss some of our challenges and ensure your skills and interests align with where weâ\u0080\u0099re going as a business.</p><p>For qualified candidates, the process wraps with a reference call, and an offer to follow.</p><p><br /></p><p><strong>Qualifications:</strong></p><p>ð\u009f\u0094\u0091<strong> Must have:</strong></p><ul><li>Demonstrated new business success in a digital design, development agency (or similar)</li><li>Minimum of $1M â\u0080\u0094 $2.5M in closed net-new revenue over the past 3 years, across multiple verticals</li><li>Deep understanding of digital product lifecycles (UX/UI, front-end, back-end, mobile, DevOps)</li><li>Complete fluency in all parts of day to day project management like documenting deliverables, tracking hours, QA checkpoints, pushing back on out of scope requests</li><li>Proven ability to navigate complex RFP processes, negotiate contract terms, and close enterprise-scale deals</li><li>Expert use of CRM and pipeline-management platforms (e.g. Salesforce, HubSpot)</li><li>Comfortable leveraging data analytics and forecasting to optimize resource allocation and pricing strategies</li><li>Exceptional storytelling ability, crafting compelling proposals and pitches</li><li>Polished in both written and verbal communication, with experience leading client workshops and design-thinking sessions</li><li><strong>Located between Pacific Standard Time (UTC-8) and Central European Time (UTC+2)</strong></li></ul><p><br /></p><p>ð\u009f§\u0081<strong> Nice-to-have:</strong></p><ul><li>Fluency in lead prospecting and outbound lead generation</li><li>Up-to-date knowledge of emerging technologies (e.g. AI/ML, AR/VR, headless CMS) and how they drive competitive advantage</li><li>Strong network of contacts across Fortune 500s, fast-growth startups, or key design/development decision-makers</li><li>Credibility engaging C-suite stakeholders and acting as a trusted advisor</li><li>Experience with solution-based, value-selling methodologies (e.g. MEDDIC, Challenger Sale)</li><li>Skill in crafting and executing multi-year growth plans that tie digital design and development services to clientsâ\u0080\u0099 business KPIs</li><li>Experience sending invoices to clients and tracking complex change orders and context</li><li>Experience in a software development, design consultancy or other creative industry</li><li>Familiarity with project-based accounting and financial metrics such as utilization and profitability</li><li>Previous experience working with outside legal counsel on financial aspects of contracts (e.g., NDAs, MSAs)</li><li>A passion for working in a collaborative, creative environment</li></ul><p><strong>How we work</strong></p><p>We believe that thereâ\u0080\u0099s a better balance between the poles of freelancing &amp; full-time, and for that reason, Sanctuary works differently to most shops:</p><ul><li>Transparency &amp; Ownership: We release our Profit &amp; Loss statements to the community each year, open source our best ideas, and talk business &amp; money with everyone in the company. Weâ\u0080\u0099re proud to run our business with integrity, and for that reason, we share everything with our team &amp; community.</li><li>**150% Carbon Negative:** Our studio offsets 150% of the carbon we use to do business each year, dated back to our founding in 2015. We turn down work that is not in line with our morals, and we encourage our peers to do the same. We were certified climate neutral earlier this year.</li><li>**Strong Morals:** Since our founding, we've turned down somewhere between $1mm - $2mm of work that didn't meet our moral standards. (Most of that was DTC brands that can't show a valid sustainability initiative).</li><li><strong>Async &amp; Decentralized:</strong> We use tools optimized for calm, thoughtful communication, and opt for async whenever possible. We fight hard to maintain our focus time.</li><li><strong>Remote Friendly:</strong> Our company is fluent in remote work, making our workplace more decentralized and democratized in the process.</li><li><strong>Ideas &amp; Products:</strong> In our spare studio time, we work to build our own open source or internal products to diversify &amp; bolster our income. We create amazing technology products for our clients, so why not for the studio?</li></ul><p><br /></p><h2><strong>Please click this Important link below or copy the URL (Same as the apply button) to proceed with the application by telling us a bit more about your interest in the role:</strong></h2><p><a href=\"https://garden3d.notion.site/1fc131fea2c78054b148c84dfc9b8655\" title=\"Application Link\"><strong>https://www.notion.so/1fc131fea2c78054b148c84dfc9b8655?pvs=4</strong></a></p><br/><br/>Please mention the word **ENTICED** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 150000,
  "salary_max": 300000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-senior-account-lead-sanctuary-computer-1093250",
  "original": true,
  "url": "https://remoteOK.com/remote-jobs/remote-senior-account-lead-sanctuary-computer-1093250"
}