{
  "slug": "remote-content-writer-blink-ux-1093147",
  "id": "1093147",
  "epoch": 1746788411,
  "date": "2025-05-09T11:00:11+00:00",
  "company": "Blink UX",
  "company_logo": "https://remoteok.com/assets/img/jobs/dd6b56f1fea1949e004dc3b503657e7e1746788411.png",
  "position": "Content Writer",
  "tags": [
    "design",
    "consulting",
    "technical",
    "recruiter",
    "writer",
    "growth",
    "ux",
    "voice",
    "seo",
    "ads",
    "content",
    "marketing",
    "analytics",
    "sales",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/dd6b56f1fea1949e004dc3b503657e7e1746788411.png",
  "description": "<p><span style=\"font-size: 11pt;\">Blink UX is seeking a versatile and skilled Content Writer to join our Marketing and Sales Enablement team. This role will focus on crafting compelling content across various formats, including blogs, advertising, sales one-sheets, LinkedIn posts, and email campaigns. The ideal candidate will be able to adapt to different voices, collaborate with subject matter experts, write about complex topics in a clear, engaging way, and ensure content is optimized for search engines.</span></p>\\n<p></p><p><br></p><b>What you will be doing:</b><ul><li>Write blogs and thought leadership content in collaboration with subject matter experts, ensuring the content reflects their voice and expertise. </li><li>Create persuasive sales enablement materials, including one-sheets, case studies, and product/service descriptions. </li><li>Develop content for LinkedIn and email campaigns that engage prospects and clients.</li><li>Research and write about unfamiliar topics, quickly learning and adapting to new subjects to ensure accuracy and relevance. </li><li>Work closely with the marketing and sales teams to align content with broader business goals. </li><li>Ensure all content is optimized for SEO, including keyword research, on-page optimization, and improving content visibility.</li></ul><p><br></p><b>What we are looking for: </b><ul><li>2-3 years of experience in marketing, content strategy, or a related field.</li><li>Proven experience writing in various voices for different audiences, especially technical and expert tones.</li><li>Strong ability to collaborate with subject matter experts to produce high-quality content.</li><li>Experience writing sales enablement materials and B2B content.</li><li>Comfortable working with unfamiliar topics and conducting research to write knowledgeable, concise content.</li><li>Solid understanding of SEO best practices, including keyword research, on-page optimization, and SEO-friendly writing.</li><li>Excellent writing, editing, and communication skills.</li><li>Familiarity with LinkedIn and email marketing best practices. </li><li>Familiarity with Google Ads and Analytics is a plus</li></ul><p><br></p><p></p>\\n<div>$75,500 - $94,500 a year</div><small><div><b style=\"font-size: 10.5pt;\">Our Pay Philosophy</b></div><div><span style=\"font-size: 10.5pt;\">We provide clear career paths and opportunities for growth while maintaining a strong sense of inclusivity in our workforce. We continue to infuse the same philosophy when it comes to posting positions by practicing salary transparency; each role is assigned a clear salary band which our recruiters will review at the start of the interview process.&nbsp;So, while the above pay rate or salary range represents the expected salary for this position, in determining your actual pay it will be reviewed by a recruiter and take into consideration: your experience, your location, etc</span></div></small>\\n<p><i><span style=\"font-size: 10.5pt;\">If your experience looks a little differentâ\u0080¯from what weâ\u0080\u0099ve identified and you think you would be a good fit for the role, weâ\u0080\u0099d love to learn more about you. Please include a cover letter and state why you think youâ\u0080\u0099d be a good fit!</span></i></p><p><br></p><p><b style=\"font-size: 10.5pt;\">About Us: </b></p><p><span style=\"font-size: 10.5pt;\">Blink UX is a product design consulting firm creating products that people use, love, and remember. Blink has over two decades of experience in UX research, strategy, and design, partnering with innovative industry leaders including Amazon, Chase, Gates Foundation, Google, Meta, and NASA. For more information, visit </span><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://blinkux.com\"><span style=\"font-size: 10.5pt;\">blinkux.com</span></a><span style=\"font-size: 10.5pt;\">.</span><b style=\"font-size: 10.5pt;\">&nbsp;</b></p><p><br></p><p><b style=\"font-size: 10.5pt;\">Our Culture</b></p><p><span style=\"font-size: 10.5pt;\">Maintaining a positive company culture requires the same careful curation, management, and rigor as any other aspect of a business. At Blink, we consciously design our culture to ensure that employees have the structure and guidance they need to fully develop their skills and abilities for a happy and rewarding career. Be sure to read up on the unique aspects of our company culture framework and ensure they align with your working style.</span><b style=\"font-size: 10pt;\">&nbsp;</b></p><p><br></p><p><b style=\"font-size: 10pt;\">EEO</b></p><p><i><span style=\"font-size: 10pt;\">When hiring, we aim to build teams of compassionate people with diverse experiences, thoughts, and skills. All qualified applicants will receive consideration for employment without regard to race, color, national origin, religion, sexual preference, gender identity or age, disability or length of time spent unemployed.&nbsp;</span></i></p><p><br></p><p><i><span style=\"font-size: 10pt;\">Following your application submission,n we encourage you to disclose personal demographic information in order to help us comply with federal and state Equal Employment Opportunity record-keeping requirements. We will also use this information in an anonymous,s aggregated form to help us measure and improve diversity at Blink.</span><span style=\"font-size: 12pt;\">&nbsp;</span></i></p><br/><br/>Please mention the word **FLUTTER** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "All Locations",
  "salary_min": 47500,
  "salary_max": 75000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-content-writer-blink-ux-1093147",
  "url": "https://remoteOK.com/remote-jobs/remote-content-writer-blink-ux-1093147"
}