{
  "slug": "remote-member-of-product-marketing-protocols-anchorage-digital-1093197",
  "id": "1093197",
  "epoch": 1747652403,
  "date": "2025-05-19T11:00:03+00:00",
  "company": "Anchorage Digital",
  "company_logo": "https://remoteok.com/assets/img/jobs/b1aa1c603b1dd6742a03cd8d11bce87f1747652404.png",
  "position": "Member of Product Marketing Protocols",
  "tags": [
    "crypto",
    "security",
    "technical",
    "support",
    "copywriting",
    "growth",
    "financial",
    "finance",
    "bank",
    "lead",
    "content",
    "marketing",
    "legal",
    "sales",
    "educational"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/b1aa1c603b1dd6742a03cd8d11bce87f1747652404.png",
  "description": "<p><span style=\"font-size: 18px\"><b>At Anchorage Digital, we are building the worldâ\u0080\u0099s most advanced digital asset platform for institutions to participate in crypto.</b></span></p><p><br></p><p>Anchorage Digital is a crypto platform that enables institutions to participate in digital assets through custody, staking, trading, governance, settlement, and the industry's leading security infrastructure. Home to Anchorage Digital Bank N.A., the only federally chartered crypto bank in the U.S., Anchorage Digital also serves institutions through Anchorage Digital Singapore, Porto by Anchorage Digital<span style=\"font-size: 15px;\">, and other offerings.</span></p><p><br></p><p>The company is funded by leading institutions including Andreessen Horowitz, GIC, Goldman Sachs, KKR, and Visa, with its Series D valuation over $3 billion. Founded in 2017 in San Francisco, California, Anchorage Digital has offices in New York, New York; Porto, Portugal; Singapore; and Sioux Falls, South Dakota. Learn more at anchorage.com, on X @Anchorage, and on LinkedIn.&nbsp;</p><p><br></p><p>This individual will think strategically about how to win our market and then lead successful go-to-market initiatives. They will be responsible for developing the strategy, building deep client and competitor understanding, and impacting the way we build, market, and sell our product and service offerings. Weâ\u0080\u0099re looking for thoughtful people who can blend ideation and implementation, then articulate crisp value propositions to clients, the market, and to our team.</p><p><br></p><p>We have created the Factors of Growth &amp; Impact to help Villagers better measure impact and articulate coaching, feedback, and the rich and rewarding learning that happens while exploring, developing, and mastering the capabilities and contributions within and outside of the Member of Marketing, Product Marketing role:</p>\\n<p></p><p><br></p><b>Technical Skills:</b><ul><li>Drive campaigns and lead nurturing efforts, so we can generate more business; ensure a data-driven approach informs our go-to-market strategies</li><li>Write content with strong copywriting skills and fluency in our brand voice</li><li>Build FAQs, run trainings, and disseminate competitor insights in a way that ensures our sales team is armed with the strongest talking pointsâ\u0080\u0094and that effective feedback loops are in place to evolve our messaging</li></ul><p><br></p><b>Complexity and Impact of Work:</b><ul><li>Shape our positioning and messaging; articulate our value propositions to increase awareness and adoption</li><li>Manage product launches as well as the introduction of new product and service features by leading client communications across channels</li></ul><p><br></p><b>Organizational Knowledge:</b><ul><li>Collaborate across Marketing, Product, Sales, and our business lines to align support for and flawless execution of go-to-market initiatives</li><li>Develop fluency in our product and platform capabilities</li></ul><p><br></p><b>Communication and Influence:</b><ul><li>Collect and analyze client and competitor insights and disseminate learnings to the wider Anchorage Digital team</li><li>Create product marketing content that will accelerate Anchorage Digitalâ\u0080\u0099s growth, including webpages, collateral, blog articles, in-app client notifications, emails, educational white papers, and advertisements.</li></ul><p><br></p><b>You may be a fit for this role if you have: </b><ul><li>Comfort writing short- and long-form content for an institutional audience</li><li>Deep knowledge of crypto</li><li>Experience leading marketing campaigns in a cross-functional environment</li><li>Are someone who constantly searches for new client and market insights to inform positioning</li><li>Are keen to become an expert in technical product features and influence how theyâ\u0080\u0099re differentiated</li><li>You read about b2b product marketing tactics during your free time</li></ul><p><br></p><b>Although not a requirement, bonus points if: </b><ul><li>You were emotionally moved by the soundtrack to Hamilton, which chronicles the founding of a new financial system. :)</li></ul><p><br></p><p></p>\\n<p><span style=\"font-size: 18px\"><b>About Anchorage Digital: Who we are</b></span></p><p><br></p><p>The Anchorage Village, what we call our team, brings together the brightest minds from platform security, financial services, and distributed ledger technology to provide the building blocks that empower institutions to safely participate in&nbsp; the evolving digital asset ecosystem. As&nbsp;a diverse team of more than 300 members, we are united in one common goal: building the future of finance by providing the foundation upon which value moves safely in the new global economy.&nbsp;</p><p><br></p><p>Anchorage Digital is committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported, and connected at workâ\u0080\u0094regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.</p><p>&nbsp;</p><p>Anchorage Digital is an Equal Opportunity Employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or veteran status. Anchorage Digital considers qualified applicants regardless of criminal histories, consistent with other legal requirements. â\u0080\u009cAnchorage Digitalâ\u0080\u009d refers to services that are offered either through Anchorage Digital Bank National Association, an OCC-chartered national trust bank, or Anchorage Lending CA, LLC a finance lender licensed by the California Department of Financial Protection and Innovation, License No. 60DBO-11976, or Anchorage Digital Singapore Pte Ltd, a Singapore private limited company, all wholly-owned subsidiaries of Anchor Labs, Inc., a Delaware corporation.</p><p><br></p><p>Protecting your privacy rights is important to Anchorage Digital, and we work to maintain the trust and confidence of our clients when handling personal or financial information. Please see our <a class=\"postings-link\" href=\"https://www.anchorage.com/privacy-policy\">privacy policy notices here.</a></p><br/><br/>Please mention the word **GUSH** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "United States",
  "salary_min": 40000,
  "salary_max": 70000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-member-of-product-marketing-protocols-anchorage-digital-1093197",
  "url": "https://remoteOK.com/remote-jobs/remote-member-of-product-marketing-protocols-anchorage-digital-1093197"
}