{
  "slug": "remote-editorial-writer-huckleberry-labs-1093236",
  "id": "1093236",
  "epoch": 1748217740,
  "date": "2025-05-26T00:02:20+00:00",
  "company": "Huckleberry Labs",
  "company_logo": "https://remoteok.com/assets/img/jobs/4dcd71b949f19baa0f7df941a0b9f84a1748217741.png",
  "position": "Editorial Writer",
  "tags": [
    "training",
    "technical",
    "writer",
    "support",
    "seo",
    "mobile",
    "management",
    "content",
    "part-time"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/4dcd71b949f19baa0f7df941a0b9f84a1748217741.png",
  "description": "<p><b>About Huckleberry</b></p><p><br></p><p>Huckleberryâ\u0080\u0099s purpose is to create life-changing products and experiences through fresh, beautiful, human-centered technology that brings health, well-being, and a bit of magic to every family.</p><p><br></p><p>We combine Data, AI, and Behavioural Science to build products that help over 4 million families.</p><p><br></p><p>The app has 4.9 stars, garnering rave reviews from people who call it â\u0080\u009clife-changingâ\u0080\u009d and their â\u0080\u009c#1 recommendation to parentsâ\u0080\u009d.</p><p><br></p><p>We are rapidly growing and building new products to enable every family to thrive.</p><p><br></p><p><br></p><p><b>About the role</b></p><p><br></p><p>We are seeking a talented part-time Editorial Writer to create engaging, informative, and high-ranking articles as well as short-form app content that helps parents navigate raising a child. We cover everything from sleep, solids, milestones, potty training and more as part of our mission to help families flourish.</p><p><br></p><p>Huckleberryâ\u0080\u0099s content is trusted around the world. Everything we create is built with and medically reviewed by our team of experts, including; pediatricians, OB-GYNs, sleep consultants, and more. Our content is clear, informative, and compassionate, with a strong dose of relatability and humor.&nbsp;</p><p><br></p><p>This is a fully remote, 10 - 20 hours-per-week (flexible hours), 12-month contract.</p>\\n<p></p><p><br></p><b>Areas of Responsibility</b><ul><li>Write well-researched and relatable articles that support parents through child development and raising a healthy family</li><li>Write short-form content related to child development and parenting topics for an exclusively mobile audience&nbsp;</li><li>Conduct interviews with pediatric experts to ensure accuracy and relevance</li><li>Implement SEO best practices in new and existing articles to meet search standards</li><li>Balance technical with personable and match our brand's tone, style, and editorial guidelines</li><li>Collaborate with Brand Editorial team and SEO vendors on optimization projects that align with our broader content strategy&nbsp;</li><li>Write copy for engaging assets (i.e., charts, bullet points, infographics, etc.) to support written articles</li></ul><p><br></p><b>Requirements</b><ul><li>Over 5 years of experience as an editorial writer, preferably specializing in parenting, family, or child development.</li><li>Excellent writing, editing, and proofreading skills</li><li>Proven track record of writing both long and short-form content</li><li>Comprehensive understanding of SEO best practices&nbsp;</li><li>Strong sense of editorial voice&nbsp;</li><li>Content Management Systems (CMS) experience</li></ul><p><br></p><p></p>\\n<div>$35 - $50 an hour</div>\\n<p>Huckleberry Labs is an equal-opportunity employer that is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, state, or local laws.</p><p><br></p><p>Huckleberry Labs makes hiring decisions based solely on qualifications, merit, and business needs at the time.</p><p><br></p><br/><br/>Please mention the word **LOVE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Los Angeles, CA",
  "salary_min": 30000,
  "salary_max": 70000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-editorial-writer-huckleberry-labs-1093236",
  "url": "https://remoteOK.com/remote-jobs/remote-editorial-writer-huckleberry-labs-1093236"
}