{
  "slug": "remote-senior-devops-engineer-easypost-1093294",
  "id": "1093294",
  "epoch": 1748887203,
  "date": "2025-06-02T18:00:03+00:00",
  "company": "EasyPost",
  "company_logo": "",
  "position": "Senior DevOps Engineer",
  "tags": [
    "design",
    "security",
    "architect",
    "technical",
    "support",
    "growth",
    "devops",
    "education",
    "serverless",
    "cloud",
    "api",
    "administrator",
    "management",
    "lead",
    "senior",
    "junior",
    "operations",
    "engineer",
    "engineering",
    "linux",
    "digital nomad"
  ],
  "description": "<p><span style=\"font-size: 11pt\">Founded in 2012, EasyPost is a YC unicorn whose mission is to make shipping simple for businesses, from garage startups to the Fortune 500. Shipping, now more than ever, is the backbone of the global economy, but integrating the technology-enabled operations of a modern business with the low-tech and complex shipping industry has always been a challenge. EasyPost solves this problem with the first developer-friendly REST API for shipping, and we continue to push boundaries and discover new ways to simplify shipping for all. Our team is rapidly growing, and this is the perfect time to get on board. Join us, and help build the shipping infrastructure of the future.</span></p><p><br></p><p><b style=\"font-size: 13pt;\">Position Summary:&nbsp;</b></p><p><br></p><p><span style=\"font-size: 12pt;\">Easypost is seeking a highly experienced and skilled Senior Engineer to work with our DevOps team. This role will be involved in designing, building, and optimizing our cloud infrastructure, ensuring scalability, reliability, and high availability in a multi-Cloud environment. The ideal candidate will have deep expertise in cloud platforms and a strong background in DevOps and automation. A heavy emphasis will be placed on establishing appropriate governance and guardrails for our Engineering team to rely on as the company shifts more of its platform to the Cloud.</span></p><p><br></p><p><b style=\"font-size: 13pt;\">Essential Duties and Responsibilities:</b></p><p><br></p><p><span style=\"font-size: 12pt;\">The essential functions include, but are not limited to the following:</span></p><p><br></p><p><span style=\"font-size: 12pt;\">o Design and manage cloud infrastructure using Infrastructure-as-Code (IaC) tools such as Terraform, ARM templates, or AWS CloudFormation. </span></p><p><span style=\"font-size: 12pt;\">o Drive efforts to optimize cloud environments for performance, cost-efficiency, and security. </span></p><p><span style=\"font-size: 12pt;\">o Collaborate with development, security, and infrastructure teams to ensure resilient, secure, and scalable platform services. </span></p><p><span style=\"font-size: 12pt;\">o Develop and maintain automation scripts and tools to streamline cloud infrastructure provisioning, configuration, and monitoring (Infrastructure-as-Code).</span></p><p><span style=\"font-size: 12pt;\">o Support the adoption of cloud-native technologies, including containerization, serverless architectures, and microservices. </span></p><p><span style=\"font-size: 12pt;\">o Implement and evangelize cloud security best practices, ensuring compliance with industry standards and regulatory requirements. </span></p><p><span style=\"font-size: 12pt;\">o Monitor cloud infrastructure and respond to incidents, ensuring minimal downtime and quick recovery. </span></p><p><span style=\"font-size: 12pt;\">o Lead capacity planning, performance tuning, and disaster recovery strategies for cloud systems. </span></p><p><span style=\"font-size: 12pt;\">o Mentor junior engineers, providing guidance and technical expertise to support their growth and development.</span></p><p><span style=\"font-size: 12pt;\">o Stay up-to-date with emerging cloud technologies and trends, identifying opportunities for continuous improvement.</span></p><p><br></p><p><b style=\"font-size: 13pt;\">Minimum Education &amp; Experience Qualifications:</b></p><p><br></p><p><span style=\"font-size: 12pt;\">o Bachelorâ\u0080\u0099s Degree in Computer Science, Engineering, or a related field</span></p><p><span style=\"font-size: 12pt;\">o 7+ years of related experience. </span></p><p><span style=\"font-size: 12pt;\">o AWS &amp; Azure expertise in an infrastructure or DevOps capacity. GCP is a plus. </span></p><p><span style=\"font-size: 12pt;\">o Experience managing and automating Linux and Windows Server environments (2016 and newer).</span></p><p><span style=\"font-size: 12pt;\">o Strong proficiency in cloud automation tools (e.g., Terraform, CloudFormation, ARM Templates) and infrastructure-as-code (IaC) principles. </span></p><p><span style=\"font-size: 12pt;\">o Strong skills in configuration management tools (Ansible, Puppet) and scripting in PowerShell, Python. </span></p><p><span style=\"font-size: 12pt;\">o Hands-on experience with containerization and orchestration tools (e.g. Docker, Kubernetes).</span></p><p><span style=\"font-size: 12pt;\">o Familiarity with DevOps practices, including CI/CD pipelines, automated testing, and monitoring. </span></p><p><span style=\"font-size: 12pt;\">o Solid understanding of networking, security, and cloud governance principles. </span></p><p><span style=\"font-size: 12pt;\">o Experience with modern monitoring/logging frameworks (e.g., ELK, Prometheus, OpenTelemetry, Fluentd, Datadog, CloudWatch, Azure Monitor).</span></p><p><span style=\"font-size: 12pt;\">o Excellent problem-solving skills, with the ability to analyze complex technical challenges, identify solutions, and implement them effectively. </span></p><p><span style=\"font-size: 12pt;\">o Strong communication and interpersonal skills, with the ability to collaborate effectively with cross-functional teams and convey complex technical concepts to non-technical stakeholders. </span></p><p><span style=\"font-size: 12pt;\">o Relevant certifications (e.g., AWS Certified Solutions Architect, Azure Administrator Associate, Google Professional Cloud Architect are a plus.</span></p>\\n<p></p><p><br></p><p></p>\\n<div>$153,000 - $195,000 a year</div><small><div><span style=\"font-size: 15px;\">The posted salary range represents the base compensation for this role. Actual compensation may vary based on factors including, but not limited to, experience, education, skills, geographic location, and internal equity.</span></div><div><br></div></small>\\n<p><b>What We Offer:</b></p><p><br></p><p>o Comprehensive medical, dental, vision, and life insurance</p><p>o Competitive compensation package and equity</p><p>o Monthly work from home stipend of $50</p><p>o Flexible work schedule and paid time off</p><p>o Collaborative culture with a supportive team</p><p>o A great place to work with unlimited growth opportunities</p><p>o The opportunity to make massive contributions at a hyper-growth company</p><p>o Make an impact on a product helping ship millions of packages per day</p><p><br></p><p>Data Privacy Notice for Job Applicants:</p><p>For information on personal data processing, please see our Privacy Policy: <a class=\"postings-link\" href=\"https://www.easypost.com/privacy\">https://www.easypost.com/privacy</a></p><p><br></p><p><i><b>\"EasyPost is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\"</b></i></p><p><br></p><p><span style=\"font-size: 15px\">To be considered for this position, you must be authorized and based in the United States.</span></p><br/><br/>Please mention the word **EYECATCH** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Remote",
  "salary_min": 67500,
  "salary_max": 95000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-senior-devops-engineer-easypost-1093294",
  "logo": "",
  "url": "https://remoteOK.com/remote-jobs/remote-senior-devops-engineer-easypost-1093294"
}