{
  "slug": "remote-senior-backend-engineer-raya-1093271",
  "id": "1093271",
  "epoch": 1748534409,
  "date": "2025-05-29T16:00:09+00:00",
  "company": "Raya",
  "company_logo": "https://remoteok.com/assets/img/jobs/789547d334308dc72012473ca698b8c71748534409.png",
  "position": "Senior Backend Engineer",
  "tags": [
    "design",
    "system",
    "training",
    "technical",
    "support",
    "software",
    "ux",
    "elasticsearch",
    "node.js",
    "lead",
    "senior",
    "go",
    "engineer",
    "engineering",
    "educational",
    "backend",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/789547d334308dc72012473ca698b8c71748534409.png",
  "description": "<p>Senior Backend Engineers at Raya love backend engineering and have been recognized as leaders in past roles! You are excited to work in a Node.js codebase. The ideal candidate will have had 6+ years of experience and grown within their organization, demonstrating both results and leadership. You will join the backend team at an impactful time of high growth.</p><p><br></p><p>We prioritize learning and teamwork and love giving people the opportunity to champion solutions to big challenges and grow into better versions of themselves. A great candidate is excited to support the backend team's initiatives in messaging, connecting, and location based map initiatives. They are diligent and they design software architecture in a scalable manner. Finally, they believe in Rayaâ\u0080\u0099s vision, which is to enrich lives by fostering relationships through quality, in person interactions.</p><p><br></p><p>We offer comprehensive medical and dental coverage, $50 a day food delivery budget, equity based employment, a great culture, learning opportunities, unlimited vacation, 12 weeks paid parental leave, and we pay all employees $1,000 a year to go somewhere in the world that theyâ\u0080\u0099ve never been because of our values of human connection, empathy, and curiosity. </p>\\n<p></p><p><br></p><b>Responsibilities </b><ul><li>Product Ownership: Lead key components of our Core Services, including People Recommendations Engines</li><li>Data Engineering: Apply your in-depth knowledge with databases such as Postgres SQL, MongoDB, and ElasticSearch to supercharge our application's performance and reliability</li><li>Collaboration: Work hand-in-hand with cross-functional teams, ranging from UX designers to data scientists, ensuring our solutions are comprehensive and user focused</li><li>Continuous Learning: Stay updated with the latest in Raya's tech ecosystem, ensuring our solutions are scalable, maintainable, and innovative</li><li>User-Centric Development: Prioritize and advocate for top-tier user experiences, utilizing feedback loops and data-driven methodologies to define and refine product features</li><li>Operational Excellence: Navigate the full Software Development Life Cycle (SDLC), ensuring agile methodologies, CI/CD practices, and Raya's best practices are integrated into all development phases</li></ul><p><br></p><b>Qualifications</b><ul><li>A BS/MS in Computer Science, Engineering, Mathematics, Software Engineering or a related technical field (Professional Experience can be substituted for candidates with non-engineering educational backgrounds or experience with software-specific training courses/programs)</li><li>6+ years of hands-on experience in modern software development environments, with a track record of delivering scalable and maintainable systems</li><li>Demonstrated expertise in system design, architecture, and mastery in at least one software programming language, ex. Node.js, Javascript, Golang, or Typescipt</li><li>Strong collaborative instincts, emphasizing open communication, transparency, and cross-team interaction</li><li>Production experience with Search applications (ex. OpenSearch, Vector database, Elasticsearch)</li></ul><p><br></p><b>What Sets You Apart</b><ul><li>Visionary: You think beyond the present, anticipating future technological trends and their implications on the Raya Community.</li><li>Empathetic Leader: You naturally resonate with colleagues, users, and collaborative teams, fostering a culture of understanding and innovation</li><li>Growth-oriented: You possess a perpetual learner's mindset, open to challenges, and always seeking opportunities to expand your technical horizons</li><li>Impact-driven: With a knack for identifying the 'big picture', you prioritize tasks that maximize impact, aligning with Rayaâ\u0080\u0099s overarching goals</li></ul><p><br></p><p></p>\\n<p><span style=\"font-size: small\">#BI-remote</span></p><br/><br/>Please mention the word **UNITY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Remote",
  "salary_min": 70000,
  "salary_max": 130000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-senior-backend-engineer-raya-1093271",
  "url": "https://remoteOK.com/remote-jobs/remote-senior-backend-engineer-raya-1093271"
}