{
  "slug": "remote-visual-designer-pip-labs-1093190",
  "id": "1093190",
  "epoch": 1747432803,
  "date": "2025-05-16T22:00:03+00:00",
  "company": "PIP Labs",
  "company_logo": "",
  "position": "Visual Designer",
  "tags": [
    "design",
    "web3",
    "designer",
    "management",
    "content",
    "senior",
    "marketing",
    "digital nomad"
  ],
  "description": "<p><span style=\"font-size: 16px;\">PIP Labs is looking for a sharp, resourceful Visual Designer to join our Brand Design team. This is a high-impact role for someone who thrives in fast-moving environments, brings strong communication skills, and has experience working inside fast-paced tech startups. Youâ\u0080\u0099ll work closely with our Head of Design, Art Director, and marketing teams to help bring Story â\u0080\u0094 our L1 blockchain for programmable IPâ\u0080\u0094to life across brand surfaces.</span></p><p><br></p><p><span style=\"font-size: 16px;\">Weâ\u0080\u0099re not looking for someone straight out of school or from a traditional in-house role. Weâ\u0080\u0099re looking for someone whoâ\u0080\u0099s been battle-tested in a startup environment: fast on execution, articulate in feedback loops, and comfortable owning entire projects from start to finish.</span></p><p><br></p><p><span style=\"font-size: 16px;\">This is a great opportunity for a designer whoâ\u0080\u0099s looking to level up, own creative across brand, product, and marketing, and grow into a more senior role over time.</span></p><p><br></p>\\n<p></p><p><br></p><b>What Youâ\u0080\u0099ll Do:</b><ul><li>Design high-quality visuals across brand surfacesâ\u0080\u0094web, social, marketing campaigns, events, content drops, and more</li><li>Collaborate on major product and brand launches with our marketing, content, and community teams</li><li>Work on event design for high-profile industry activations (e.g., ETHDenver, Korea Blockchain Week)</li><li>Contribute to merchandise, physical collateral, and experiential design</li><li>Maintain visual consistency while adapting assets for different formats and audiences</li><li>Help evolve our internal file management and design ops process</li></ul><p><br></p><b>What Weâ\u0080\u0099re Looking For:</b><ul><li>Experience in brand or visual design, ideally in a high-growth tech startup or fast-paced agency</li><li>A polished, diverse portfolio that shows skill across campaign work, branding, and marketing design</li><li>Strong eye for hierarchy, layout, typography, and clean visual systems</li><li>Comfortable working across multiple formats and channelsâ\u0080\u0094from digital to physical</li><li>Highly communicative and organizedâ\u0080\u0094youâ\u0080\u0099re able to run with projects, manage feedback cycles, and hit deadlines without much oversight</li><li>Hungry to growâ\u0080\u0094interested in expanding your creative ownership and leveling up into a more senior role</li><li>Interest in crypto/web3 and/or new internet-native creative economies</li></ul><p><br></p><b>Nice to Have:</b><ul><li>Experience working on web3 or crypto-native brands</li><li>Past work in agency environments with recognizable brands</li><li>Experience designing for communities, events, or ecosystem growth</li></ul><p><br></p><p></p>\\n<br/><br/>Please mention the word **PAINLESS** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "US",
  "salary_min": 80000,
  "salary_max": 150000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-visual-designer-pip-labs-1093190",
  "logo": "",
  "url": "https://remoteOK.com/remote-jobs/remote-visual-designer-pip-labs-1093190"
}