{
  "slug": "remote-certified-medical-assistant-everly-health-1093241",
  "id": "1093241",
  "epoch": 1748217791,
  "date": "2025-05-26T00:03:11+00:00",
  "company": "Everly Health",
  "company_logo": "https://remoteok.com/assets/img/jobs/ec34c8251e53686eab370a4410dbb6951748217792.png",
  "position": "Certified Medical Assistant",
  "tags": [
    "assistant",
    "technical",
    "support",
    "video",
    "education",
    "medical",
    "health"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/ec34c8251e53686eab370a4410dbb6951748217792.png",
  "description": "<p><span style=\"font-size: 11pt;\">We are seeking </span><b style=\"font-size: 11pt;\">Remote Certified Medical Assistants</b><span style=\"font-size: 11pt;\"> to join our team and support virtual patient care programs. In this role, you will assist patients throughout the telehealth process, including helping them complete electronic portal check-ins, connect to video visits, obtain vital sign measurements from home, provide an accurate medical history, participate in medication reconciliation, and complete screening questionnaires. You will ensure accurate intake documentation, provide proactive technology support, and escalate clinical concerns to Registered Nurses (RNs) as needed. This is a </span><b style=\"font-size: 11pt;\">fully remote contract position</b><span style=\"font-size: 11pt;\"> with an opportunity to make a meaningful impact in healthcare.</span></p><p><br></p><p><i><span style=\"font-size: 15px;\">There are flexible scheduling options, which include day, evening, and PRN shifts. Operating hours are from 8AM â\u0080\u0093 8PM EST, 7 days a week. This role is part-time, making it ideal for someone looking to optimize their schedule while enhancing patient access to care.</span></i></p>\\n<p></p><p><br></p><b>What Youâ\u0080\u0099ll Do:</b><ul><li>Assist patients with <b>connecting to telehealth video visits</b> and troubleshooting technical issues.</li><li>Guide patients through the <b>virtual intake process</b>, ensuring a seamless experience.</li><li>Collect and document vital signs, medical history, and medication reconciliation.</li><li>Administer and complete <b>screening questionnaires</b> as part of patient intake.</li><li>Handle <b>inbound calls</b>, assess patient needs, and provide appropriate guidance.</li><li>Offer <b>live phone support</b> to answer questions and address concerns before appointments.</li><li>Proactively <b>manage patient care workflows</b> from initial outreach to case resolution.</li><li>Escalate abnormal or elevated <b>vital signs, medical history concerns, or other clinical concerns</b> to RNs.</li><li>Accurately <b>document all patient interactions</b> using electronic health records (EHR) including but not limited to AthenaOne and Healthie; document all calls through platforms including Salesforce; utilize phone call scripts and EHR macros.</li><li>Index patient cases based on <b>screening results and vital signs</b> for follow-up and prioritization.</li></ul><p><br></p><b>Required Qualification:</b><ul><li>Minimum <b>3- 5 years of experience</b> as a Certified Medical Assistant (<b>remote CMA experience preferred</b>).</li><li><b>Medical Assistant Certification</b> through AAMA, AMT, NHA, or NCCT.</li><li>High school diploma or equivalent (<b>higher education is a plus</b>).</li><li>Experience handling <b>high call volumes</b> in a fast-paced environment.</li><li>Familiarity with <b>EHR systems</b> for documentation. AthenaOne experience preferred.&nbsp;</li><li>Tech-savvy with the ability to quickly adapt to new platforms, including <b>Slack and Google Suite</b></li><li>Strong <b>oral, written, and interpersonal communication skills</b>.</li><li>Proven ability to work successfully with <b>diverse patient populations</b>.</li><li>Ability to <b>work independently</b> and effectively <b>prioritize tasks</b>.</li></ul><p><br></p><b>Preferred Qualifications: </b><ul><li>Experience working with <b>AthenaOne EHR</b>, <b>Salesforce and Slack</b> (or similar platforms).</li><li><b>2- 4 years of telehealth or phone-based patient care experience</b><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://experience.Being\">.</a></li><li><b>Being bilingual in Spanish</b> is a plus.</li></ul><p><br></p><b>Why Join Us?</b><ul><li>By joining our team, youâ\u0080\u0099ll play a vital role in <b>expanding access to virtual healthcare</b>, ensuring that patients receive <b>comprehensive, high-quality care</b> from the moment they begin their telehealth visit.</li><li>If youâ\u0080\u0099re passionate about patient care and thrive in a <b>remote, tech-driven environment</b>, weâ\u0080\u0099d love to hear from you!</li></ul><p><br></p><p></p>\\n<br/><br/>Please mention the word **INGENUITY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Nationwide",
  "salary_min": 70000,
  "salary_max": 80000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-certified-medical-assistant-everly-health-1093241",
  "url": "https://remoteOK.com/remote-jobs/remote-certified-medical-assistant-everly-health-1093241"
}