{
  "slug": "remote-software-engineer-backend-fullstack-sei-labs-1093215",
  "id": "1093215",
  "epoch": 1747915203,
  "date": "2025-05-22T12:00:03+00:00",
  "company": "Sei Labs",
  "company_logo": "https://remoteok.com/assets/img/jobs/22c433446b73a9803f300985eb7248fd1747915205.png",
  "position": "Software Engineer Backend Fullstack",
  "tags": [
    "software",
    "web3",
    "full-stack",
    "cloud",
    "management",
    "engineer",
    "engineering",
    "backend",
    "fullstack"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/22c433446b73a9803f300985eb7248fd1747915205.png",
  "description": "<p><span style=\"font-size: 18pt;\">About Sei</span></p><p><span style=\"font-size: 16px;\">Sei Labs builds open sourced technology for the high-performance Sei Blockchain, the first parallelized EVM Layer 1 blockchain designed to scale with the industry. The unique optimizations built into Sei enable Web3 applications to reach Web2 level scale and performance, driving the mass adoption of digital assets.</span></p><p><br></p><p><span style=\"font-size: 16px;\">Our teams are comprised of former Google, Goldman Sachs, Robinhood, Nvidia, and Databricks veterans dedicated to onboarding the next billion users onto a vibrant ecosystem of applications.</span></p><p><br></p><p><span style=\"font-size: 16px;\">Sei Labs has raised over $30M from top investors including Jump Crypto, Multicoin Capital, Coinbase Ventures, Distributed Global, Hudson River Trading, and Flow Traders.</span></p><p><br></p><p><span style=\"font-size: 16px;\">We're a globally distributed team with a fully remote workforce.&nbsp;Check out our </span><a style=\"font-size: 16px;\" href=\"https://www.sei.io/\">website</a><span style=\"font-size: 16px;\"> and </span><a style=\"font-size: 16px;\" href=\"https://www.docs.sei.io/dev-intro\">docs</a><span style=\"font-size: 16px;\"> for more details.</span></p><p><br></p><p><b style=\"font-size: 24px\">Fullstack Engineering at Sei</b></p><p><span style=\"font-size: 16px;\">Sei Labs is looking for a Fullstack Engineer to help shape the future of Web3 by empowering innovative, high-impact applications across the Sei Blockchain. You'll work with a team at the forefront of blockchain technology, collaborating closely with our ecosystem partners to develop cutting-edge dApps spanning diverse Web3 domains (from DEXâ\u0080\u0099s and games, to DePin, AI and beyond). If you're passionate about constant learning, rapid development, and making a tangible impact in a fast-paced, community-first environment, this is a unique opportunity to push the boundaries of what's possible in decentralized technology.</span></p>\\n<p></p><p><br></p><b>Requirements</b><ul><li>3+ years of experience with full-stack development, with a focus on frontend</li><li>Proficiency with one of JavaScript, TypeScript, <a class=\"postings-link\" href=\"http://node.js/\">Node.js</a></li><li>Web3 experience &amp; smart contract experience is a nice to have</li><li>Experience with database management using SQL, NoSQL, or similar technologies</li><li>Experience with cloud technologies such as AWS, Terraform</li></ul><p><br></p><b>Responsibilities</b><ul><li>Code/Manage Sei web2 backends (indexers, backend APIs, etc).</li></ul><ul><li>Code/Manage Sei frontends (website, governance platform, foundation website page, etc).</li></ul><div><br></div><div>#LI-CG1</div><p><br></p><p></p>\\n<br/><br/>Please mention the word **EXTRAORDINARY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 60000,
  "salary_max": 85000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-software-engineer-backend-fullstack-sei-labs-1093215",
  "url": "https://remoteOK.com/remote-jobs/remote-software-engineer-backend-fullstack-sei-labs-1093215"
}