{
  "slug": "remote-graphic-designer-fully-position-meeting-tomorrow-1093232",
  "id": "1093232",
  "epoch": 1748217693,
  "date": "2025-05-26T00:01:33+00:00",
  "company": "Meeting Tomorrow",
  "company_logo": "https://remoteok.com/assets/img/jobs/69eac709ecdd589e10fee0b6aec0bfb41748217694.png",
  "position": "Graphic Designer Fully Position",
  "tags": [
    "design",
    "designer",
    "technical",
    "support",
    "voice",
    "management",
    "marketing",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/69eac709ecdd589e10fee0b6aec0bfb41748217694.png",
  "description": "<p><span style=\"font-size: 16px;\">Meeting Tomorrow is a full-service events agency dedicated to creating unparalleled experiences for both our clients and our team. Weâ\u0080\u0099re a growing team of 95 employees, leading the way in building a supportive remote work environment where culture, collaboration, and well-being come first. Our clients range from Fortune 500 companies to small businesses and everything in between, and we plan and produce events across the country and globally with precision and care. With 20 years of experience and a people-first mission, our team brings creativity, expertise, and kindness to every interaction. If youâ\u0080\u0099re looking for a role where you can contribute to meaningful projects, enjoy the flexibility of 100% remote work, and grow alongside a team that truly values you, weâ\u0080\u0099d love to hear from you!</span></p>\\n<p></p><p><br></p><p></p>\\n<div>$64,040 - $80,000 a year</div><small><div>The above is the starting salary for this position. Where someone starts within the range is based on applicable experience to the role and is gleaned through the interview process.</div><div><br></div><div><u><b style=\"font-size: 18px;\">The Opportunity</b></u><u style=\"font-size: 18px;\">&nbsp;</u></div><div><span style=\"font-size: 16px;\">This 100% remote Graphic Designer position is a rare opportunity to strategically shape the entire visual identity of our clientsâ\u0080\u0099 events. Youâ\u0080\u0099ll apply your multi-disciplinary experience to a wide range of companies and event types, translating our clientsâ\u0080\u0099 brand guidelines into creative and compelling visuals across all physical and digital areas of their events. Your expertise in typography, color, and layout will breathe life into scenic, print, digital, and motion designs, ensuring every element resonates with their brand and audience.</span></div><div><br></div><div><span style=\"font-size: 16px;\"> Youâ\u0080\u0099ll work alongside 3 other dynamic creatives in our Creative Services department as well as a cadre of graphic design freelancers. Youâ\u0080\u0099ll also collaborate with our sales, technical production, vendor network, and project management teams. Most of your day will be spent researching, brainstorming, and designing. Youâ\u0080\u0099ll regularly be working on conceptual designs, 2D files, producing assets, and preparing artwork for production.</span></div><div><br></div><div><span style=\"font-size: 16px;\"> We are looking for someone who is passionate about design, and loves the idea of elevating our clientsâ\u0080\u0099 brands through powerful concepts and visuals&nbsp; â\u0080\u0094 who aims to make our clients say â\u0080\u009cWowâ\u0080\u009d every time through their creativity and vision.</span></div><div><br></div><div><u><b style=\"font-size: 18px;\">Main Responsibilities Include </b></u></div><div><span style=\"font-size: 16px;\">â\u0080¢ </span><b style=\"font-size: 16px;\">Elevate Event Branding:</b><span style=\"font-size: 16px;\"> Develop compelling logos, themes, and visual elements that align with client objectives and brand identity, driving impactful event experiences. </span></div><div><span style=\"font-size: 16px;\">â\u0080¢</span><b style=\"font-size: 16px;\">&nbsp;Create Engaging Content:</b><span style=\"font-size: 16px;\"> Design a wide range of 2D and motion graphics, including presentation templates, signage, digital assets, and print collateral, ensuring consistent brand application.</span></div><div><span style=\"font-size: 16px;\">â\u0080¢</span><b style=\"font-size: 16px;\">&nbsp;Ensure Brand Consistency:</b><span style=\"font-size: 16px;\"> Interpret and apply brand guidelines across all deliverables, maintaining a cohesive visual identity for clients and internal projects.</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ </span><b style=\"font-size: 16px;\">Collaborate and Support: </b><span style=\"font-size: 16px;\">Partner with clients' marketing teams, sales, and internal departments to deliver exceptional design solutions and provide essential creative support. </span></div><div><span style=\"font-size: 16px;\">â\u0080¢ </span><b style=\"font-size: 16px;\">Stay Ahead of Design Trends:</b><span style=\"font-size: 16px;\"> Conduct ongoing research to incorporate modern and innovative design practices into all projects. </span></div><div><br></div><div><u><b style=\"font-size: 18px;\">Who You Are</b></u></div><div><span style=\"font-size: 16px;\">The right person for this role is creative with strong communication skills, attention to detail, a problem-solving mindset, and the ability to effectively collaborate with internal teams and clients to execute high-quality designs. </span></div><div><br></div><div><span style=\"font-size: 16px;\">Additionally, weâ\u0080\u0099re looking for -</span></div><div><br></div><div><span style=\"font-size: 16px;\">â\u0080¢ </span><b style=\"font-size: 16px;\">Values: </b><span style=\"font-size: 16px;\">You exhibit our company core values of Kindness, Commitment, and Humility.</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ </span><b style=\"font-size: 16px;\">5+ years of experience:</b><span style=\"font-size: 16px;\"> We work with a wide range of clients and requests, so itâ\u0080\u0099s a must that you have previous experience working with multiple brands and creating print, digital, motion graphics, small-format designs, and large-format design.</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ </span><b style=\"font-size: 16px;\">Software knowledge:</b><span style=\"font-size: 16px;\"> This is a multi-disciplinary role, so you need to be proficient with Adobe Creative Suite (Illustrator, Photoshop, InDesign), Motion Graphics, PowerPoint, Keynote, and Google Suite regularly. Bonus points if you have experience with After Effects.</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ </span><b style=\"font-size: 16px;\">Strong typography &amp; layout skills:</b><span style=\"font-size: 16px;\"> In addition to the above, you need to have the ability to create clear, compelling designs that communicate brand messaging effectively.</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ </span><b style=\"font-size: 16px;\">Organized: </b><span style=\"font-size: 16px;\">Working on multiple projects at once requires a high level of organization and detail orientation. We work in Hive, a project management tool for collaboration and deliverable management.</span></div><div><span style=\"font-size: 16px;\">â\u0080¢</span><b style=\"font-size: 16px;\">&nbsp;Formal design education: </b><span style=\"font-size: 16px;\">Because this role requires the ability to flex to each clientâ\u0080\u0099s brand voice and users, weâ\u0080\u0099re looking for someone with a formal degree in design (bachelorâ\u0080\u0099s or associate's).</span></div><div><br></div><div><u><b style=\"font-size: 18px;\">The Impact</b></u></div><div><br></div><div><span style=\"font-size: 16px;\">Within 1 month, youâ\u0080\u0099ll have -&nbsp;</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ Met all key stakeholders and team members that you will be working with</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ An understanding of our service offerings</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ Reviewed all of our relevant processes to understand how things are currently working&nbsp;</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ A deep knowledge of the Meeting Tomorrow brand</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ A full understanding of the Event Production industry and top trends&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px;\">In 3 months, youâ\u0080\u0099ll have -</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ Started building out new templates and processes for the creative process and deliverables&nbsp;</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ Familiarity with the brand guidelines of our top clients</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ Begun providing design services to support events in collaboration with the creative team&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px;\">In 6 months, youâ\u0080\u0099ll have -</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ Full anatomy in your role </span></div><div><span style=\"font-size: 16px;\">â\u0080¢ Been a part of brainstorming, designing, and pitching 5 winning event designs</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ Expanded our vendor network to have new options for clients in all mid-tier and major markets</span></div><div><span style=\"font-size: 16px;\">â\u0080¢&nbsp;Helped improve materials for building out new products and creative service offerings&nbsp;</span></div><div><br></div><div><u><b style=\"font-size: 16px;\">Benefits</b></u></div><div><span style=\"font-size: 16px;\">â\u0080¢ Medical, dental, and vision plan options&nbsp;</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ Employer paid STD, LTD, Life Insurance, and EAP access</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ 401k with employer matching up to 4%</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ 16 PTO days (increases with tenure) + 9 paid holidays</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ Annual profit-sharing bonus</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ 12 weeks 100% paid parental leave (maternity, paternity, adoption)</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ $50 Monthly fitness reimbursement&nbsp;</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ Monthly stipends for internet and/or cell</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ Company donation(s) to your charities of choice (up to $1,000 annually)</span></div><div><span style=\"font-size: 16px;\">â\u0080¢ Regular social events and learning opportunities</span></div></small>\\n<p><span style=\"font-size: 16px;\">At Meeting Tomorrow, our mission is to foster a culture of respect and affection. We embrace our differences and are committed to having a diverse, equitable, and inclusive environment. Weâ\u0080\u0099re an Equal Opportunity Employer that believes in second chances and strongly encourage BIPOC, women, LGBTQIA, veterans, persons with disabilities, formerly incarcerated and all other individuals to apply.</span></p><p><br></p><p><span style=\"font-size: 16px;\">What makes Meeting Tomorrowâ\u0080\u0099s culture so special is the people, and we look for candidates who are a match for our companyâ\u0080\u0099s core values:&nbsp;commitment, kindness and humility.&nbsp;If those words describe you and you see yourself in this posting, youâ\u0080\u0099re ready to apply!</span></p><br/><br/>Please mention the word **FERVIDLY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Remote - United States only",
  "salary_min": 120000,
  "salary_max": 150000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-graphic-designer-fully-position-meeting-tomorrow-1093232",
  "url": "https://remoteOK.com/remote-jobs/remote-graphic-designer-fully-position-meeting-tomorrow-1093232"
}