{
  "slug": "remote-associate-attorney-enablecomp-1093185",
  "id": "1093185",
  "epoch": 1747353606,
  "date": "2025-05-16T00:00:06+00:00",
  "company": "EnableComp",
  "company_logo": "https://remoteok.com/assets/img/jobs/b14805dfc8d53ecc7b9ba49bbd512c311747353609.png",
  "position": "Associate Attorney",
  "tags": [
    "training",
    "support",
    "growth",
    "financial",
    "strategy",
    "management",
    "senior",
    "legal",
    "health",
    "healthcare"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/b14805dfc8d53ecc7b9ba49bbd512c311747353609.png",
  "description": "<p><span style=\"font-size: 12pt\">EnableComp provides Specialty Revenue Cycle Management solutions for healthcare organizations, leveraging over 24 years of industry-leading expertise and its unified </span><i><span style=\"font-size: 12pt\">E360 RCM</span></i><span style=\"font-size: 12pt\">â\u0084¢ intelligent automation platform to improve financial sustainability for hospitals, health systems, and ambulatory surgery centers (ASCs) nationwide. Powered by proprietary algorithms, iterative&nbsp;intelligence from 10M+ processed claims, and expert human-in-the-loop integration, EnableComp provides solutions across the revenue lifecycle for Veterans Administration, Workersâ\u0080\u0099 Compensation, Motor Vehicle Accidents, and Out-of-State Medicaid claims as well as denials for all payer classes. By partnering with clients to supercharge the reimbursement process, EnableComp removes the burden of payment from patients and provider organizations while enabling accelerated cash, higher and more accurate yield, clean AR management, reduced denials, and data-rich performance management. EnableComp is a multi-year recipient the Top Workplaces award and was recognized as Black Book's #1 Specialty Revenue Cycle Management Solution provider in 2024 and is among the top one percent of companies to make the Inc. 5000 list of the fastest-growing private companies in the United States for the last eleven years.&nbsp;</span></p><p><br></p><p><b><u>Position Summary:</u></b></p><p>The Associate Attorney, MVA will assist in the reductions and settlement negotiations regarding resolution of outstanding motor vehicle accidents and third-party liability accounts. They will work under the supervision of senior attorneys to support case management and provide resolution of claims. The Associate Attorney, MVA will work diligently to advocate for the highest possible reimbursement.</p>\\n<p></p><p><br></p><b>Key Responsibilities:</b><ul><li>Responsible for reduction requests, settlement negotiations, and fulfillment of payment for assigned caseload of motor vehicle accident and third-party liability claims, as determined by the Senior Attorney.</li><li>Conduct legal research, gather evidence, and support case strategy development.</li></ul><ul><li>Conduct timely and thorough telephone follow-up with Attorney offices to ensure timely resolution.</li><li>Prepare liability questionnaires, review liens, and resolve any outstanding documentation requests.&nbsp;</li><li>Communicate effectively with internal &amp; external clients to understand their needs and objectives.</li><li>Resolves shared tasks and goals under the supervision of senor attorney.</li><li>Work closely with team of associate attorneys and support staff to provide efficient case management.</li><li>Participate in team meetings and case reviews.</li><li>May mentor staff as needed including new hires, especially in regards to ongoing training needs.</li><li>Assist with Quality Control tasks on behalf of management regarding account flow and due diligence.</li><li>Other duties as required.</li></ul><p><br></p><b>Requirements and Qualifications:</b><ul><li>Juris Doctor (JD) from an accredited law school.</li><li>Active license to practice law in Georgia.</li><li>At least 6 months experience dealing with Motor Vehicle Accident claims and / or reductions.</li><li>1 year in healthcare field in billing or collections preferred.</li><li>Basic level of understanding of Revenue Cycle terminology, practices, and liens.</li><li>Strong problem-solving and decision-making abilities.</li><li>Strong analytical, negotiation, and communication skills.</li><li>Must have strong computer proficiency and understand how to use basic office applications, including MS Office (Word, Excel, and Outlook).</li><li>Regular and predictable attendance.</li><li>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions.</li></ul><p><br></p><b>Special Considerations and Prerequisites:</b><ul><li>Practices and adheres to EnableComp's Core Values, Vision and Mission.</li><li>Capacity to regulate and perform under stress.</li><li>Detail-oriented with strong organizational and time-management skills</li><li>Must be a self-starter and able to work independently as well as work well with others.</li><li>Proven written and verbal communication skills.</li><li>Appropriately handle stress and interact cooperatively with others (at all levels of the organization).</li><li>Strong customer service skills and business acumen.</li><li>Ability to prioritize and manage multiple competing priorities and projects concurrently.</li><li>General office environment; must be able to sit for long periods of time.</li></ul><p><br></p><p></p>\\n<p><i style=\"font-size: 16px\">EnableComp is an Equal Opportunity Employer M/F/D/V. All applicants will be considered for this position based upon experience and knowledge, without regard to race, color, religion, national origin, sexual orientation, ancestry, marital, disabled or veteran status. We are committed to creating and maintaining a workforce environment that is free from any form of discrimination or harassment.</i></p><p><br></p><p>EnableComp recruits, develops and retains the industry's top talent.&nbsp; As the employer of choice in the complex claims industry, EnableComp takes pride in our continuous commitment to building and maintaining a culture centered around fostering the professional growth and development of our people.&nbsp; We believe that <b>investing in our employees is the key to our success</b>, and we are dedicated to providing them with the tools, resources, and support they need to thrive and grow their career here.  At EnableComp, we are committed to living up to our core values each and every day, and we believe that this commitment is what sets us apart from other companies. &nbsp;If you are looking for a company that values its employees and is dedicated to helping them achieve their full potential, then EnableComp is the place for you.</p><p><br></p><p><b><i>&nbsp;<u>Donâ\u0080\u0099t just take our word for it!&nbsp; Hear what our people are saying:</u></i></b></p><p><i>â\u0080\u009cI love my job because everyone shares the same vision and is determined and dedicated. People care about you as a person and your professional growth. There is a genuine spirit of cooperation and shared goals all revolving around helping each other.â\u0080\u009d</i>&nbsp;â\u0080\u0093 Revenue Specialist</p><p><br></p><p><i>â\u0080\u009cI enjoy working for EnableComp because of the Core Values we believe in. EnableComp stands true to these values from empowering employees to ecstatic clients. This company is family oriented and flexible, along with understanding the balance of work, life, and fun.â\u0080\u009d</i>&nbsp;â\u0080\u0093 Supervisor, Operations</p><br/><br/>Please mention the word **FEARLESS** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 90000,
  "salary_max": 152500,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-associate-attorney-enablecomp-1093185",
  "url": "https://remoteOK.com/remote-jobs/remote-associate-attorney-enablecomp-1093185"
}