{
  "slug": "remote-staff-frontend-engineer-notabene-1093179",
  "id": "1093179",
  "epoch": 1747303203,
  "date": "2025-05-15T10:00:03+00:00",
  "company": "Notabene",
  "company_logo": "https://remoteok.com/assets/img/jobs/4e35b30ad595908c6e87013e953582dd1747303205.png",
  "position": "Staff Frontend Engineer",
  "tags": [
    "frontend",
    "design",
    "crypto",
    "cryptocurrency",
    "system",
    "front-end",
    "security",
    "full-stack",
    "technical",
    "support",
    "software",
    "growth",
    "code",
    "web",
    "manager",
    "financial",
    "fintech",
    "typescript",
    "lead",
    "junior",
    "reliability",
    "engineer",
    "engineering",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/4e35b30ad595908c6e87013e953582dd1747303205.png",
  "description": "<p><b style=\"font-size: 24px;\">About Notabene</b></p><p><br></p><p>Working across three continents in eight countries, Notabene is a remote-first and globally distributed team of 40 employees on a mission to make cryptocurrency a part of the everyday economy. As a regulation technology (reg-tech) company, crypto organizations and traditional financial institutions alike use our tools to reduce transaction risk and make crypto transfers safe. Notabene is recognized as a vital enabler of the crypto ecosystem and, to date, weâ\u0080\u0099ve processed over half a trillion dollars worth of transactions!</p><p><br></p><p>In October 2024, we announced our $14.5M Series B, led by DRW. This fundraise signals our exciting trajectory of success as we continue to be the leading global platform and network for compliant crypto transactions. We're proud to have the support of Y Combinator, Jump Capital, Castle Island, Green Visor Capital, and more. Notabene is growing fastâ\u0080\u0094and weâ\u0080\u0099re looking for people like you to play a pivotal role in shaping the future infrastructure of the crypto industry.</p><p><br></p><p><b style=\"font-size: 24px;\">The Impact You'll Have</b></p><p>As a <b>Staff Engineer</b> at Notabene, you'll be a pivotal force driving the development of our complex, distributed payment systems that move hundreds of billions of dollars globally. You will lead by example as a top-tier individual contributor, shaping technical direction while collaborating closely with cross-functional teams. Your ability to take initiative, navigate ambiguity, and deliver high-quality code across the stack will directly impact the scalability and reliability of our platform. This role offers significant autonomy and the opportunity to influence the future infrastructure of compliant crypto transactions worldwide.</p><p><br></p>\\n<p></p><p><br></p><b>What You'll Do</b><ul><li>Lead the design and development of scalable front-end and full-stack solutions with a focus on maintainability and performance.</li><li>Collaborate closely with product, design, and engineering teams to define technical requirements and deliver high-quality features.</li><li>Own and drive complex projects from concept to deployment, ensuring alignment with business goals and technical standards.</li><li>Mentor and coach junior engineers, providing constructive code reviews and fostering a culture of continuous learning.</li><li>Contribute to the evolution of our engineering practices, tooling, and architecture to support rapid growth and innovation.</li><li>Participate in live coding and system design sessions to solve challenging problems and improve system reliability.</li></ul><p><br></p><b>Must-Have Qualifications</b><ul><li>4+ years of professional software engineering experience, preferably with a focus on front-end development and full-stack capabilities</li><li>Proven ability to lead projects and collaborate cross-functionally, demonstrating strong communication and mentorship skills</li><li>Experience working in fast-paced, high-autonomy environments where initiative and self-motivation are essential</li><li>Solid understanding of TypeScript and modern web frameworks; ability to quickly learn new technologies such as SvelteKit</li><li>Demonstrated track record of delivering complex software solutions from concept to production, with attention to detail and quality</li><li>Experience in FinTech, crypto, or related domains is highly desirable but not mandatory, with a willingness to quickly learn the space</li><li>Comfortable working in a meritocratic, results-driven culture that values flow state productivity and ownership of outcomes</li></ul><p><br></p><b>Nice to Have</b><ul><li>Experience in FinTech or blockchain sectors, especially with front-end technologies</li><li>Prior exposure to financial institutions and AML compliance processes</li><li>Proficiency in TypeScript and familiarity with modern front-end frameworks like SvelteKit or React</li><li>Understanding of privacy and security standards (SOC2, ISO27001, GDPR)</li><li>Experience working in fast-paced, autonomous environments with a focus on delivering high-quality code across the full stack</li><li>Demonstrated ability to mentor and coach junior engineers</li><li>Knowledge of distributed systems and complex payment infrastructures</li><li>Entrepreneurial mindset with experience building projects or products from concept to deployment</li></ul><p><br></p><b>Benefits</b><ul><li><b>Flexible Remote Work:</b> Work from anywhere!</li><li><b>$1000 WFH Stipend:</b> Use within your first year of employment.</li><li><b>MacBook Pro:</b> Procured by you and your manager to find a model that meets your needs.</li><li><b>Unlimited PTO:</b> We trust you to take as much holiday as you need.</li><li><b>Country-Specific Benefits:</b> Statutory offerings and contributions, managed via our employer-of-record.</li></ul><p><br></p><p></p>\\n<p><b style=\"font-size: 24px;\">Apply Today!</b></p><p><br></p><p><i>If you strongly believe this role is for you, please apply. Notabene considers a broad array of candidates, including those without blockchain experience. Whether youâ\u0080\u0099re returning to work after a gap in employment, or taking the next step in your career path, we will be glad to have you on our radar.</i></p><p><br></p><p><i>Notabene is proud to be an equal employment workplace and an affirmative action employer. By valuing inclusion and diversity of all forms, we strictly prohibit and do not discriminate based on race, color, religion, national origin, gender, gender identity, gender expression, age, ancestry, citizenship, sexual orientation, status as a protected veteran, or any other legally protected characteristic.</i></p><br/><br/>Please mention the word **BLISSFUL** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 70000,
  "salary_max": 110000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-staff-frontend-engineer-notabene-1093179",
  "url": "https://remoteOK.com/remote-jobs/remote-staff-frontend-engineer-notabene-1093179"
}