{
  "slug": "remote-sales-development-representative-torch-1093146",
  "id": "1093146",
  "epoch": 1746788402,
  "date": "2025-05-09T11:00:02+00:00",
  "company": "Torch",
  "company_logo": "https://remoteok.com/assets/img/jobs/375778ed0bf31313c1bbc86153e1cf451746788403.png",
  "position": "Sales Development Representative",
  "tags": [
    "support",
    "lead",
    "marketing",
    "sales"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/375778ed0bf31313c1bbc86153e1cf451746788403.png",
  "description": "<p><b style=\"font-size: 13pt;\">KICKSTART YOUR SALES CAREER AT TORCH</b></p><p><span style=\"font-size: 11pt;\">Are you a natural connector who thrives on meaningful conversations? Do you love tech, get energized by new challenges, and bounce back stronger with every â\u0080\u009cnoâ\u0080\u009d? At Torch, we're not just offering you a jobâ\u0080\u0094weâ\u0080\u0099re offering a launchpad for your sales career.</span></p><p><br></p><p><span style=\"font-size: 11pt;\">Weâ\u0080\u0099re on a mission to transform leadership in the modern workplace, and weâ\u0080\u0099re looking for curious, self-driven people to help us do it. As an SDR at Torch, youâ\u0080\u0099ll be using world-class sales technology to find and engage some of the most influential companies in the worldâ\u0080\u0094think fast-growing startups to Fortune 500s.</span></p><p><br></p><p><span style=\"font-size: 11pt;\">No previous SDR experience? Thatâ\u0080\u0099s not a problem. If you're resilient, people-oriented, tech-savvy, and motivated to grow fast, weâ\u0080\u0099ll coach you on the rest.</span></p><p><br></p><p><b style=\"font-size: 13pt;\">ABOUT TORCH</b></p><p><span style=\"font-size: 11pt;\">At Torch, we believe in the power of people. People are the heart of every success story. They collaborate to achieve ambitious things together. And they inspire others to build a better future.&nbsp;</span></p><p><br></p><p><span style=\"font-size: 11pt;\">We believe leadership is about driving change, not just managing it. Our coaching adapts to the organization's needs, empowering leaders to tackle todayâ\u0080\u0099s challengesâ\u0080\u0094whether navigating AI, strengthening teams, or inspiring innovation. We focus on creating a lasting impact from day one, preparing organizations for the future.</span></p><p><br></p><p><b style=\"font-size: 13pt;\">OUR VALUES</b></p><p><span style=\"font-size: 11pt;\">All Torch employees are expected to reflect and enhance our company values. Click </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 11pt;\" href=\"https://torch.io/about-us/\">here</a><span style=\"font-size: 11pt;\"> to see a detailed list of our values.&nbsp;</span></p><p><br></p><p><b style=\"font-size: 11pt;\">The future is bright </b><span style=\"font-size: 11pt;\">â\u0080\u0093 We are reimagining leadership and leaning into our strengths to bring it to life</span></p><p><b style=\"font-size: 11pt;\">Pass the torch</b><span style=\"font-size: 11pt;\"> â\u0080\u0093 Leadership is about developing others, embracing new ideas, and sharing knowledge</span></p><p><b style=\"font-size: 11pt;\">No one succeeds alone</b><span style=\"font-size: 11pt;\"> â\u0080\u0093 We multiply our efforts by trusting each other and welcoming diverse perspectives</span></p><p><b style=\"font-size: 11pt;\">Change is our catalyst</b><span style=\"font-size: 11pt;\"> â\u0080\u0093 We embrace change, move with speed, and shape it into something great</span></p><p><b style=\"font-size: 11pt;\">Lead from the inside out</b><span style=\"font-size: 11pt;\"> â\u0080\u0093 Self-awareness fuels growthâ\u0080\u0094personally and as leaders</span></p><p><br></p><p><b style=\"font-size: 13pt;\">THE TEAM</b></p><p><span style=\"font-size: 11pt;\">At Torch, the Sales Development department exists to create new business opportunities with prospective clients.</span></p><p><br></p><p><span style=\"font-size: 11pt;\">Torch is looking for a Sales Development Representative to help quickly scale our client base and identify new revenue opportunities. Our clients are diverse and range from startups to Fortune 500 companies. This role will be a critical part of our sales team focused on building new business from cold outbound. You are excited about building and nurturing relationships and understanding what they need to support growing their leadership.</span></p><p><br></p><p><span style=\"font-size: 11pt;\">This position will report to the SDR Team Manager.</span></p>\\n<p></p><p><br></p><b>YOUR ROLE</b><ul><li>Gain a thorough understanding of client needs and the Torch product to ensure successful matches.</li><li>Prospect and generate leads through various channels, including cold calling, email campaigns, social media outreach, and networking.</li><li>Use premium sales outreach technology, Linkedin, Cold Calling and AI to build pipeline.</li><li>Qualify leads by engaging in meaningful conversations to determine their level of interest, budget, and decision-making authority.</li><li>Collaborate closely with the sales team and account executives to develop strategies for successful lead conversion and revenue growth.</li><li>Meet or exceed monthly and quarterly sales targets and key performance indicators (KPIs) as set by the sales manager.</li><li>Working with the SDR Team Manager, at times you will collaborate with marketing teams to provide feedback on lead quality and suggest improvements in lead generation strategies.</li><li>Represent the company at industry events, trade shows, and conferences to network with potential customers and promote brand awareness.</li><li>Demonstrate a strong work ethic, persistence, and resilience in pursuing sales targets and overcoming objections.</li></ul><p><br></p><b>WHAT YOU BRING</b><ul><li>A love for talking to peopleâ\u0080\u0094you thrive on human connection and can spark engaging conversations with anyone.</li><li>A tech-forward mindsetâ\u0080\u0094youâ\u0080\u0099re comfortable navigating sales tools like CRMs, email platforms, and social media.</li><li>Resilienceâ\u0080\u0094you bounce back from rejection and keep a positive mindset.</li><li>Hunger to learn and growâ\u0080\u0094youâ\u0080\u0099re excited to be coached and improve every day.</li><li>Strong written and verbal communication skills that make you stand out.</li><li>A self-starter attitudeâ\u0080\u0094you take initiative and donâ\u0080\u0099t wait for permission to make things better.</li><li>Bonus: Experience in customer-facing roles, sales, or working in a fast-paced environment.</li></ul><p><br></p><b>TORCH PROVIDES</b><ul><li><b>Generous Benefits</b> â\u0080\u0093 16 weeks paid parental leave and your own Torch coach&nbsp;</li><li><b>Impactful Mission-Driven Work</b> â\u0080\u0093 Help empower a new generation of leaders to evolve as fast as the world around them</li><li><b>A Team Who Walks The Walk</b> â\u0080\u0093 We understand coaching's transformative power firsthand and our internal practices are shaped by the same leadership principles we champion</li><li><b>Remote-First Culture</b> â\u0080\u0093 Work remotely with a flexible schedule</li><li><b>Competitive Compensation</b> â\u0080\u0093 Salary range of $65,000 - $70,000&nbsp; plus 30% variable and equity options</li></ul><p><br></p><p></p>\\n<div>$65,000 - $70,000 a year</div><small><div><span style=\"font-size: 11pt;\">Please note that the above range is base salary. This role offers an additional 30% of variable pay if sales targets are met.  </span></div></small>\\n<p><span style=\"font-size: 11pt;\">Torch provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.</span></p><br/><br/>Please mention the word **AMUSING** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Remote",
  "salary_min": 45000,
  "salary_max": 67500,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-sales-development-representative-torch-1093146",
  "url": "https://remoteOK.com/remote-jobs/remote-sales-development-representative-torch-1093146"
}