{
  "slug": "remote-psychotherapist-athena-1093237",
  "id": "1093237",
  "epoch": 1748217747,
  "date": "2025-05-26T00:02:27+00:00",
  "company": "Athena",
  "company_logo": "https://remoteok.com/assets/img/jobs/4d6c402e4d9426b4f1da63505e50e8ca1748217749.png",
  "position": "Psychotherapist",
  "tags": [
    "health",
    "non tech"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/4d6c402e4d9426b4f1da63505e50e8ca1748217749.png",
  "description": "<p><span style=\"font-size: 11pt\">AthenaPsych is a New York State mental health-approved provider of community mental health services for children, adults, and families with behavioral and emotional challenges.&nbsp;We specialize in individual and group psychotherapy for clients with a focus on trauma-informed care. Athena is dedicated to improving the quality and accessibility of mental health care for all, especially individuals from underserved communities.&nbsp;</span></p><p><br></p><p><span style=\"font-size: 11pt\">Here at Athena, we pride ourselves on hiring a diverse group of mental health clinicians and staff who are passionate and dedicated to improving our clientsâ\u0080\u0099 overall emotional well-being. We provide both in-person and telehealth services for our clients.&nbsp;</span></p>\\n<p></p><p><br></p><b>Responsibilities:</b><ul><li>Conducts evidence-based therapeutic sessions for children, families, and individuals in person or via telehealth.</li><li>Develops and implements goal-oriented treatment plans.</li><li>Completes documentation by a given deadline and in compliance with program and state regulations.</li><li>Ensures all clinical notes and client information are updated and accurate within the current EHR system. </li><li>Provide conflict resolution and crisis intervention when needed.</li></ul><p><br></p><b>Qualifications:</b><ul><li><b>Master's Degree from an accredited school in Mental Health Counseling, Social Work, Creative Arts Therapy, or Marriage and Family Therapy.</b></li><li><b>Bilingual in English and Spanish is a plus.</b></li><li>LMSW, LMHC, or LMFT is a plus but not required.</li><li>Must be passionate about working with underserved communities and possess a high level of engagement, entrepreneurial, and interpersonal skills.</li><li>Experience working in an OMH (Article 31/28) environment is strongly desired. </li></ul><p><br></p><p></p>\\n<div>$65,000 - $100,000 a year</div><small><div><b><u>We are a fee-for-service modeled clinic where therapist are paid per session completed.</u></b></div><div><br></div><div><b>Compensation is based on credentials and experience. </b></div></small>\\n<p><span style=\"font-size: var(--artdeco-reset-base-font-size-hundred-percent);\">Working Conditions:</span></p><p><span style=\"font-size: var(--font-size-small);\">The primary work location varies. This is a professional work environment where a computer, desk, chair, and office supplies will be provided in either an office.</span></p><p><br></p><p><span style=\"font-size: var(--artdeco-reset-base-font-size-hundred-percent);\">Physical </span><span style=\"font-size:var(--artdeco-reset-base-font-size-hundred-percent)\">Requirements:</span></p><p><span style=\"font-size: var(--font-size-small);\">The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of the role above. While performing the duties of this job, the employee is regularly required to hear and speak on the phone or through virtual telehealth sessions conducted on a computer throughout the day, stand and sit for an extended period, and be able to write and answer emails in addition to carrying objects no greater than 20 pounds, when needed. </span></p><p><br></p><p><span style=\"font-size: var(--artdeco-reset-base-font-size-hundred-percent);\">Direct Reports:</span></p><p><span style=\"font-size: var(--font-size-small);\">This position has no direct reports.</span></p><p><br></p><p><b><i>Athena is an Equal Opportunity Employer.</i></b></p><br/><br/>Please mention the word **DIVINELY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "New York, NY",
  "salary_min": 50000,
  "salary_max": 70000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-psychotherapist-athena-1093237",
  "url": "https://remoteOK.com/remote-jobs/remote-psychotherapist-athena-1093237"
}