{
  "slug": "remote-project-manager-prime-design-and-build-1093210",
  "id": "1093210",
  "epoch": 1747870645,
  "date": "2025-05-21T23:37:25+00:00",
  "company": "Prime design and build",
  "company_logo": "https://remoteOK.com/assets/img/jobs/9a25ef5046eb0fff1b24c8d0ab86c5c91747870645.png",
  "position": "project manager",
  "tags": [
    "project manager",
    "excel",
    "design",
    "other"
  ],
  "logo": "https://remoteOK.com/assets/img/jobs/9a25ef5046eb0fff1b24c8d0ab86c5c91747870645.png",
  "description": "<h3><strong>About Us</strong></h3><p>At <strong>Prime Design &amp; Build</strong>, weâ\u0080\u0099re more than a construction companyâ\u0080\u0094weâ\u0080\u0099re a full-service design-build firm dedicated to creating spaces that reflect our clientsâ\u0080\u0099 lifestyle, values, and long-term needs. Based in California, we specialize in residential remodeling, new construction, and accessory dwelling units (ADUs), with a sharp focus on quality craftsmanship, customer service, and project efficiency.</p><h3><strong>Role Overview</strong></h3><p>We are looking for a <strong>detail-oriented, proactive, and highly organized Remote Project Manager</strong> to oversee multiple residential construction projects from start to finish. You will be the bridge between our in-field teams, design department, permit division, and clientsâ\u0080\u0094ensuring every project moves smoothly, stays on schedule, and remains within budget.</p><h3><strong>Key Responsibilities</strong></h3><ul><li><p>Oversee day-to-day progress of 3â\u0080\u00936 active residential construction projects</p></li><li><p>Coordinate schedules with field crews, subcontractors, and inspectors</p></li><li><p>Review and manage project timelines, change orders, and milestone completions</p></li><li><p>Communicate clearly and regularly with clients, addressing concerns and managing expectations</p></li><li><p>Collaborate with architects, designers, and engineers to ensure plans are executed accurately</p></li><li><p>Track materials, delivery schedules, and jobsite needs using our internal systems</p></li><li><p>Monitor job costs and ensure all billing is aligned with project scope and progress</p></li><li><p>Ensure compliance with local building codes, permit requirements, and safety regulations</p></li><li><p>Submit and follow up on inspections and permit status (as needed)</p></li></ul><h3><strong>Qualifications</strong></h3><ul><li><p>3+ years of project management experience in residential construction or remodeling</p></li><li><p>Strong understanding of residential construction workflows, timelines, and terminology</p></li><li><p>Excellent communication and coordination skills across departments and stakeholders</p></li><li><p>Ability to read architectural plans, scopes of work, and city permit documents</p></li><li><p>Self-motivated and capable of working independently in a fast-paced, remote setting</p></li><li><p>Tech-savvy with project management software (Buildertrend, Procore, Monday.com, or similar)</p></li><li><p>Bilingual in English/Spanish is a plus</p></li></ul><h3><strong>Working Conditions</strong></h3><ul><li><p>Fully remote, but must be available during Pacific Time Zone working hours (8 AMâ\u0080\u00936 PM PT)<br /></p></li><li><p>Weekly team meetings via Zoom and daily check-ins via Slack</p></li></ul><h3><strong>What We Offer</strong></h3><ul><li><p>Competitive salary (based on experience)</p></li><li><p>Performance-based bonuses</p></li><li><p>Opportunity for growth and leadership within a fast-scaling company</p></li><li><p>Collaborative, no-drama company culture focused on quality and accountability</p></li></ul><p><br /></p><p><br /></p><br/><br/>Please mention the word **RESTFUL** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 10000,
  "salary_max": 30000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-project-manager-prime-design-and-build-1093210",
  "original": true,
  "url": "https://remoteOK.com/remote-jobs/remote-project-manager-prime-design-and-build-1093210"
}