{
  "slug": "remote-people-analytics-business-partner-h1-1093225",
  "id": "1093225",
  "epoch": 1748149203,
  "date": "2025-05-25T05:00:03+00:00",
  "company": "H1",
  "company_logo": "https://remoteok.com/assets/img/jobs/f88c9d1bcc7ccadd1f1e580621b2a41b1748149204.png",
  "position": "People Analytics Business Partner",
  "tags": [
    "design",
    "saas",
    "hr",
    "recruiter",
    "support",
    "payroll",
    "strategy",
    "management",
    "lead",
    "operations",
    "analytics",
    "biotech",
    "health",
    "healthcare",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/f88c9d1bcc7ccadd1f1e580621b2a41b1748149204.png",
  "description": "<p><span style=\"font-size: 12pt;\">At H1, we believe access to the best healthcare information is a basic human right. Our mission is to provide a platform that can optimally inform every doctor interaction globally. This promotes health equity and builds needed trust in healthcare systems. To accomplish this our teams harness the power of data and AI-technology to unlock groundbreaking medical insights and convert those insights into action that result in optimal patient outcomes and accelerates an equitable and inclusive drug development lifecycle.&nbsp; Visit </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 12pt;\" href=\"http://h1.co\">h1.co</a><span style=\"font-size: 12pt;\"> to learn more about us.</span></p><p><span style=\"font-size: 12pt;\">At H1, our People team is focused on building a high-performing, inclusive, and values-driven workplace. We partner closely with leaders and employees across the business to attract, support, and grow top talentâ\u0080\u0094while ensuring our systems, policies, and programs scale with us. Whether itâ\u0080\u0099s hiring the right people, enabling great performance, or enhancing employee experience, weâ\u0080\u0099re here to make H1 a place where people can do the best work of their careers.</span></p><p><br></p><p><b style=\"font-size: 12pt;\">WHAT YOUâ\u0080\u0099LL DO AT H1</b></p><p><br></p><p><span style=\"font-size: 12pt;\">You will:</span></p><p><br></p><p><span style=\"font-size: 12pt;\">- Run Core People Operations Processes: Lead day-to-day HR operations for our US and UK workforce including running payroll, maintaining employee records, compliance tracking, and benefits administration with an eye toward attention to detail and continual process improvement.</span></p><p><span style=\"font-size: 12pt;\">- Drive Programmatic Work: Have key involvement and&nbsp; ownership of people programsâ\u0080\u0094like 360&nbsp; performance review cycles, regular feedback delivery, and employee lifecycle processesâ\u0080\u0094that touch every employee and require cross-functional partnership to scale well.</span></p><p><span style=\"font-size: 12pt;\">- Be a Strategic Partner: Act as a go-to thought partner for managers and People team leaders, helping connect the dots between business priorities and people strategy.&nbsp; Be involved in solving complex business problems involved in scaling a growing business.&nbsp;</span></p><p><span style=\"font-size: 12pt;\">- Own Key Systems: Manage and improve our usage of Culture Amp and Rippling to ensure seamless, employee-friendly workflows and accurate data across the board.</span></p><p><span style=\"font-size: 12pt;\">- Build with Scrappiness: Use your spreadsheet and project management skills to design processes, monitor trends, and drive forward work thatâ\u0080\u0099s not yet automated or resourced with a full team.</span></p><p><span style=\"font-size: 12pt;\">- Support Culture and Change: Help design and implement high-impact, high-visibility programs that reinforce our values and improve the employee experience.</span></p><p><br></p><p><b style=\"font-size: 12pt;\">ABOUT YOU</b></p><p><br></p><p><span style=\"font-size: 12pt;\">Youâ\u0080\u0099re a builder at heartâ\u0080\u0094someone who finds energy in creating structure, improving processes, and making things work better for the people around you. You thrive in environments where you can move between details and big-picture thinking, and youâ\u0080\u0099re known for being reliable, thoughtful, and solutions-oriented. Youâ\u0080\u0099re not afraid to get into the weeds, but you also know when to zoom out and ask, â\u0080\u009cIs this still serving us?â\u0080\u009d Most of all, you care deeply about creating a workplace where people can grow and do meaningful work.</span></p><p><br></p><p><b style=\"font-size: 12pt;\">REQUIREMENTS</b></p><p><br></p><p><span style=\"font-size: 12pt;\">- 5+ years of experience in People Ops, People Analytics, HRBP, or HR Generalist rolesâ\u0080\u0094ideally in a fast-paced, high-growth SaaS start up environment</span></p><p><span style=\"font-size: 12pt;\">- Familiarity with payroll processing, benefits administration, and comfort owning compliance deliverables (401k audit experience is a plus)</span></p><p><span style=\"font-size: 12pt;\">- Experience owning or significantly contributing to the buildout of people programs (e.g., performance, feedback, surveys, engagement, onboarding)</span></p><p><span style=\"font-size: 12pt;\">- Strong working knowledge of Rippling and/or Culture Amp, or a proven ability to quickly learn and optimize HR systems</span></p><p><span style=\"font-size: 12pt;\">- Analytical confidenceâ\u0080\u0094youâ\u0080\u0099re not afraid of spreadsheets and can use data to support sound decision-making</span></p><p><span style=\"font-size: 12pt;\">- Strong judgment, excellent communication skills, and the ability to flex between strategy and execution</span></p><p><br></p><p><b style=\"font-size: 12pt;\">COMPENSATION</b></p><p><br></p><p><span style=\"font-size: 12pt;\">This role pays $100,000 to $120,000 per year, based on experience, in addition to stock options.</span></p><p><br></p><p><b style=\"font-size: 12pt;\">H1 OFFERS</b></p><p><span style=\"font-size: 12pt;\">- Full suite of health insurance options, in addition to generous paid time off- Pre-planned company-wide wellness holidays</span></p><p><span style=\"font-size: 12pt;\">- Retirement options</span></p><p><span style=\"font-size: 12pt;\">- Health &amp; charitable donation stipends</span></p><p><span style=\"font-size: 12pt;\">- Impactful Business Resource Groups</span></p><p><span style=\"font-size: 12pt;\">- Flexible work hours &amp; the opportunity to work from anywhere</span></p><p><span style=\"font-size: 12pt;\">- The opportunity to work with leading biotech and life sciences companies in an innovative industry with a mission to improve healthcare around the globe</span></p><p><br></p><p><span style=\"font-size: 12pt;\">H1 is proud to be an equal opportunity employer that celebrates diversity and is committed to creating an inclusive workplace with equal opportunity for all applicants and teammates. Our goal is to recruit the most talented people from a diverse candidate pool regardless of race, color, ancestry, national origin, religion, disability, sex (including pregnancy), age, gender, gender identity, sexual orientation, marital status, veteran status, or any other characteristic protected by law.</span></p><p><br></p><p><span style=\"font-size: 12pt;\">H1 is committed to working with and providing access and reasonable accommodation to applicants with mental and/or physical disabilities. If you require an accommodation, please reach out to your recruiter once you've begun the interview process. All requests for accommodations are treated discreetly and confidentially, as practical and permitted by law.</span></p><p><br></p><p>Anticipated role close date: 06/15/2025</p><p><br></p><p><br></p>\\n<p></p><p><br></p><p></p>\\n<p><b>H1 OFFERS</b></p><p>- Full suite of health insurance options, in addition to generous paid time off</p><p>- Pre-planned company-wide wellness holidays</p><p>- Retirement options</p><p>- Health &amp; charitable donation stipends</p><p>- Impactful Business Resource Groups</p><p>- Flexible work hours &amp; the opportunity to work from anywhere</p><p>- The opportunity to work with leading biotech and life sciences companies in an innovative industry with a mission to improve healthcare around the globe</p><p><br></p><p><br></p><p><i>H1 is proud to be an equal opportunity employer that celebrates diversity and is committed to creating an inclusive workplace with equal opportunity for all applicants and teammates. Our goal is to recruit the most talented people from a diverse candidate pool regardless of race, color, ancestry, national origin, religion, disability, sex (including pregnancy), age, gender, gender identity, sexual orientation, marital status, veteran status, or any other characteristic protected by law.</i></p><p><i>&nbsp;</i></p><p><i>H1 is committed to working with and providing access and reasonable accommodation to applicants with mental and/or physical disabilities. If you require an accommodation, please reach out to your recruiter once you've begun the interview process. All requests for accommodations are treated discreetly and confidentially, as practical and permitted by law.</i></p><br/><br/>Please mention the word **DEVOUT** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "US Remote",
  "salary_min": 30000,
  "salary_max": 55000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-people-analytics-business-partner-h1-1093225",
  "url": "https://remoteOK.com/remote-jobs/remote-people-analytics-business-partner-h1-1093225"
}