{
  "slug": "remote-full-stack-software-engineer-daisychain-1093170",
  "id": "1093170",
  "epoch": 1747234894,
  "date": "2025-05-14T15:01:34+00:00",
  "company": "Daisychain",
  "company_logo": "https://remoteOK.com/assets/img/jobs/8e967a1a742706eeaf7d3bc1be9eb7221747234894.png",
  "position": "Full Stack Software Engineer",
  "tags": [
    "engineer",
    "dev",
    "javascript",
    "ruby",
    "postgres",
    "vue",
    "typescript",
    "redis",
    "aws"
  ],
  "logo": "https://remoteOK.com/assets/img/jobs/8e967a1a742706eeaf7d3bc1be9eb7221747234894.png",
  "description": "<p>â\u0080\u008d<strong>Overview</strong>â\u0080\u008d</p><p><a href=\"https://www.daisychain.app/\">Daisychain</a> is excited to announce the opening for a <a href=\"https://www.daisychain.app/jobs/software-engineer\">Software Engineer</a> to join our team. This individual will be a part of our small, innovative team that is giving progressive community organizers new ways to bring data about their supporters together, orchestrate outreach, and automate busy-work â\u0080\u0093 while scaling the impact they have in the world.Â Â </p><p>Weâ\u0080\u0099re seeking a software engineer who is excited about using their talents to deepen the impact of the causes we work with while having an opportunity to shape the technical direction of our product.</p><p><strong>â\u0080\u008d</strong>Daisychain is building a modern platform for effective organizing. Our customers include progressive political campaigns, grassroots organizations, and ambitious non-profits. Collectively, they're using Daisychain to win critical campaigns, build powerful movements, and create a more just and equitable world.Â </p><p>â\u0080\u008d<strong>Job Title:Â </strong>Software Engineer</p><p>â\u0080\u008d<strong>Reports to:Â </strong>CTO</p><p><strong>Schedule:</strong>Â Full-Time</p><p>â\u0080\u008d<strong>Location:Â </strong>We're building a remote product and engineering team with a center of gravity in the New York City metro area. Work from anywhere with high speed internet as long as your work day overlaps with the U.S. East Coast business hours, so we can talk on Zoom and Slack. For candidates outside of the NYC metro area, this role requires travel to a team gathering 1-2 times per year.</p><p>â\u0080\u008d<strong>Responsibilities<br /></strong></p><ul><li><strong>â\u0080\u008d</strong>Â Work collaboratively to deliver new features of the Daisychain product to customers.<br /><br /></li><li>Take part in planning new features, understanding high-level customer requirements, and shaping the vision for the Daisychain product.<br /><br /></li><li>Participate in peer code review, technical planning and architectural decision making.</li></ul><p>â\u0080\u008d<strong>Experience Requirements</strong></p><ul><li>At least 3 years of experience writing ambitious full-stack software for the web.<br /><br /></li><li>Experience with a modern javascript framework like React or Vue.js<br /><br /></li><li>Experience with a model-view-controller web framework like Express.js, Django or Rails.<br /><br /></li><li>Experience with or openness to working remotely as part of a collaborative team.<br /><br /></li><li>Familiarity and experience with the ways that organizations and campaigns use the internet to create social change and organize people.<br /><br /></li><li>A passion for positive and progressive social change.<br /><br /></li><li>Fluent in written and spoken English</li></ul><p>â\u0080\u008d<strong>Preferred Qualifications<br /></strong></p><ul><li>Experience with AI/ML techniques.<br /><br /></li><li>Experience with voter files and other technologies that make up the political technology ecosystem.<br /><br /></li><li>Experience with column oriented databases or large scale data integration.</li></ul><p><strong>Technical Background</strong></p><p>Our tech stack includes Ruby, Vue.js, Typescript, Clickhouse and Postgres, deployed on AWS. We are passionate about software engineering as a craft.Â  Daisychain is built on a solid foundation of best practices like continuous delivery, acceptance tests, monitoring and code review.</p><p><strong>Compensation and Benefits</strong></p><p><strong>â\u0080\u008d</strong><em>Weâ\u0080\u0099re considering both full-time salaried roles for candidates within the United States and contractor roles for candidates based outside of the United States.</em></p><ul><li>The salary range for this position for full-time US Candidates is $120k - $160k depending on experience. The contractor compensation range for this position is dependent on location and experience.<br /><br /></li><li>Profit Sharing: Full-time employees are eligable to participate in Daisychain's profit-sharing program, aligning with our commitment to sharing the financial rewards of our collective efforts.<br /><br /></li><li>Â Benefits: Daisychain offers a comprehensive benefits package to full-time employees, including medical, dental, vision, matching 401(k), and paid time off.<br /><br /></li></ul><p>â\u0080\u008d<strong>Daisychain is an Equal Opportunity Employer</strong></p><p>We believe that diversity of ideas and perspectives makes our products and the movements that we serve stronger. We are proud to be an inclusive and equal-opportunity workplace, where all applicants and employees are considered for hire, promotion and job status without regard to race, ethnicity, color, religious affiliation, national origin, age, gender identity or expression, sexual orientation, or physical handicap.</p><br/><br/>Please mention the word **SATISFY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 70000,
  "salary_max": 160000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-full-stack-software-engineer-daisychain-1093170",
  "original": true,
  "url": "https://remoteOK.com/remote-jobs/remote-full-stack-software-engineer-daisychain-1093170"
}