{
  "slug": "remote-lifecycle-marketing-associate-blueland-1093188",
  "id": "1093188",
  "epoch": 1747393203,
  "date": "2025-05-16T11:00:03+00:00",
  "company": "Blueland",
  "company_logo": "https://remoteok.com/assets/img/jobs/455eeceae22d94f90cdd199aca2d8df21747393204.png",
  "position": "Lifecycle Marketing Associate",
  "tags": [
    "support",
    "growth",
    "investment",
    "strategy",
    "management",
    "marketing",
    "part-time"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/455eeceae22d94f90cdd199aca2d8df21747393204.png",
  "description": "<p><br></p><p><span style=\"font-size: 16px;\">Blueland is revolutionizing conventional cleaning and personal care products to eliminate the need for single-use plastic packaging, while prioritizing the planet and people. We believe that we should be able to have a clean home without sacrificing a clean planet and that sustainable choices should be effective, convenient, and affordable. We also believe that businesses need to be reconstructed to consider all stakeholders, not just profit.</span></p><p><br></p><p><span style=\"font-size: 16px;\">We are a science-driven company with a pipeline of proprietary products that started with our cleaning sprays and hand soap (we hold over 40 patents and patents pending worldwide). To date, weâ\u0080\u0099ve already helped divert more than 1 billion single-use plastic bottles from landfills and waterways. We were the 2nd fastest growing direct-to-consumer in 2020, and have built an engaged, passionate community of close to 1M+ person community. Weâ\u0080\u0099re proud to be a Certified B Corp - recognized for meeting the highest standards of verified social and environmental performance, transparency, and accountability. Weâ\u0080\u0099re also Climate Neutral Certified along with many other certifications that help hold us accountable on our commitments to optimize our products for environmental and human health.</span></p><p><br></p><p><span style=\"font-size: 16px;\">Blueland was featured on the Season 11 premiere of Shark Tank, securing an investment by Kevin Oâ\u0080\u0099Leary. Blueland is well-funded by top tier venture capital firms as well as notable investors including Gwyneth Paltrow, Justin Timberlake and founders of Sweetgreen, Thrive Market, Honest Company, Rent the Runway, and Bonobos. Weâ\u0080\u0099ve been featured across top tier outlets such as the New York Times, Fast Company, TechCrunch, VOGUE, Wall Street Journal, Inc., and more.</span></p><p><br></p><p><span style=\"font-size: 16px;\"><b>The Role:</b></span></p><p><br></p><p><span style=\"font-size: 16px;\">The Growth Marketing team is seeking a part-time, temporary, Lifecycle Marketing Associate to support the strategy &amp; execution of our Email/SMS marketing efforts.</span></p><p><br></p>\\n<p></p><p><br></p><b>Responsibilities:</b><ul><li>Own outgoing Email and SMS communication for retention and acquisition</li><li>Manage Email &amp; SMS campaign calendar and ensure a smooth process from campaign scoping to segmented sends</li><li>Manage Klaviyo, our ESP and SMS platform</li><li>Develop briefs and work in collaboration with the Brand and Creative team to develop engaging emails</li><li>Report on key Email/SMS metrics to drive actionable insights and optimize marketing strategies</li></ul><div><br></div><p><br></p><b>Qualifications:</b><ul><li>1-2 years of lifecycle marketing experience. Startup &amp; DTC experience preferred</li><li>Deep understanding of Email &amp; SMS (flows, campaigns, cross-sell/upsell, customer segmentation, etc.). Experience in Klaviyo required.</li><li>Experience with Figma and project management tools, Notion and Asana preferred.</li><li>Detail-oriented and a fast learner comfortable wearing many hats</li><li>Consistently takes initiative and has a relentless desire to optimize &amp; improve metrics</li><li>Excellent written and verbal communication skills</li><li>Passionate about the environment and sustainability and interested in Bluelandâ\u0080\u0099s mission</li></ul><div><br></div><p><br></p><p></p>\\n<p><span style=\"font-size: 16px;\">The hourly range for this position is $50-$55/hour. This is a part-time role at 20 hours/week. Employment duration is: <b> July 7th - November 17th.</b></span></p><p><br></p><p><span style=\"font-size: 16px;\"><i>At Blueland we believe in order to build a better future and planet, we must advocate for diversity, equity and inclusion. We are proud to have assembled a diverse team and strongly encourage you to apply even if you donâ\u0080\u0099t meet every </i><a href=\"http://qualification.View\"><i>qualification.</i></a></span></p><p><br></p><p><span style=\"font-size: 16px;\"><a href=\"http://qualification.View\">View</a> our </span><a style=\"font-size: 16px;\" href=\"https://www.blueland.com/ccpa\">California Personnel and Applicant Privacy Notice</a><span style=\"font-size: 16px;\">.</span></p><br/><br/>Please mention the word **ENRICH** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Remote",
  "salary_min": 35000,
  "salary_max": 65000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-lifecycle-marketing-associate-blueland-1093188",
  "url": "https://remoteOK.com/remote-jobs/remote-lifecycle-marketing-associate-blueland-1093188"
}