{
  "slug": "remote-head-of-growth-ava-foundation-1093162",
  "id": "1093162",
  "epoch": 1747116004,
  "date": "2025-05-13T06:00:04+00:00",
  "company": "AVA Foundation",
  "company_logo": "https://remoteok.com/assets/img/jobs/23abe0e652a74c675fc1a0ff162eb5101747116005.jpg",
  "position": "Head of Growth",
  "tags": [
    "growth",
    "design",
    "web3",
    "crypto",
    "test",
    "travel",
    "strategy",
    "management",
    "lead",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/23abe0e652a74c675fc1a0ff162eb5101747116005.jpg",
  "description": "Job Type: Contract  About Us: The AVA Foundation s mission is to create a decentralized and self-sufficient blockchain-based loyalty ecosystem. At the core of the ecosystem is the AVA token, which serves as the native token of Travala, the world s leading crypto-native travel booking service backed by Binance. AVA functions as the key to accessing the AVA Smart Program on Travala, providing perks to travellers such as crypto travel rewards, travel discounts, and more. By tokenising the concept of loyalty reward programs using blockchain technology, we re bringing loyalty programs into the web3 era.  Position Overview: The Head of Growth will play a critical role in driving the strategic and tactical initiatives that will fuel user acquisition, engagement, and retention. This role is ideal for someone with a deep understanding of web3 ecosystems, an experimental and data-driven approach, and a passion for both partnership management and community engagement. You will be responsible for leading a small team of contributors to collaborate across functionsâ\u0080\u0094marketing, product, partnerships, and engineeringâ\u0080\u0094to craft and execute a growth strategy that delivers stellar results. As a fully remote role, the ideal candidate will bring a culture of exceptional proactivity, the ability to project manage and see ideas through with minimal direction, an eagerness to collaborate and discuss ideas with other contributors, and a desire to make a genuine positive impact on the AVA ecosystem.  Key Responsibilities:  1. Growth Strategy Development: â\u0080¢ Define, implement, and refine a scalable growth strategy that drives user acquisition, activation, engagement, and retention across our product suite. â\u0080¢ Develop growth models and KPIs tailored to web3 dynamics, with a focus on decentralization, community, and token-based incentives. â\u0080¢ Identify growth levers and test growth hypotheses through rapid experimentation.  2. Partnerships &amp;amp; Business Development: â\u0080¢ Identify, develop, and maintain strategic partnerships to drive growth and expand product reach. â\u0080¢ Design campaigns with web3 projects, exchanges, and ecosystems that amplify growth by leveraging cross-marketing strategies with partner communities. â\u0080¢ Analyze the market and tap into your network to identify potential collaboration opportunities, emerging trends, and the competitive landscape.  3. Data-Driven Growth: â\u0080¢ Lead data analysis and growth modeling to identify new opportunities and measure effectiveness. â\u0080¢ Conduct in-depth analysis to understand user behavior and growth drivers, reporting insights and adjustments to stakeholders regularly. â\u0080¢ Oversee real-time growth metrics like user growth, engagement, retention, and revenue.  4. Community Building &amp;amp; Engagement: â\u0080¢ Drive community growth strategies that engage new users, existing members, and partners, enhancing the company s brand presence. â\u0080¢ Become a vital part of the community by establishing a presence that fosters meaningful engagement and open discussion through regular community interactions. â\u0080¢ Appear on audiovisual mediums such as interviews, podcasts, and AMAs to establish yourself as the face of the AVA Foundation.  5. Product-Led Growth: â\u0080¢ Pitch new initiatives for the AVA Smart Program and refine existing initiatives to ensure the program aligns with evolving user needs and market trends. â\u0080¢ Work with the product team to develop and optimize the user journey (onboarding, interface, etc.) to reduce friction points and boost conversion, activation, and retention. â\u0080¢ Continuously refine the product roadmap to prioritize features and improvements that will have the highest impact on growth metrics.  Skills &amp;amp; Qualifications: â\u0080¢ 5+ years of experience in growth, marketing, business development, or product roles, with at least 2 years in a leadership role within the web3 space. â\u0080¢ Deep understanding of the web3 landscape, including key user segments, trends, and challenges in adoption. â\u0080¢ Strong analytical skills with proficiency in data tools and a results-driven mindset. â\u0080¢ Experience leading growth initiatives with a strong experimental approach, such as A/B testing, funnel optimization, and data-driven experimentation. â\u0080¢ Familiarity with community-building dynamics in web3, including incentivized growth models and loyalty programs (e.g., tokenomics, rewards). â\u0080¢ Comfortable with publicity, undertaking speaking opportunities, and maintaining an active presence within the community. â\u0080¢ Excellent leadership, communication, autonomy, proactivity, and project management skills, with the ability to drive cross-functional initiatives efficiently and impactfully.  Benefits: â\u0080¢ Competitive remuneration package â\u0080¢ Travel perks â\u0080¢ Flexible, 100% remote work culture within a small, agile team â\u0080¢ Fulfilling opportunity to shape the growth strategy of an exciting web3 company<br/><br/>Please mention the word **SMILINGLY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Anywhere",
  "salary_min": 40000,
  "salary_max": 80000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-head-of-growth-ava-foundation-1093162",
  "url": "https://remoteOK.com/remote-jobs/remote-head-of-growth-ava-foundation-1093162"
}