{
  "slug": "remote-product-engineer-zen-educate-1093291",
  "id": "1093291",
  "epoch": 1748865603,
  "date": "2025-06-02T12:00:03+00:00",
  "company": "Zen Educate",
  "company_logo": "https://remoteok.com/assets/img/jobs/5218918aecf19c76235284e053f54f121748865604.png",
  "position": "Product Engineer",
  "tags": [
    "design",
    "amazon",
    "react",
    "system",
    "frontend",
    "teacher",
    "recruiter",
    "support",
    "growth",
    "manager",
    "financial",
    "education",
    "ruby",
    "rails",
    "mobile",
    "lead",
    "operations",
    "heroku",
    "engineer",
    "engineering",
    "backend",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/5218918aecf19c76235284e053f54f121748865604.png",
  "description": "<p><b style=\"font-size: 32px;\">Product Engineer</b></p><p><b style=\"font-size: 24px;\">High level stuff you might be filtering against</b><span style=\"font-size: 24px;\"> ð\u009f\u0094\u008d</span></p><p><b>Location: </b>Remote (UK timezone +/- 6 hrs generally). In the UK we will hire you as an employee. In other countries youâ\u0080\u0099ll need to be setup as a contractor initially.</p><p><b>Type:</b> Full-time</p><p><b>Salary: </b>Location dependent. As a reference, our current range in the UK is Â£75k to Â£110k. If you will work from another location, you should map this to your equivalent market rate to be competitive. We are open to negotiation as we recognise there are different situations, but these are our general guardrails.</p><p><br></p><p><b style=\"font-size: 24px;\">What I am looking for</b></p><p>ð\u009f\u0091\u008b Hi, Iâ\u0080\u0099m <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.linkedin.com/in/martinpp/\">Martin</a>, VP of Engineering at Zen Educate and Iâ\u0080\u0099m looking for engineers who can make an impact on the real world problem of education staffing, and do it through <i>engineering excellence.</i></p><p><br></p><p>Every place has its own understanding of what engineering excellence looks like (sometimes written down, sometimes not). Hereâ\u0080\u0099s what it means to me and Zen:</p><p>â\u0080¢ Valuing real world outcomes and shared learning over output</p><p>â\u0080¢ Product thinking over pure tech - start with the problem, ship quickly and iterate.&nbsp;</p><p>â\u0080¢ Team success and sustainability over individual heroics.&nbsp;</p><p><br></p><p>We are a small, but mighty team and so every engineer has the opportunity to make an outsized impact and put their stamp on what excellence looks like in practice. What do I mean by â\u0080\u009csmallâ\u0080\u009d? Today we have 4 product teams and 24 engineers including Tech Lead Managers and Principals.</p><p><br></p><p>We recognise the world is not static - â\u0080\u009cwhat got us here, wonâ\u0080\u0099t get us thereâ\u0080\u009d - so we look for curiosity, adaptability and proactiveness as fundamental traits. The engineers I see be the most successful are those who focus on solving problems, look to help others and just happen to typically leverage technology to do so.</p><p><br></p><p>So whether youâ\u0080\u0099re passionate about building great products, scaling systems, or improving team processes, youâ\u0080\u0099ll thrive at Zen if you care deeply about users, focus on real-world outcomes, pursue continuous learning and strive to make others better ð\u009f\u0092ª</p><p><br></p><p><b style=\"font-size: 24px;\">What we are building and why</b></p><p>Getting the right teacher into the right school at the right time is a crucial problem to solve, both for education outcomes for children and for the sustainability of an industry that spends billions on this.</p><p><br></p><p>Today the platform we are building supports internal operations teams on filling roles, educators on finding roles via our mobile app and schools on getting educators in for both short-term and long-term roles. The more we develop the platform (and the ability to self-serve in the marketplace), the more efficient the whole process becomes, which means more money going back to educators and into classrooms (over Â£30 million since 2017).&nbsp;</p><p><br></p><p>We are well established in the UK and growing at a phenomenal rate in the US ð\u009f\u009a\u0080</p><p><br></p><p>What we need now is to reach the next level in how we build our platform to support this growth. Thatâ\u0080\u0099s where you come in ð\u009f\u0098\u0089</p><p><br></p><p><b style=\"font-size: 24px;\">What the role looks like in practice</b></p><p>Iâ\u0080\u0099ve written a bunch of words above that I hope capture your interest and excitement â\u009c¨. But what really matters is what <i>reality</i> looks like and the best people to share that are the existing engineers on the team. So here are a few glimpses from your potential peers of some of what they have done in a week:</p><p><br></p><p><i>â\u0080\u009cI liaised with the </i><b><i>Finance team</i></b><i> to help re-run a set of invoices that originally failed from our automated invoice service, and I helped </i><b><i>implement a feature</i></b><i> to convert a long term booking into a job role - to more accurately reflect how teachers work and track job conversions. Then I </i><b><i>shared some design feedback</i></b><i> for a booking credit system that was initially less well defined.â\u0080\u009d</i> - Jai</p><p><br></p><p><i>â\u0080\u009cI</i><b><i> implemented a compensation system</i></b><i> that will cover the additional fees for teachers, which will allow schools to book needed teachersâ\u0080\u009d</i> - Kamil</p><p><br></p><p><i>â\u0080\u009cI was </i><b><i>updating the job details view in our React Native app</i></b><i> to show more information to teachers about the school and job dates to make the job offers more attractive and useful. I also </i><b><i>upgraded our backend Rails app</i></b><i> to use latest version of Ruby, Sidekiq, Rack and Pumaâ\u0080\u009d</i> - Adrian</p><p><br></p><p><i>â\u0080\u009cI started the week by </i><b><i>pushing some small updates to our React Native app</i></b><i>, and then finished the week by shipping a feature to improve the experience of schools finding teachers and managing to </i><b><i>clean up a bunch of legacy code</i></b><i> in the process.</i>â\u0080\u009d - Chris</p><p><br></p><p><i>â\u0080\u009cI explored the feasibility of </i><b><i>using Google Document AI to extract data</i></b><i> from documents uploaded by candidates and validate them, improving automation for our onboarding process\"</i> - Lucas</p><p><br></p><p><i>â\u0080\u009cI implemented backend and frontend </i><b><i>MixPanel events for crucial workflows</i></b><i> to better understand how users interact with our product and what we can improve on.\"</i> - Georgi</p><p><br></p><p><i>â\u0080\u009cI spent some time </i><b><i>monitoring Sentry</i></b><i> to spot performance trends and debug issues. I also </i><b><i>built an automated rota in Coda</i></b><i> for our Native release process, before reviewing Product Refinement Docs and contributing to </i><b><i>shaping the solutions</i></b><i>.â\u0080\u009d</i> - Ethan</p><p><br></p><p><b style=\"font-size: 24px;\">What you might like or dislike</b><span style=\"font-size: 24px;\">&nbsp;</span></p><p>Every place makes tradeoffs based on what they value and where they are in their journey â\u009a\u0096ï¸\u008f. Hereâ\u0080\u0099s a list of things you might find useful in figuring out if this is the right role for you. If we end up chatting, feel free to dig deeper into any of them. Note that some of these are recent changes in our approach and may be â\u0080\u009cwork in progressâ\u0080\u009d when you join.</p><p><br></p><p><span style=\"font-size: 18px;\">ð\u009f\u0092» </span><b style=\"font-size: 18px;\">How We Work</b></p><p>â\u0080¢ <b>Boring tech for the obvious, experimentation for the rest.</b> Our core is Ruby on Rails, React, React Native, running on Heroku + Cloudflare etc.&nbsp; But we have also evaluated Amazon Personalise as a candidate for our matching system and spiked out our own AI powered knowledge-base.&nbsp;</p><p>â\u0080¢ <b>Process serves performance.</b> We use agile sprints and other structure to support, but our focus is on outcomes not following rules. Greater performance gives greater freedom - think â\u0080\u009cMaster your instrument, master the music, and then forget all that and just play.â\u0080\u009d</p><p>â\u0080¢ <b>Engineers as problem shapers (not ticket takers).</b> Youâ\u0080\u0099ll thrive here if you want to shape problems, not just deliver tickets. Our Product Managers and Designers are partners you pull on for leverage rather than task givers who hide the users away.</p><p>â\u0080¢ <b>Daily shipping culture</b>. We ship regularly and want to get even better at it. We are investing in this and welcome those whoâ\u0080\u0099ll help us start smaller and iterate faster.</p><p><br></p><p><span style=\"font-size: 18px;\">ð\u009f\u008c± </span><b style=\"font-size: 18px;\">Growth &amp; Progression</b></p><p>â\u0080¢ <b>Choose your own career path.</b> We care more about impact and learning than rigid competency grids. This means greater flexibility in what progression looks like, but requires you to build an understanding of what we value from guiding principles and shared real-world examples.</p><p>â\u0080¢ <b>Few Titles, infinite Levels.</b> We use Levels instead of Titles to show growth in a Role. You wonâ\u0080\u0099t see titles like Associate, Senior, or Staff here. Instead, you can grow continuously by getting better at your current role - e.g. working faster, safer, and more independently. Changing roles is possible too, but depends on business needs, since different roles aim for different business outcomes and typically use different skills.</p><p>â\u0080¢ <b>Investment over reward as a mindset.</b> Level changes are tightly coupled to compensation changes. Confidence in a Level change is based on sustainably doing great work at <i>your current level.</i> We think it is fairer to invest in what you do next, rather than reward you doing the next Level first for free!</p><p><br></p><p><span style=\"font-size: 18px;\">ð\u009f\u0092¸ </span><b style=\"font-size: 18px;\">Compensation</b></p><p>â\u0080¢ <b>Market reality.</b> Compensation is based on your competitiveness in your local hiring market (note thatâ\u0080\u0099s not just where you live). We donâ\u0080\u0099t believe anyone has found a great solution to global compensation, so we aim instead to be clear and equitable in how we do it.</p><p>â\u0080¢ <b>Solid, but not flashy compensation</b>. We pay decently, but we wonâ\u0080\u0099t beat out companies with deeper pockets (yet!).</p><p>â\u0080¢ <b>Think long term investment</b>. If you are in a place where you need to prioritise immediate financial gain then this probably isnâ\u0080\u0099t the right time to join us.</p><p><br></p><p><span style=\"font-size: 18px;\">ð\u009f¤\u009d</span><b style=\"font-size: 18px;\"> Team Culture &amp; Collaboration</b></p><p>â\u0080¢ <b>Distributed engineering team</b>. Solid communication skills and async habits are key to be effective. Youâ\u0080\u0099ll find strong connection here, but not through engineering getting together in-person. If you like the buzz of working near others you are welcome to work from one of our offices, but there wonâ\u0080\u0099t be many engineers there on any given day.</p><p>â\u0080¢ <b>We believe in impact and measurable outcomes, alongside shared learning.</b> If your work moves the needle or teaches us something meaningful then thatâ\u0080\u0099s a win. If not, then weâ\u0080\u0099ll want to understand why.&nbsp;</p><p>â\u0080¢ <b>Balanced, sustainable work. Long hours are not a badge of honour</b> - they are an indication something isnâ\u0080\u0099t working well. We value a sustainable pace and healthy teams.</p><p>â\u0080¢ <b>Diversity is good in some ways and lacking in others. </b>You might be the first of something here. That matters and weâ\u0080\u0099ll support appropriately if you are.</p><p><br></p><p><b style=\"font-size: 24px;\">How we hire</b></p><p><b>Hire fast, fix fast.</b>&nbsp; Hiring today is...not great, with most companies being too cautious and taking too long to make a decision ð\u009f\u0098¦. We move quicker - our ideal is: apply Monday, offer by Friday. Then we invest heavily in the most important part - your onboarding. We ensure you are setup for success, with clear direction, experience of different teams and shipping to production within days.</p><p><br></p><p>Whilst fast doesnâ\u0080\u0099t mean frivolous, it does slightly increase the risk that you or we made a mistake. So we include regular check-ins during onboarding to make sure expectations match reality. If either side feels something is off then we try to fix it fast. And sometimes that will mean saying â\u0080\u009cletâ\u0080\u0099s not carry onâ\u0080\u009d with respect.</p><p><br></p><p><b>Real talk. </b>We believe in being direct and authentic. Weâ\u0080\u0099ll share the good, the messy and the challenges. We recognise we wonâ\u0080\u0099t have all the answers, still have much to learn, and thatâ\u0080\u0099s all part of the fun of this wild ride ð\u009f\u009a\u0080. We expect the same from you - after all we are just a bunch of humans trying to do great work together.</p><p><br></p><p><b>Mindset, not tools.</b> We hire for how you think and create leverage, not what specific tools youâ\u0080\u0099ve used before. To us, experience is just another tool - it is only valuable through how you leverage it. Curiosity, adaptability, product thinking - those are the durable qualities in a changing world. And we value different opinions, so ensure you share yours - have a point of view, maybe debate a little and we will respect that.</p><p><br></p><p><b>Always open to great people.</b> We are always hiring and happy to chat even if the timing isnâ\u0080\u0099t quite right. Thatâ\u0080\u0099s why you might see this job post open for a long time. We are not collecting resumes or doing stealth market research, we just believe in the power of serendipity. To make that more transparent - right now we have a clear need for <b>at least 2</b> more engineers in the team.</p><p><br></p><p><b style=\"font-size: 18px;\">Okay, so what will the actual process look like?</b><span style=\"font-size: 18px;\"> ð\u009f\u0091\u0080</span></p><p>â\u0080¢ <b>Recruiter quick chat. </b>Our recruiter will check you are human, can communicate effectively and cover some of the basics like compensation, benefits and availability.</p><p>â\u0080¢ <b>Technical expertise.</b> We will do a paired session with a twist - we will be the ones sharing our screen and writing the code. So come prepared to ask questions, drive progress with another engineer and dig through an ambiguous past problem in our codebase.</p><p>â\u0080¢ <b>Product thinking. </b>Chat to either our CPTO or a Product Manager about how youâ\u0080\u0099ve demonstrated a product mindset in the past. Or if you havenâ\u0080\u0099t had opportunity to do that, tell us why and what youâ\u0080\u0099d do differently with us.&nbsp;&nbsp;</p><p>â\u0080¢ <b>Role chat.</b> This will be with me and Iâ\u0080\u0099ll be wanting to understand how you think and approach the role and engineering excellence. Iâ\u0080\u0099ll start by asking you the question you include in your application. And Iâ\u0080\u0099ll want to dig into your answers so that this becomes more of a conversation and shared exploration than a Q&amp;A session ð\u009f\u0098\u0083.&nbsp;</p><p><br></p><p>After the recruiter chat, the remaining sessions can happen in any order and as quickly as our schedules can align. You could do them all in a day if you want or spread them out a bit.</p><p><br></p><p>Once interviewers have shared their feedback from each session we do an internal debrief - thatâ\u0080\u0099s where we discuss what we are excited about you for in the role, any challenges we see and whether we think we can mitigate them at this time. From there we will make a decision and either proceed to offer or tell you that we not offering.&nbsp;</p><p><br></p><p>We believe feedback is important, but also know not everyone wants it - so we donâ\u0080\u0099t share it by default. If youâ\u0080\u0099d like feedback after the process, just let us know. Note that weâ\u0080\u0099ll frame the feedback from our perspective of why we did or did not have the confidence rather than as a commentary on you.</p><p><br></p><p><b style=\"font-size: 24px;\">Interested? Letâ\u0080\u0099s go!</b></p><p>If you read all of the above and are excited (maybe even a little nervous) about the opportunity and how we work then I recommend applying now! If you skipped or skimmed the above, feel free to apply anyway but youâ\u0080\u0099re missing a bunch of useful information that could streamline the process for you ð\u009f\u0098\u0089</p>\\n<p></p><p><br></p><p></p>\\n<br/><br/>Please mention the word **CREATIVE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "London",
  "salary_min": 70000,
  "salary_max": 122500,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-product-engineer-zen-educate-1093291",
  "url": "https://remoteOK.com/remote-jobs/remote-product-engineer-zen-educate-1093291"
}