{
  "slug": "remote-accountant-find-1093168",
  "id": "1093168",
  "epoch": 1747152031,
  "date": "2025-05-13T16:00:31+00:00",
  "company": "Find",
  "company_logo": "https://remoteok.com/assets/img/jobs/aa4170e8b79b6a16e0183cf742a8cac01747152031.png",
  "position": "Accountant",
  "tags": [
    "accountant",
    "support",
    "controller",
    "accounting",
    "financial",
    "finance",
    "microsoft",
    "management",
    "operations",
    "non tech"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/aa4170e8b79b6a16e0183cf742a8cac01747152031.png",
  "description": "<p>As part of our continued growth, we are looking for an Accountant to join our Finance team. This is an excellent opportunity for someone eager to advance their accounting career in a collaborative, fast-paced, and supportive environment.</p><p><br></p><p>As an Accountant, you will report directly to the Finance Controller and play a key role in managing accounts receivable and payable processes, maintaining accurate financial records, and supporting daily accounting operations across the Group.</p>\\n<p></p><p><br></p><b>Responsibilities</b><ul><li>Manage the full accounts receivable process, including payment follow-ups and client communication</li><li>Ensure timely and accurate invoicing and assist in resolving billing issues</li><li>Process payments and maintain accurate accounting entries (invoices, journals, reconciliations)</li><li>Support the preparation of management accounts and financial statements</li><li>Assisting in the implementation and ongoing management of procurement requests through the companyâ\u0080\u0099s procurement tool</li><li>Assist in the preparation of monthly and annual reports</li><li>Support internal and external audits with documentation and schedules</li><li>Contribute to the completion and submission of local VAT returns</li><li>Prepare various account reconciliations</li><li>Provide general accounting support and other duties as assigned</li></ul><p><br></p><b>Requirements</b><ul><li>A partly qualified accountant or a degree in Accountancy&nbsp;</li><li>2+ years of experience in a similar role</li><li>Good knowledge of accounting principles and reporting practices</li><li>Familiarity with IFRS and Maltese tax/VAT regulations</li><li>Strong proficiency in Microsoft Excel</li><li>Experience with Xero and/or QuickBooks is an asset</li><li>Experience in the iGaming sector is a plus</li></ul><p><br></p><p></p>\\n<br/><br/>Please mention the word **OUTSTRIP** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Sliema",
  "salary_min": 25000,
  "salary_max": 65000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-accountant-find-1093168",
  "url": "https://remoteOK.com/remote-jobs/remote-accountant-find-1093168"
}