{
  "slug": "remote-english-language-data-annotator-transperfect-1093234",
  "id": "1093234",
  "epoch": 1748217712,
  "date": "2025-05-26T00:01:52+00:00",
  "company": "TransPerfect",
  "company_logo": "",
  "position": "English Language Data Annotator",
  "tags": [
    "react",
    "teach",
    "training",
    "legal",
    "recruitment",
    "full-time",
    "non tech"
  ],
  "description": "<p><strong>Work Location:</strong> Alberta; remote</p><p><strong>Work Schedule:</strong> Full-time (40 hours/week), Monday â\u0080\u0093 Friday; business hours</p><p><strong>Engagement Model:</strong> Employment; fixed term/temporary</p><p><strong>Start Date:</strong> Immediate</p><p><strong>Project duration:</strong> Until September 2025</p><p></p><p>DataForce by TransPerfect is currently looking for a <strong>Language Data Annotator</strong> with idiomatic fluency in English to join our team in Canada! This is an exciting opportunity to be part of an innovative project to improve Artificial Intelligence and technology.</p><p></p><p>This role requires a high level of independence, adaptation, and accuracy â\u0080\u0093 love of attention to detail will help to succeed in this role!</p><p></p><p><strong>Role Summary:</strong></p><p>The Language Data Annotator will analyze data in English language and identify potential issues. This data will be used to develop and improve the capabilities of Artificial Intelligence systems.</p><p></p><p><em>No previous experience or training in the field is required - we will teach you all you need to know.</em></p><p></p><p><strong>Role Responsibilities:</strong></p><ul><li><p>Classify and label information</p></li><li><p>Meet daily quality standards</p></li><li><p>To have flexibility, ability to adapt and react to changing priorities quickly and efficiently</p></li><li><p>Track, analyze, and report issues</p></li><li><p>Listen to audio clips in English, identify and describe the underlying feelings and emotions in English</p></li><li><p>Meet daily Key Performance Indexes (KPIs) as defined by management/supervisor</p></li><li><p>Complete all other tasks that are deemed appropriate for the role and assigned by the manager/supervisor.</p></li></ul><p></p><br /><ul><li><p>Eligible to work in Canada</p></li><li><p>Excellent listening, writing, and spelling skills in English</p></li><li><p>Must be of legal age (18+)</p></li><li><p>Located in Alberta</p></li><li><p>Detail-oriented and comfortable with repetitive tasks</p></li><li><p>Good oral and written communication skills, with problem-solving abilities</p></li><li><p>Excellent time management</p></li><li><p>Minimum bachelor's degree or equivalent professional experience</p></li><li><p>Must have access to a computer and a headset to perform job duties</p></li></ul><p></p><p><em>DataForce by TransPerfect is part of the TransPerfect family of companies, the worldâ\u0080\u0099s largest provider of language and technology solutions for global business, with offices in more than 100 cities worldwide.</em></p><p><em>We offer high-quality data for Human-Machine Interaction to some of the most prestigious technology companies in the world. Our department focuses on gathering, enriching and processing data for Machine Learning in different AI domains.</em></p><p><em>To learn more about DataForce please visit us at <a href=\"https://www.transperfect.com/dataforce\">https://www.transperfect.com/dataforce</a></em></p><p></p><p><em>TransPerfect is an equal opportunity employer and committed to all recruitment processes and workplace free from harassment, sexual harassment and discrimination.<br />For more information on the TransPerfect Family of Companies, please visit our website at <a href=\"http://www.transperfect.com/\">www.transperfect.com</a>.</em></p><p></p><br/><br/>Please mention the word **RESPONSIVE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 60000,
  "salary_max": 105000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-english-language-data-annotator-transperfect-1093234",
  "logo": "",
  "url": "https://remoteOK.com/remote-jobs/remote-english-language-data-annotator-transperfect-1093234"
}