{
  "slug": "remote-video-editor-and-content-creator-ritual-1093277",
  "id": "1093277",
  "epoch": 1748581202,
  "date": "2025-05-30T05:00:02+00:00",
  "company": "Ritual",
  "company_logo": "https://remoteok.com/assets/img/jobs/de598e7f7ed4b518451a6a508e39f66d1748581203.png",
  "position": "Video Editor and Content Creator",
  "tags": [
    "technical",
    "support",
    "test",
    "growth",
    "web",
    "voice",
    "video",
    "ads",
    "content",
    "marketing",
    "legal",
    "health",
    "e-commerce"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/de598e7f7ed4b518451a6a508e39f66d1748581203.png",
  "description": "<p><b style=\"font-size: 11pt;\">About Ritual</b></p><p>Ritual is a personal health brand that is building the future of daily essentials. Our mission is simple: we help turn healthy habits into a Ritual. We started by creating the first visible supply chain of its kind and reinventing the daily multivitamin from the ground up. Now, together with some of the worldâ\u0080\u0099s leading scientists, researchers and advisors, weâ\u0080\u0099re developing a new standard of high-quality, traceable daily products across new categories. Hundreds of thousands of customers across generations trust us, and we are growing quickly.&nbsp;</p><p><span style=\"font-size: 11pt;\">&nbsp;</span></p><p>Weâ\u0080\u0099ve built a team of over 120 (and counting) curious skeptics, world-class scientists, unconventional artists, expert marketers, and analytical strategists. Weâ\u0080\u0099re venture-backed and based in sunny Los Angeles. If youâ\u0080\u0099re looking to challenge the status quo and be challenged to do the best work of your career, join us.</p><p><br></p><p><b style=\"font-size: 10pt;\">Essential</b></p><p><span style=\"font-size: 10pt;\">Ritual is looking for a </span><b style=\"font-size: 10pt;\">Video Editor &amp; Content Creator</b><span style=\"font-size: 10pt;\"> with strong technical skills and an obsession for visual storytelling. You will be responsible for producing high-quality short-form video content for paid and organic social, with a focus on delivering high-yield results. Your work will directly contribute to driving engagement, conversions, and overall campaign success across platforms like Instagram, TikTok, Meta, and Amazon.&nbsp;</span></p>\\n<p></p><p><br></p><b>What You'll Do:</b><ul><li>Produce short-form ads and native content by editing influencer, UGC, and professional footage with motion graphics and audio for various web and social platforms.</li><li>Shoot video footage with product and/or talent as needed to support overall marketing efforts.&nbsp;</li><li>Work with growth marketing partners to brainstorm concepts, create and test ads, and identify iteration opportunities based on performance data.</li><li>Collaborate with creative and brand marketing partners to bring brand assets to life across organic social, site, and more.</li><li>Manage multiple video projects simultaneously while ensuring deadlines are met.</li><li>Organize and maintain video files, project assets, and media libraries for easy access.</li><li>Attend relevant weekly, biweekly, and monthly marketing and creative meetings.</li><li>Ensure all content aligns with our brand voice and style across all platforms.</li></ul><p><br></p><b>Who You Are:</b><ul><li><b>Growth-minded.</b> You understand growth marketing and how to create branded content that performs and feels native to its platform without compromising brand identity</li><li><b>Resourceful. </b>Youâ\u0080\u0099re flexible in thinking and making from finding new ways to edit existing content or creating your own footage to tell compelling stories for the brand</li><li><b>Plugged-in. </b>You're up-to date with best practices and obsessed with trends in advertising and content on social media platforms&nbsp;</li><li><b>Self-starter. </b>You're comfortable working with a remote team because youâ\u0080\u0099ve got people skills</li><li><b>Storyteller. </b>Making visual stories gives you a high, and you love innovating on new ways to do this</li></ul><p><br></p><b>What You Need:</b><ul><li>3+ years of experience in Adobe Premiere</li><li>Experience with Adobe After Effects and Adobe Photoshop, incorporating &amp; modifying graphics from templates</li><li>Proven video editing and content creation experience in a portfolio featuring short-form video content for ads, social media, and e-commerce platforms</li><li>Storytelling ability to find or create narratives</li><li>Attention to detail, strong communication, and collaboration skills</li><li>A working knowledge of media management, encoding, audio mastering, color correction</li><li>Experience working with a legal or regulatory team</li><li>Experience with lighting or prop/product styling</li><li>Willingness to be featured in social or ad content</li><li>Interest in Ritualâ\u0080\u0099s mission for womenâ\u0080\u0099s health</li><li>Experience with an acquisition environment and an understanding of direct-to-consumer (D2C) business metrics (CPA, KPI, etc.)</li></ul><p><br></p><b>Compensation and Benefits:</b><ul><li>Pay Range:&nbsp;&nbsp;$70,000 - $110,000</li><li>Your base salary is one part of your total compensation package. The salary range represents the entire compensation range for this position. Exact compensation will depend on a number of factors, which may include the successful candidate's skills, level, years of experience, technical expertise, and other qualifications. Not all candidates will be eligible for the upper end of the salary range. This role is also eligible for equity + generous benefits + 401k + unlimited PTO etc - see our list of perks/ benefits below.</li></ul><p><br></p><b>Additional Compensation, Benefits and Perks:</b><ul><li>401k Match - Up to 4%</li><li>Medical/Dental/Vision/Life Insurance</li><li>Healthcare &amp; Dependent Care FSA</li><li>Equity participation in the form of stock options</li><li>12 weeks of Parental Leave after 180 days of employment, or 20 weeks of Parental Leave after 1 year of service, and up to 4 weeks of Flex Time for birthing parents upon return from Leave</li><li>Talkspace access for mental health support&nbsp;</li><li>Pet Insurance discount</li><li>Non-accrual and flexible PTO (10 days minimum)</li><li>18 paid company holidays + additional days for extended weekends.&nbsp;</li><li>10 Wellness Days (Final Friday of each month)</li><li>2 Days to volunteer (Days of Action)</li><li>Focus Fridays (used for self-development, heads-down work, community group meetings and 1:1TBs)</li><li>Free Ritual subscription during your time with us</li><li>Maven Clinic Family Planning platform</li><li>Annual Wellness stipend</li><li>Monthly Childcare Allowance</li><li>Technology Allowance</li><li>New hire Work from Home stipend</li><li>Bi-Annual Performance Reviews</li><li>Bi-Annual in-person company events</li><li>Monthly wellness activities&nbsp;</li></ul><p><br></p><p></p>\\n<p><b>Why Ritual?</b></p><p>Since launching in October 2016, Ritual has grown to be a cultural revolution in the health industry. Weâ\u0080\u0099re not about pseudoscience, half-truths or health fads. We are simple, effective, and backed by real science. </p><p><br></p><p><br></p><p><i>Ritual is an Equal Opportunity Employer. We are committed to bringing together humans from different backgrounds and perspectives, providing employees with a safe and welcoming work environment free of discrimination and harassment. We strive to create a diverse &amp; inclusive environment where everyone can thrive, feel a sense of belonging, and do impactful work together.</i></p><p><br></p><p>California Residents: <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://d3tgv297hi4yx8.cloudfront.net/privacy-notices/Ritual%20CPRA%20HR%20Privacy%20Notice%20-%20CA%20Job%20Candidates.pdf\">Privacy Notice for California Job Applicants</a></p><br/><br/>Please mention the word **ADVANTAGEOUS** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Remote",
  "salary_min": 55000,
  "salary_max": 80000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-video-editor-and-content-creator-ritual-1093277",
  "url": "https://remoteOK.com/remote-jobs/remote-video-editor-and-content-creator-ritual-1093277"
}