{
  "slug": "remote-spanish-speaking-software-support-engineer-payara-1093246",
  "id": "1093246",
  "epoch": 1748250318,
  "date": "2025-05-26T09:05:18+00:00",
  "company": "Payara",
  "company_logo": "https://remoteOK.com/assets/img/jobs/de798d52279aab4c8c4c19472b27e04c1748250318.png",
  "position": "Spanish Speaking Software Support Engineer",
  "tags": [
    "dev",
    "engineer",
    "java"
  ],
  "logo": "https://remoteOK.com/assets/img/jobs/de798d52279aab4c8c4c19472b27e04c1748250318.png",
  "description": "<p>As aÂ <strong>Frontline Software Support Engineer</strong>, youâ\u0080\u0099ll be responsible for working as the first line specialised technical support for all Payara Platform users. You will work closely with our customers at both high-level (architecture, software maintenance, security) and low-level (configuration, code review, troubleshooting) to guarantee successful businesses.</p><p>Please visit www.payara.fish/joinus for more details.</p><p>Check out our culture page on Instagram @payaraculture</p><p><strong>Summary Details</strong></p><p>Role:Â <strong>Frontline Software Support Engineer</strong></p><p>Senior: Junior</p><p>Location: EMEA/South America/Asia (100% Remote)</p><p>Compensation: Rate dependent on local market location and experience</p><p><strong>Responsibilities</strong></p><ul><li>Provide specialised technical support to Payara Platform users.</li><li>Document resolutions and solutions on the internal Payara systems.</li><li>Work with expert engineers to resolve challenging issues in high-level areas (architecture, security reviews, performance tuning) and assist product management in identifying new features that might benefit users in general.</li><li>Support open-source community by actively engaging in technical discussions on external platforms.</li><li>Assists with the onboarding and offboarding of customers.</li></ul><p><br />Â </p><p><strong>Essential Skills &amp; Experience</strong></p><ul><li>1+ years of Java development experience</li><li>Basic knowledge and experience using Apache Maven</li><li>Demonstrates a basic understanding of web server operations and core principles of application development.</li><li>Proficiency in both written and verbal English communication; other languages will be an added advantage</li></ul><p><strong>Desirable Skills &amp; Knowledge</strong></p><ul><li>Previous experience working in software technical support.</li><li>Experience in Java / Jakarta EE Middleware application development and maintenance (e.g., Payara, Glassfish, WebSphere, JBoss, WebLogic, etc.) or application development using Spring Framework or similar environments.</li><li>Experience with DevOps technologies such as Docker, Kubernetes, and Jenkins, along with hands-on usage of cloud platforms including AWS, Azure, and Google Cloud Platform (GCP).</li></ul><p><strong>Personal Skills &amp; Behaviours</strong></p><ul><li>Excellent problem solving and analytical skills.</li><li>Team player with strong communication skills</li><li>Ability to think, learn and adapt quickly in challenging situations.</li><li>Effectively collaborates with other colleagues and ensures client satisfaction.</li><li>Commitment to continuous learning, actively seeking opportunities to expand knowledge and stay updated with industry trends and new technologies.</li><li>Strong customer focus, dedicated to understanding client needs and delivering satisfaction.</li></ul><p><strong>Essential Qualifications</strong></p><ul><li>Qualifications in Computer Science, Software Engineering or related field.</li></ul><p><em>We are an equal opportunities employer. If you require reasonable adjustments due to a disability, please raise this when invited to an interview, stating the adjustments needed.</em></p><p><em>Please see our company (Recruitment) Privacy statement available atÂ </em><em>www.payara.fish</em></p><br/><br/>Please mention the word **STAUNCHLY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 10000,
  "salary_max": 30000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-spanish-speaking-software-support-engineer-payara-1093246",
  "original": true,
  "url": "https://remoteOK.com/remote-jobs/remote-spanish-speaking-software-support-engineer-payara-1093246"
}