{
  "slug": "remote-ux-designer-ii-zeta-1093268",
  "id": "1093268",
  "epoch": 1748520035,
  "date": "2025-05-29T12:00:35+00:00",
  "company": "Zeta",
  "company_logo": "https://remoteok.com/assets/img/jobs/8e9a9ee14b1501f375aeb974a7c700931748520035.png",
  "position": "UX Designer II",
  "tags": [
    "ux",
    "design",
    "front-end",
    "designer",
    "support",
    "banking",
    "senior",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/8e9a9ee14b1501f375aeb974a7c700931748520035.png",
  "description": "<p><b style=\"font-size: 16px;\">All about Zeta Suite : </b></p><p><br></p><p><span style=\"font-size: 16px;\">Zeta is a </span><b style=\"font-size: 16px;\">Next-Gen Banking Tech</b><span style=\"font-size: 16px;\"> company that empowers banks and fintechs to launch banking products for the future. It was founded by </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 16px;\" href=\"https://en.wikipedia.org/wiki/Bhavin_Turakhia\">Bhavin Turakhia</a><span style=\"font-size: 16px;\"> and Ramki Gaddipati in 2015.Our flagship processing platform - Zeta Tachyon - is the industryâ\u0080\u0099s first modern, cloud-native, and fully API-enabled stack that brings together issuance, processing, lending, core banking, fraud &amp; risk, and many more capabilities as a single-vendor stack. 15M+ cards have been issued on our platform globally.</span></p><p><br></p><p><span style=\"font-size: 16px;\">Zeta Tachyon offers:-</span></p><p><span style=\"font-size: 16px;\">-Rich digital-first cardholder experiences.</span></p><p><span style=\"font-size: 16px;\">-Native embeddable banking support.</span></p><p><span style=\"font-size: 16px;\">-Hyper-Personalisation Policy Engine to launch segment-of-one card programs.</span></p><p><span style=\"font-size: 16px;\">-Web-based product configurators to launch in days vs. quarters.</span></p><p><span style=\"font-size: 16px;\">-Rapid innovation &amp; extensibility via APIs, event streams, and more.</span></p><p><span style=\"font-size: 16px;\">-Modern &amp; intuitive web-based back office experiences.</span></p><p><span style=\"font-size: 16px;\">-Next-gen regulatory risk &amp; compliance capabilities.</span></p><p><br></p><p><span style=\"font-size: 16px;\">Zeta is actively working with the largest Banks and Fintechs in multiple global markets transforming customer experience for multi-million card portfolios.</span></p><p><br></p><p><span style=\"font-size: 16px;\">Zeta has over </span><b style=\"font-size: 16px;\">1700+</b><span style=\"font-size: 16px;\"> employees - with over </span><b style=\"font-size: 16px;\">70%</b><span style=\"font-size: 16px;\"> roles in R&amp;D - across locations in the </span><b style=\"font-size: 16px;\">US</b><span style=\"font-size: 16px;\">, </span><b style=\"font-size: 16px;\">EMEA</b><span style=\"font-size: 16px;\">, and </span><b style=\"font-size: 16px;\">Asia</b><span style=\"font-size: 16px;\">. We raised </span><b style=\"font-size: 16px;\">$280 million</b><span style=\"font-size: 16px;\"> at a </span><b style=\"font-size: 16px;\">$1.5 billion</b><span style=\"font-size: 16px;\"> valuation from Softbank, Mastercard, and other investors in 2021.</span></p><p><span style=\"font-size: 16px;\">Learn more @ </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 16px;\" href=\"http://www.zeta.tech/\">www.zeta.tech</a><span style=\"font-size: 16px;\">, </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 16px;\" href=\"https://careers.zeta.tech/\">careers.zeta.tech</a><span style=\"font-size: 16px;\">, </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 16px;\" href=\"https://in.linkedin.com/company/zetasuite\">Linkedin</a><span style=\"font-size: 16px;\">, </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 16px;\" href=\"https://twitter.com/zetasuite\">Twitter</a></p>\\n<p></p><p><br></p><b>About the Role</b><ul><li>UX Designer II assists in creating user-centered design solutions, contributing to wireframes, prototypes, and high-fidelity designs. They collaborate with cross-functional teams, apply user-centered design principles, and support the development of visually appealing and intuitive interfaces under the guidance of senior designers.</li></ul><p><br></p><b>Responsibilities</b><ul><li><b>Supporting Design Leadership: </b>Collaborate with design leadership to contribute to the creation of world-class interaction designs, offering assistance from initial concept ideation through the entire design process up to the product shipping stage.</li><li><b>Solving Complex Design Problems: </b>Tackle intricate design challenges by crafting solutions that are both simple and intuitive. Integrate brand personality, visual elements, motion, and sound to craft delightful user experiences that align with the overall product or service goals.</li><li><b>Utilizing User Research Data: </b>Leverage user research data and insights to inform and assess design solutions. Ensure that design decisions align with user goals and expectations, creating experiences that resonate with the target audience.</li><li><b>Producing Design Visualizations: </b>Generate various design visualizations, including storyboards, flows, wireframes, prototypes, and vision pieces. These visualizations serve as communication tools to convey and articulate the envisioned user experience to stakeholders.</li><li><b>Collaboration with Cross-Functional Teams: </b>Work closely and collaboratively with product management, fellow designers, and engineers throughout the design process. Iterate on designs based on feedback and contribute to the seamless delivery of well-executed solutions.</li><li><b>Advocating for Design Solutions: </b>Advocate for design solutions by aligning them with both business objectives and user goals. Clearly communicate the rationale behind design decisions to ensure a shared understanding among team members and stakeholders.</li><li><b>Self-Direction and Self-Management: </b>Demonstrate self-direction and the ability to self-manage. Take initiative in driving design tasks forward, meeting deadlines, and ensuring the overall progress of design projects.</li></ul><p><br></p><b>Skills</b><ul><li><b>Strong Portfolio:</b> A robust portfolio showcasing exceptional UX skills, including comprehensive examples of wireframes, prototypes, high-fidelity designs, and animations. The portfolio should reflect a diverse range of projects and demonstrate proficiency in various aspects of UX design</li><li><b>Knowledge of Visual Design:</b> A solid understanding of visual design principles, encompassing aspects such as layout, color theory, typography, and composition. This knowledge contributes to creating visually appealing and cohesive user interfaces.</li><li><b>Proficient in Lottie Animation:</b> Proficiency in creating animations from scratch using Lottie, showcasing the ability to add dynamic and engaging elements to user interfaces. This skill enhances the overall user experience through interactive and visually appealing animations.</li><li><b>User-Centered Design Principles: </b>Strong familiarity with user-centered design principles and methodologies. This includes a deep understanding of user research, personas, usability testing, and iterative design processes to ensure designs meet user needs and expectations.</li><li><b>Collaboration and Communication Skills:</b> Excellent collaboration and communication skills, essential for effectively working within cross-functional teams. The ability to articulate design decisions and rationale helps in fostering a shared understanding among team members.</li><li><b>Adaptability to a Fast-Paced Environment:</b> Ability to thrive in a fast-paced environment and manage multiple projects simultaneously. This skill enables the designer to meet tight deadlines, adapt to changing requirements, and deliver high-quality work within specified timelines.</li><li><b>Effective Cross-Functional Collaboration:</b> Capability to collaborate effectively with cross-functional teams, including product managers, developers, and other stakeholders. This ensures a cohesive and collaborative approach to achieving project goals.</li><li><b>Big-Picture Decision-Making: </b>Ability to see the big picture when making design decisions. This involves considering the broader context of a project, understanding overarching goals, and making decisions that align with the overall vision and strategy.</li><li><b>Familiarity with Digital Devices and Platforms:</b> Awareness of the capabilities and constraints of various digital devices and platforms. This knowledge is crucial for designing experiences that are optimized for different devices and ensuring a seamless user experience across multiple platforms.</li></ul><p><br></p><b>Experience and Qualifications</b><ul><li>1+ year of experience in B2B2C design.&nbsp;</li><li>Bachelor's degree in Design, HCI, or a related field.&nbsp;</li><li>Having experience working for a product/ organization based in the United States is a plus.</li><li>Experience in prototyping or front-end development</li><li>Experience using design tools such as Figma, Lottie, and Adobe Creative Suite</li></ul><p><br></p><p></p>\\n<p><b style=\"font-size: 16px;\">Life At Zeta</b></p><p><br></p><p><span style=\"font-size: 16px;\">At Zeta, we want you to grow to be the best version of yourself by unlocking the great potential that lies within you. This is why our core philosophy is </span><b style=\"font-size: 16px;\">â\u0080\u0098People Must Grow.â\u0080\u0099</b><span style=\"font-size: 16px;\"> We recognize your aspirations; act as enablers by bringing you the right opportunities, and let you grow as you chase disruptive goals.&nbsp;</span></p><p><br></p><p><br></p><p><b style=\"font-size: 16px;\">#LifeAtZeta is adventurous and exhilarating at the same time. </b><span style=\"font-size: 16px;\">You get to work with some of the best minds in the industry and experience a culture that values the diversity of thoughts. If you want to push boundaries, learn continuously and grow to be the best version of yourself,&nbsp; </span><b style=\"font-size: 16px;\">Zeta is the place to be!&nbsp; </b><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 16px;\" href=\"https://careers.zeta.tech/\">Explore the life at zeta&nbsp;</a></p><p><br></p><p><b style=\"font-size: 16px;\">Zeta is an equal opportunity employer.&nbsp;&nbsp;</b></p><p><br></p><p><span style=\"font-size: 16px;\">At Zeta, we are committed to equal employment opportunities regardless of job history, disability, gender identity, religion, race, marital/parental status, or another special status. We are proud to be an equitable workplace that welcomes individuals from all walks of life if they fit the roles and responsibilities.</span></p><br/><br/>Please mention the word **REASONABLE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Bangalore",
  "salary_min": 120000,
  "salary_max": 150000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-ux-designer-ii-zeta-1093268",
  "url": "https://remoteOK.com/remote-jobs/remote-ux-designer-ii-zeta-1093268"
}