{
  "slug": "remote-principal-devsecops-engineer-second-front-systems-1093284",
  "id": "1093284",
  "epoch": 1748696414,
  "date": "2025-05-31T13:00:14+00:00",
  "company": "Second Front Systems",
  "company_logo": "https://remoteok.com/assets/img/jobs/4dd5c5d5fc9690382be25b85a31c083d1748696414.png",
  "position": "Principal DevSecOps Engineer",
  "tags": [
    "saas",
    "security",
    "game",
    "support",
    "software",
    "code",
    "cloud",
    "strategy",
    "operations",
    "go",
    "golang",
    "health",
    "engineer"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/4dd5c5d5fc9690382be25b85a31c083d1748696414.png",
  "description": "<p><b>ABOUT THE ROLE</b></p><p><br></p><p>Second Front Systems (2F) is seeking an ambitious and visionary Principal DevSecOps Engineer to join our mission-driven team. We are a dynamic, fast-growing entrepreneurial company at the intersection of cutting-edge technology and national security, committed to delivering transformative solutions that empower our nationâ\u0080\u0099s defenders. This is an opportunity to play a pivotal role in shaping the future of a company that is redefining the way software is delivered and secured in the defense sector.</p><p><br></p><p>At 2F, we thrive on innovation and purpose, combining a startupâ\u0080\u0099s agility with a clear mission to support national security. You will be at the forefront of driving the DevSecOps strategy behind the deployment and scaling of our revolutionary Game Warden platformâ\u0080\u0094an industry-leading tool that is accelerating the secure adoption of mission-critical SaaS solutions for the U.S. government. If youâ\u0080\u0099re ready to contribute to a team that values ingenuity, collaboration, and impact, we want to hear from you.</p><p><br></p><p><b>Note:</b> This position requires U.S. citizenship due to government contract requirements.</p>\\n<p></p><p><br></p><b>What Youâ\u0080\u0099ll Do</b><ul><li>Architect and implement scalable, secure cloud infrastructure using Kubernetes and Pulumi (Go-based), ensuring compliance with DoD and IC requirements.</li><li>Support the security and operations of the 2F Suite across air-gapped and classified environments, working directly with government partners and security teams.</li><li>Build and manage CI/CD pipelines integrating DevSecOps best practices from development through deployment. </li><li>Integrate and maintain SIEM and security tooling, ensuring observability and compliance across all deployed systems.</li><li>Design, develop, and debug microservices in Go (Golang), focusing on performance, security, and modularity.</li><li>Work cross-functionally to assess infrastructure needs, prioritize development, and deliver on product roadmap milestones in a fast-paced Agile environment.</li><li>Document your work thoroughlyâ\u0080\u0094from infrastructure to internal proceduresâ\u0080\u0094to ensure secure, repeatable, and auditable deployments.</li><li>Collaborate directly with DoD/IC stakeholders to provision secure cloud resources and meet deployment criteria in classified settings.</li><li>Contribute to R&amp;D and experimentation efforts needed to advance platform and&nbsp;capabilities in secure and disconnected environments.</li><li>Act as a mentor and thought leader, helping to shape internal DevSecOps strategy and infrastructure standards.</li></ul><p><br></p><b>Skills Youâ\u0080\u0099ll Bring to Our Team</b><ul><li>8+ years of relevant experience in DevSecOps, systems engineering, or infrastructure software development.</li><li>Architect-level expertise in designing and operating cloud-native platforms using AWS, Azure, or GCP.</li><li>Deep experience with Kubernetes, Docker, and cloud-native application orchestration.</li><li>Strong proficiency in Golang or similar languages (e.g., Rust), particularly with infrastructure as code (Pulumi preferred.)</li><li>Familiarity with compliance frameworks such as FedRAMP, DoD SRG, NIST 800-53, and the RMF/ATO process.</li><li>Proven experience deploying systems in air-gapped or classified environments.</li><li>Experience building and maintaining secure CI/CD pipelines and integrating security throughout the SDLC.</li><li>Hands-on experience designing, implementing, or managing SIEM, monitoring, and alerting systems.</li><li>Understanding of REST APIs, authentication flows, event-driven architecture, and microservice patterns.</li><li>Excellent written and verbal communication skills, with strong documentation habits.</li><li>Comfortable working independently and in distributed teams, managing competing priorities across complex projects.</li></ul><p><br></p><b>Preferred Qualifications</b><ul><li>Certified AWS or Azure Solutions Architect. </li><li>Experience working in early-stage or high-growth startup environments</li><li>DoD 8570/8140 compliant IAT2 (or willingness to obtain compliance within 3 months of hire)</li><li>Familiarity with GitLab, Google Workspace, and Slack</li><li>Strong interest in U.S. national security and mission-driven innovation</li><li>Expertise in control frameworks such as NIST RMF and FedRAMP</li></ul><p><br></p><p></p>\\n<div>$225,000 - $250,000 a year</div><small><div><span style=\"font-size: 13.3333px;\">The base compensation for this role is $225,000- $250,000.</span></div></small>\\n<p><span style=\"font-size: 16pt;\">Perks &amp; Benefits</span></p><p><br></p><p><span style=\"font-size: 11pt;\">This role is full-time.&nbsp; As a public benefit corporation, weâ\u0080\u0099re a team of purpose-driven trailblazers transforming the future of U.S. national security. We hire the best to do their best and, as such, we are committed to providing the perks and benefits you need to be successfulâ\u0080\u0094both in and outside the workplace.</span></p><p><br></p><p><span style=\"font-size: 11pt;\">We offer you:</span></p><p><br></p><p><span style=\"font-size: 11pt;\">-Competitive Salary</span></p><p><span style=\"font-size: 11pt;\">-100% Healthcare, vision, and dental coverage</span></p><p><span style=\"font-size: 11pt;\">-401(k) + 3% company contribution</span></p><p><span style=\"font-size: 11pt;\">-Wellness perks (Fitness classes, mental health resources)</span></p><p><span style=\"font-size: 11pt;\">-Equity incentive plan</span></p><p><span style=\"font-size: 11pt;\">-Tech + office supplies stipend</span></p><p><span style=\"font-size: 11pt;\">-Annual professional development stipend</span></p><p><span style=\"font-size: 11pt;\">-Flexible paid time off + federal holidays off</span></p><p><span style=\"font-size: 11pt;\">-Parental leave</span></p><p><span style=\"font-size: 11pt;\">-Work from anywhere</span></p><p><br></p><p><span style=\"font-size: 11pt;\">Referral Bonus: Visit our&nbsp;</span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 11pt;\" href=\"https://www.secondfront.com/company/careers\">careers page</a><span style=\"font-size: 11pt;\">&nbsp;to learn more.</span></p><p><br></p><p><b><span style=\"font-size: 18px\">WHO WE ARE</span></b></p><p><br></p><p><span style=\"font-size: 16px\">At Second Front Systems (2F), we equip defense and national security professionals for long-term, continuous competition for access to emerging technologies. Founded by two former U.S. Marines with firsthand experience of the dangers outdated technology poses in combat, our team is dedicated to fast-tracking government access to disruptive, commercially-proven technology for U.S. national security missions.&nbsp;</span></p><p><br></p><p><span style=\"font-size: 16px\">Our&nbsp;</span><a class=\"postings-link\" href=\"https://www.secondfront.com/game-warden\"><span style=\"font-size: 16px\">Game Warden</span></a><span style=\"font-size: 16px\">&nbsp;product, a fully managed and compliant DevSecOps platform, accelerates the process for accrediting software as a service (SaaS) applications for government use.</span></p><p><br></p><p><span style=\"font-size: 16px\">Learn how 2F can help you make an impact on national security missions at&nbsp;</span><a class=\"postings-link\" href=\"http://www.secondfront.com/\"><span style=\"font-size: 16px\">www.secondfront.com</span></a></p><p><br></p><p><b><span style=\"font-size: 18px\">ONE LAST THINGâ\u0080¦</span></b></p><p><br></p><p><span style=\"font-size: 16px\">We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law.</span></p><br/><br/>Please mention the word **PERSEVERE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Remote",
  "salary_min": 45000,
  "salary_max": 77500,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-principal-devsecops-engineer-second-front-systems-1093284",
  "url": "https://remoteOK.com/remote-jobs/remote-principal-devsecops-engineer-second-front-systems-1093284"
}