{
  "slug": "remote-full-stack-engineer-medialab-1093223",
  "id": "1093223",
  "epoch": 1748030401,
  "date": "2025-05-23T20:00:01+00:00",
  "company": "MediaLab",
  "company_logo": "https://remoteok.com/assets/img/jobs/2256d30c18f5cd5aa38668169e51f1281748030402.png",
  "position": "Full Stack Engineer",
  "tags": [
    "design",
    "react",
    "front-end",
    "frontend",
    "security",
    "music",
    "full-stack",
    "technical",
    "transcribe",
    "code",
    "ruby",
    "rails",
    "reliability",
    "engineer",
    "engineering",
    "backend",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/2256d30c18f5cd5aa38668169e51f1281748030402.png",
  "description": "<p>MediaLab is a media &amp; technology company focused on acquiring and growing properties and global brands. The organization is a unique combination of private equity, holding company and operating entity. We continue to expand and are proud of the prominent market position of our brands.&nbsp;&nbsp;</p><p><br></p><p>Come join an exceptionally talented team of engineers, designers, product and business builders.&nbsp;HQ is located in sunny Santa Monica, California with growing teams in New York, and across cities in the US and Latin America.</p><p><br></p><p><span style=\"font-size: 11pt;\">Genius is looking for a remote Full-stack Engineer to help build the ultimate music companion, enabling fans to collaboratively transcribe lyrics and write annotations that live on </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 11pt;\" href=\"http://Genius.com\">Genius.com</a><span style=\"font-size: 11pt;\"> and everywhere people experience music. Weâ\u0080\u0099re looking for makers with a sophisticated code sense: folks whoâ\u0080\u0099ve built cool things, but who can also maintain and scale those things, and who feel at home deep in the guts of a library.</span></p><p><br></p><p><span style=\"font-size: 11pt;\">As a Full-stack Engineer for Genius, you will play a key role in building the website, helping us deliver on the next generation of product features. You will work across our frontend and backend to delight our users, improve site performance, and increase user retention, ensuring the success of the Genius business. Additionally, youâ\u0080\u0099ll work to improve the stability, reliability and security posture of Geniusâ\u0080\u0099 services, which is no small feat for a website serving millions of users daily!</span></p>\\n<p></p><p><br></p><b>What You'll Do</b><ul><li>Build and ship high-quality site features, working with a Rails backend and a React front-end</li><li>Proactively identify and fix infrastructure bottlenecks to scale backend services to tens of thousands of requests per minute</li><li>Work with product design team to build rich, intuitive user experiences in the browser</li><li>Architect database query patterns and migrations that scale to large tables with 1B+ rows</li><li>Take ownership over the features you build, proactively identifying and surfacing UX, performance and maintainability improvements</li><li>During your on-call rotation, be the backstop for site quality, stability, and performance. Triage incoming issues to find the most urgent problems, and handle emergent incidents to keep the site online.</li><li>Work directly with stakeholders to uncover and address business needs, including product owners, designers and other engineers across the company</li></ul><p><br></p><b>What We're Searching For</b><ul><li>Proficiency with a â\u0080\u009cbatteries-includedâ\u0080\u009d backend framework like Ruby on Rails (or similar). Candidates should be comfortable working with large, established codebases, and have an understanding of architectural patterns necessary to build APIs at scale</li><li>Experience building user-friendly interfaces using a modern, component-based front-end framework (React, Vue, Angular, etc). including proficiency in state management, end-to-end testing, and CSS-in-JS.</li><li>Proficiency with SQL and relational databases. Candidates should be able to design database schemas, write complex queries, and optimize performance for scale</li><li>Product Ownership: Brings a product-first mindset, able to drive projects from ideation to launch while focusing on user needs, business impact, and cross-functional alignment.</li><li>Collaboration &amp; Communication: Comfortable working cross-functionally with design, product, and other engineering teams to ensure clarity, alignment, and smooth execution of projects.</li><li>Continuous Learning: Demonstrates a passion for staying current with new technologies, frameworks, and industry best practicesâ\u0080\u0094proactively applying improvements to code quality and team workflows.</li><li>Experience: At least 2 years of hands-on experience in a technical engineering capacity, preferably in a fast-paced or product-driven environment.</li><li>Education (Preferred): Bachelorâ\u0080\u0099s degree in Computer Science, Engineering, or a related technical field.</li></ul><p><br></p><p></p>\\n<p><i>At MediaLab, we rely on a range of backgrounds, experiences, and ideas. We value diversity, and weâ\u0080\u0099re proud to be an inclusive, equal opportunity workplace.</i></p><br/><br/>Please mention the word **SMOOTHEST** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Remote U.S.",
  "salary_min": 70000,
  "salary_max": 130000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-full-stack-engineer-medialab-1093223",
  "url": "https://remoteOK.com/remote-jobs/remote-full-stack-engineer-medialab-1093223"
}