{
  "slug": "remote-technical-lead-devops-magnet-forensics-1093224",
  "id": "1093224",
  "epoch": 1748116803,
  "date": "2025-05-24T20:00:03+00:00",
  "company": "Magnet Forensics",
  "company_logo": "https://remoteok.com/assets/img/jobs/58c951955ede0080eee810532a4d81bb1748116805.png",
  "position": "Technical Lead DevOps",
  "tags": [
    "saas",
    "embedded",
    "security",
    "technical",
    "support",
    "software",
    "code",
    "devops",
    "cloud",
    "git",
    "leader",
    "management",
    "lead",
    "operations",
    "sales",
    "recruitment",
    "linux"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/58c951955ede0080eee810532a4d81bb1748116805.png",
  "description": "<p><span style=\"font-size: 16px\"><b>Who We Are; What We Do; Where Weâ\u0080\u0099re Going</b></span></p><p><br></p><p><span style=\"font-size: 16px\">Magnet Forensics is a global leader in the development of digital investigative software that acquires, analyzes, and shares evidence from computers, smartphones, tablets, and IoT-related devices. We are continually innovating so our customers can deploy advanced and effective tools to protect their companies, communities, and countries.</span></p><p><span style=\"font-size: 16px\">&nbsp;</span></p><p><span style=\"font-size: 16px\">Serving thousands of customers globally, our solutions are playing a crucial role in modernizing digital investigations, helping investigators fight crime, protect assets, and guard national security.</span></p><p><span style=\"font-size: 16px\">&nbsp;</span></p><p><span style=\"font-size: 16px\">With employees based around the world, Magnet Forensics has been expanding our global presence. As a part of Magnet Forensics, you can expect to make a difference in the world, no matter what role you play. Youâ\u0080\u0099ll be supported through learning and development, not to mention an incredible team with unbelievable talent and integrity. </span></p><p><span style=\"font-size: 16px\">&nbsp;</span></p><p><span style=\"font-size: 16px\">If you think you would be the right person to join our team working towards this goal, we would love to hear from you!&nbsp;</span></p><p><br></p><p><b>Role Summary</b></p><p>We are on the hunt for a talented <b>Technical Lead, DevOps Engineer</b> to join our ranks! This role is responsible for building and delivering the next generation of Digital Forensics products which help investigators get to truth while protecting the innocent.&nbsp;&nbsp;</p><p><br></p><p>You will lead the team responsible for delivering our SaaS platform in a <b>FedRAMP</b> environment, starting with the build-out of the environment and systems, and continuing into high performance operations of the products within that environment.&nbsp; </p><p><br></p><p>This role may evolve into a formal management role, depending upon the candidate.</p><p>&nbsp;</p><p><b>NOTE: Candidate must reside in The United States and hold US Citizenship.</b></p>\\n<p></p><p><br></p><b>Role Responsibilities:</b><ul><li>Understand FedRAMP requirements, and, in collaboration with product teams, vendors, and your own team, build out and maintain a compliant environment;</li><li>Contribute to effective partner relationships;</li><li>Receive handoffs of product from product teams, and then deploy and operate those products in the FedRAMP environment;</li><li>Responsible for SaaS performance (DORA metrics + uptime)</li><li>Responsible for team efficiency, identifying and advocating for improvements across process, tools, and architecture;</li><li>Work with stakeholders to manage the teamâ\u0080\u0099s roadmap;</li><li>Analyze requirements, break down tasks and estimate effort;</li><li>Take initiative, build strong teams and relationships, and communicate effectively;</li><li>Collaborate with product and support engineers to resolve issues, including in customer-facing calls;</li><li>Build DevOps automation to accomplish the teamâ\u0080\u0099s goals</li><li>Participate in code reviews;</li><li>Troubleshoot, debug and fix defects;</li><li>Communication across the team and throughout the organization from technical ICs to executives, to share knowledge and build consensus;</li><li>Provide informal and formal mentorship within and outside the team;</li><li>Travel: 5%.</li></ul><p><br></p><b>Qualifications:</b><ul><li>3+ years of experience operating a SaaS in a leading technical role;</li><li>Influential leadership of colleagues;</li><li>Experience working through compliance initiatives (e.g. FedRAMP, SOC2, NIST 800-53);</li><li>4+ years of experience writing software in a high-level language in a DevOps environment.&nbsp; (Python, C#, etc.)</li><li>4+ years of experience managing Linux systems and containers;&nbsp;</li><li>2+ years of experience building and maintaining&nbsp;Kubernetes clusters;</li><li>Proficiency working with an Infrastructure-as-Code first mindset (Terraform, Cloud Formation/CDK, Kubernetes manifests, Helm charts);&nbsp;</li><li>Experience working with Cloud Providers <b>(We use AWS!)</b>;</li><li>Proficiency in Linux shell scripting (create, debug, maintain, etc.);</li><li>Proficiency with networking design, protocols, and security;</li><li>Proficiency using Git based version control systems.&nbsp;</li><li>Experience writing and managing POA&amp;Ms.</li></ul><p><br></p><b>Nice To Have:</b><ul><li>Experience building and maintaining CI/CD pipelines; <b>&nbsp;</b></li><li>Experience with alerting, observability, and telemetry <b>(We use Prometheus/Grafana!)</b>;&nbsp;</li><li>Experience working in high security environments&nbsp;(including GovCloud);</li><li>Experience managing relational databases;&nbsp;</li><li>Experience generating effective and efficient project documentation;</li><li>Experience with Argo.</li></ul><p><br></p><b>Compensation &amp; Benefits:</b><ul><li>The Compensation Range is for the primary location for which the job is posted. Please note that the actual compensation may vary depending on location and job-related factors such as qualifications, experience, knowledge and skills. If you are applying for this role outside of the primary location and you are selected for an interview, the Talent Acquisition Partner can share more information with you.&nbsp;<i>If the compensation structure for the role includes an incentive component (ie. most Sales roles) the range below represents total target compensation (TTC) (base salary + variable).</i></li></ul><div><br></div><div><b>Compensation Range:</b></div><ul><li>MIN: $152,000 - MID: $190,000 - MAX: $228,000 USD</li></ul><p><br></p><b>Magnet Forensics is proud to offer Benefits such as:</b><ul><li>Generous Time Off Policies;</li><li>Competitive Compensation;</li><li>Volunteer Opportunities;</li><li>Reward and Recognition Programs;&nbsp;</li><li>Employee Committees &amp; Resource Groups;</li><li>Healthcare and Retirement Benefits.&nbsp;</li></ul><p><br></p><p></p>\\n<p><b>The Most Important Thing</b></p><p>Weâ\u0080\u0099re looking for candidates that can provide examples of how they have demonstrated Magnet&nbsp;<b>CODE&nbsp;</b>in their previous experiences:</p><p><b>CARE</b>&nbsp;â\u0080\u0093 We care about each other and our mission to make a difference in the world.</p><p><b>OWN&nbsp;</b>â\u0080\u0093 We are accountable for our results â\u0080\u0093 while never forgetting to act with integrity, empathy, and respect.</p><p><b>DEDICATE</b>&nbsp;â\u0080\u0093 We put our heart and soul into meeting the needs of our customers and helping them serve the people they protect.</p><p><b>EVOLVE</b>&nbsp;â\u0080\u0093 We are constantly innovating and exploring new ways to work together to make an impact with our work.</p><p><br></p><p><i>Here at Magnet Forensics, we are committed to continuous learning and are focused on building a diverse and inclusive workforce. This commitment will be reflected in our hiring processes and embedded in our values and how we treat one another. If youâ\u0080\u0099re interested in this role, but do not meet all of the qualifications listed above, we encourage you to apply anyways. </i></p><p><i>&nbsp;</i></p><p><i>Magnet Forensics is an Equal Opportunity Employer and considers applicants for employment without regard to race, colour, religion, sex, orientation, national origin, age, disability, genetics or any other basis forbidden under federal, provincial, or local law.  We are committed to providing an inclusive, accessible recruitment process and work environment. Accommodation is available to all applicants upon request throughout the hiring process. Please contact </i><a class=\"postings-link\" href=\"mailto:aoda@magnetforensics.com\"><i>aoda@magnetforensics.com</i></a>&nbsp;<i>should you require any accommodations.</i></p><p><br></p><p><i>All offers of employment at Magnet are contingent upon satisfactory completion of a background check. All background checks will be conducted in accordance with all applicable laws. Magnet will consider each positionâ\u0080\u0099s job duties, among other factors, in determining what constitutes satisfactory completion of the background check. Refusal to consent to a background check may be grounds for revoking an offer of employment.</i></p><p><br></p><p><b>US Applicants: </b>Magnet Forensics participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.</p><br/><br/>Please mention the word **COURAGEOUS** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "United States",
  "salary_min": 55000,
  "salary_max": 75000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-technical-lead-devops-magnet-forensics-1093224",
  "url": "https://remoteOK.com/remote-jobs/remote-technical-lead-devops-magnet-forensics-1093224"
}