{
  "slug": "remote-member-of-product-trading-anchorage-digital-1093187",
  "id": "1093187",
  "epoch": 1747389603,
  "date": "2025-05-16T10:00:03+00:00",
  "company": "Anchorage Digital",
  "company_logo": "https://remoteok.com/assets/img/jobs/5a4f899956819078307e43e560f1917c1747389605.png",
  "position": "Member of Product Trading",
  "tags": [
    "design",
    "crypto",
    "cryptocurrency",
    "swift",
    "security",
    "technical",
    "growth",
    "voice",
    "manager",
    "financial",
    "finance",
    "bank",
    "strategy",
    "management",
    "senior",
    "legal",
    "engineering",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/5a4f899956819078307e43e560f1917c1747389605.png",
  "description": "<p><span style=\"font-size: 18px\"><b>At Anchorage Digital, we are building the worldâ\u0080\u0099s most advanced digital asset platform for institutions to participate in crypto.</b></span></p><p><br></p><p>Anchorage Digital is a crypto platform that enables institutions to participate in digital assets through custody, staking, trading, governance, settlement, and the industry's leading security infrastructure. Home to Anchorage Digital Bank N.A., the only federally chartered crypto bank in the U.S., Anchorage Digital also serves institutions through Anchorage Digital Singapore, Porto by Anchorage Digital<span style=\"font-size: 15px;\">, and other offerings.</span></p><p><br></p><p>The company is funded by leading institutions including Andreessen Horowitz, GIC, Goldman Sachs, KKR, and Visa, with its Series D valuation over $3 billion. Founded in 2017 in San Francisco, California, Anchorage Digital has offices in New York, New York; Porto, Portugal; Singapore; and Sioux Falls, South Dakota. Learn more at anchorage.com, on X @Anchorage, and on LinkedIn.&nbsp;</p><p><br></p><p>As a Product Manager in Trading, you will be driving the front office and back office trading systems that are used by institutional investors around the world on a daily basis to trade, invest and exchange cryptocurrency assets. The crypto industry is one of the most exciting industries in tech today, and it is constantly changing!  At Anchorage Digital, we are building foundational technology to help the crypto industry evolve in a safe, regulated and highly secure manner, which we believe is essential for maximizing the potential of this exciting industry.</p><p><br></p><p>We have created the Factors of Growth &amp; Impact to help Villagers better measure impact and articulate coaching, feedback, and the rich and rewarding learning that happens while exploring, developing, and mastering the capabilities and contributions within and outside of the role</p>\\n<p></p><p><br></p><b>Technical Skills:</b><ul><li>Apply your practical experience working with Traders, or your own experience as a Trader, to develop and implement new financial products tailored to market demands.</li><li>Possesses expert proficiency in both electronic and voice trading, which informs and influences technology improvements modeled after the more established Traditional Finance market structure.</li><li>Own the detailed prioritization of your productâ\u0080\u0099s roadmap, balancing new feature development and technical debt.</li><li>Demonstrate deep strategic thinking in shaping the product roadmap, considering market trends, competitive landscape, and customer needs to drive long-term product success.</li><li>Deliver complex, cross-functional projects with multiple dependencies, demonstrating strong product management skills and ability to drive swift execution while maintaining quality.</li><li>Drive comprehensive go-to-market strategy and execution, including defining success metrics, tracking key performance indicators, and iterating based on data-driven insights.</li><li>Work closely with your engineering and design counterparts to drive product development processes and planning.</li></ul><p><br></p><b>Complexity and Impact of Work:</b><ul><li>Maintain a pulse on trading market dynamics and client sentiment, providing critical perspectives to internal research that will shape product enhancements and drive increased engagement among trading clients.</li><li>Define and deliver product work flows and solutions that maximize automation in trade execution, hedging and risk management freeing up trader capacity for complex trades, project work, and client engagement.</li><li>Lead and influence cross-functional teams while maintaining strong stakeholder relationships across the organization</li><li>Exercise independent decision-making and take full ownership of product strategy and execution</li><li>Contribute strategic insights that significantly impact company direction and product roadmap</li><li>Demonstrate product leadership that elevates team performance and effectiveness</li></ul><p><br></p><b>Organizational Knowledge:</b><ul><li>Develop deep understanding of Anchorage's business model, organizational structure, and strategic priorities</li><li>Build and maintain strong relationships with stakeholders across departments to ensure effective collaboration</li><li>Navigate and improve organizational processes to enhance efficiency and effectiveness</li><li>Contribute to organizational strategy through product expertise and market insights</li><li>Drive company objectives through strategic product decisions and initiatives</li></ul><p><br></p><b>Communication and Influence:</b><ul><li>Act as a strong advocate for the Trading product needs and priorities in cross-functional discussions, ensuring their perspective is clearly understood and considered in product strategy and decision-making.</li><li>Effectively influence and motivate others through respectful engagement, aligning teams with broader organizational goals</li><li>Enable cross-functional collaboration through clear, consistent communication and strategic influence on decision-making at every level of the organization.</li><li>Act as a thoughtful knowledge partner to senior leadership, helping improve organizational dynamics through empathetic understanding</li></ul><p><br></p><b>You may be a fit for this role if you have: </b><ul><li>Minimum 5 years of proven product management experience within institutional trading environments, encompassing either cryptocurrency or traditional asset classes. Alternatively, a minimum of 5 years of experience as an OTC trader with a strong history of collaborative product development with engineering teams will be considered.</li><li>Your empathy and adaptability not only complement othersâ\u0080\u0099 working styles but also embody our culture of curiosity, creativity, and shared understanding</li><li>Experience in driving and managing complex projects across multiple teams, demonstrating exceptional leadership and problem-solving skills.</li><li>You are deeply invested in optimizing the end-user experience and leveraging it to create business value.</li><li>Exceptional written and verbal communication skills, adept at conveying complex concepts clearly to diverse audiences, including both internal teams and external stakeholders.</li><li>You self describe as some combination of the following: creative, humble, ambitious, detail oriented, hard working, trustworthy, eager to learn, methodical, action oriented, and tenacious.</li></ul><p><br></p><b>Although not a requirement, bonus points if: </b><ul><li>You are knowledgeable about crypto, you use self-custody wallets actively, and know a bit too much about defi!</li><li>You build 0 to 1 products for financial institutions either as a PM or a developer.</li><li>You were emotionally moved by the soundtrack to Hamilton, which chronicles the founding of a new financial system. :)</li></ul><p><br></p><p></p>\\n<p><span style=\"font-size: 18px\"><b>About Anchorage Digital: Who we are</b></span></p><p><br></p><p>The Anchorage Village, what we call our team, brings together the brightest minds from platform security, financial services, and distributed ledger technology to provide the building blocks that empower institutions to safely participate in&nbsp; the evolving digital asset ecosystem. As&nbsp;a diverse team of more than 300 members, we are united in one common goal: building the future of finance by providing the foundation upon which value moves safely in the new global economy.&nbsp;</p><p><br></p><p>Anchorage Digital is committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported, and connected at workâ\u0080\u0094regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.</p><p>&nbsp;</p><p>Anchorage Digital is an Equal Opportunity Employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or veteran status. Anchorage Digital considers qualified applicants regardless of criminal histories, consistent with other legal requirements. â\u0080\u009cAnchorage Digitalâ\u0080\u009d refers to services that are offered either through Anchorage Digital Bank National Association, an OCC-chartered national trust bank, or Anchorage Lending CA, LLC a finance lender licensed by the California Department of Financial Protection and Innovation, License No. 60DBO-11976, or Anchorage Digital Singapore Pte Ltd, a Singapore private limited company, all wholly-owned subsidiaries of Anchor Labs, Inc., a Delaware corporation.</p><p><br></p><p>Protecting your privacy rights is important to Anchorage Digital, and we work to maintain the trust and confidence of our clients when handling personal or financial information. Please see our <a class=\"postings-link\" href=\"https://www.anchorage.com/privacy-policy\">privacy policy notices here.</a></p><br/><br/>Please mention the word **DISTINCTION** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "United States",
  "salary_min": 67500,
  "salary_max": 125000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-member-of-product-trading-anchorage-digital-1093187",
  "url": "https://remoteOK.com/remote-jobs/remote-member-of-product-trading-anchorage-digital-1093187"
}