{
  "slug": "remote-tiktok-video-director-coin-market-cap-ltd-1093205",
  "id": "1093205",
  "epoch": 1747764002,
  "date": "2025-05-20T18:00:02+00:00",
  "company": "Coin Market Cap Ltd",
  "company_logo": "",
  "position": "TikTok Video Director",
  "tags": [
    "director",
    "design",
    "web3",
    "copywriting",
    "video",
    "post-production",
    "seo",
    "content",
    "analytics",
    "digital nomad"
  ],
  "description": "<p><b>Job Responsibilities:</b></p><p>1. Responsible for writing high-quality video interview scripts based on interviewees, ensuring that the script content aligns with the platform's style and user preferences.</p><p>2. Plan the overall style, content direction, and creative concepts of interview videos, and design the lens language to transform interview scripts into detailed shooting lists, specifying the shooting requirements and visual effects for each shot.</p><p>3. Oversee the entire production process of interview videos, including pre-production planning, online shooting, and post-production editing.</p><p>4. Continuously monitor the performance data of interview videos, such as user interaction rates, views, and shares, and use data analysis results to optimize future interview content strategies and enhance the dissemination effect of videos.</p><p>5. Keep up with the latest trends and popular content formats on TikTok/YouTube platforms, and adjust the style and content of interview videos in a timely manner.</p><p>6. Research the cultural characteristics and viewing preferences of the target audience to make interview content more attractive.</p><p><br></p><p><b>Job Requirements:</b></p><p>1. At least 5 years of video directing experience, with preference given to those with experience in interview production.</p><p>2. Proficient in video editing software, such as Adobe Premiere Pro/Final Cut Pro/CapCut.</p><p>3. Active thinking, capable of designing innovative interview formats and questioning methods, and possessing good copywriting skills.</p><p>4. Possess excellent analytical skills to optimize content direction based on data insights.</p><p>5. Heavy user of TikTok/YouTube platforms, with a unique understanding of short video content, a keen sense of hot topics, and the ability to dig up topics. Preference given to those with experience in building TikTok accounts from scratch (0-1).</p><p>6. Preference given to those with experience in planning and directing viral videos of the same type.</p><p>7. Familiar with TikTok/YouTube advertising and analytics tools.</p><p>8. Knowledge of SEO and social media content optimization.</p><p>9. Fluent in English, with excellent speaking, listening, reading, and writing skills.</p><p>10. Interest in or experience in the Web3 industry is preferred.</p>\\n<p></p><p><br></p><p></p>\\n<br/><br/>Please mention the word **PLEASING** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 55000,
  "salary_max": 80000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-tiktok-video-director-coin-market-cap-ltd-1093205",
  "logo": "",
  "url": "https://remoteOK.com/remote-jobs/remote-tiktok-video-director-coin-market-cap-ltd-1093205"
}