{
  "slug": "remote-support-specialist-vesta-1093153",
  "id": "1093153",
  "epoch": 1746972003,
  "date": "2025-05-11T14:00:03+00:00",
  "company": "Vesta",
  "company_logo": "https://remoteok.com/assets/img/jobs/576452b5b070b8886671a0aaa0b9367a1746972005.png",
  "position": "Support Specialist",
  "tags": [
    "system",
    "security",
    "support",
    "software",
    "financial",
    "finance",
    "cloud",
    "engineering"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/576452b5b070b8886671a0aaa0b9367a1746972005.png",
  "description": "<p><b>What we're doing:</b></p><p>Owning a home is a foundational part of building financial security and wealth in America. However, the tools and technology that support homeownership are antiquated, dependent on things like fax machines, handwritten documentation, and hours of manual review.</p><p><br></p><p>We're here to change it.</p><p><br></p><p>Vesta is the next-generation system of record to power the multi-trillion mortgage market. We believe that we are overdue for a core transformation â\u0080\u0093 that in order to build a fully automated process and fully digital customer journeys, lenders will have to adopt a system of record platform that is modern, open, and orchestrated by best-in-class software workflows.</p><p><br></p><p><b>Who we are:</b></p><p>Our founding team is no stranger to the complexities of the financial industry. As early employees at Blend, they spent years together focused on creating modern cloud infrastructure for banks. Now, with Vesta, they are transforming the mortgage industry by creating the most flexible, open and automated origination experience, benefiting financial institutions and their customers.</p><p><br></p><p>And, we're not alone.</p><p><br></p><p>We've raised $55M from top tier investors, including Andreessen Horowitz, Bain Capital Ventures, Conversion Capital, Zigg Capital, and Index Ventures.&nbsp;</p><p><br></p><p>We believe that our team is our greatest competitive advantage and take pride in having a team of exceptional humans. As a team, we value humility, empathy, self-awareness, and an orientation towards action. If this sounds like you and you're excited by the idea of getting in at the ground level to be part of building the infrastructure that will power the future of the finance industry, we would love to hear from you!</p><p><br></p><p><b>Who you are:</b></p><p>You are comfortable learning and working with software tools, and you are willing to dive in to the details of how our system interacts with other software providers. You are comfortable navigating APIs, webhooks, and XML, and you arenâ\u0080\u0099t afraid to learn more.</p><p><br></p><p>You are passionate about solving customer problems in order to help them achieve their goals. You can deeply empathize with user pain points and questions (perhaps because youâ\u0080\u0099ve experienced them before yourself).</p><p><br></p><p>You are curious, persistent, and like problem-solving! You like to get to the â\u0080\u009cwhyâ\u0080\u009d and wonâ\u0080\u0099t stop until you figure it out. Complex problems are your favorite, and youâ\u0080\u0099re willing to dig deep to get to a solution.</p><p><br></p><p>You're looking to join an early-stage team to build something BIG, something industry-changing, and youâ\u0080\u0099re excited about being part of that quickly-moving, fast-growing journey.</p><p><br></p><p>As a bonus, you might have some experience working within or around the mortgage industry, navigating and working with mortgage technology systems, ideally on the business process, or technical/IT side.</p><p><br></p><p><b>About the role:</b>&nbsp;</p><p>As one of our first support specialists at Vesta, youâ\u0080\u0099ll work closely with our customers to guide them on our product, troubleshoot and escalate issues to our product and engineering teams, all to ultimately make our customers successful. In this role, you can expect to:</p>\\n<p></p><p><br></p><ul><li>engage with Vestaâ\u0080\u0099s customers through various communication channels, namely Zendesk, to work with them on issues, errors, product questions, bugs, and product feedback</li><li>initially troubleshoot issues or questions yourself by using our internal debugging tools, looking for steps to reproduce the issue, or providing explanations on how to use Vesta</li><li>collaborate with our product and engineering teams when needed, clearly communicating the customer problems, and providing context and other materials that will aid in resolving the issue</li><li>become a Vesta product expert, understanding a large breadth of functionality within the platform in order to clearly and effectively explain to users how to navigate the product</li><li>have an eye towards scalability by documenting product functionality and new feature releases in our help center so that users can self serve</li><li>observe and communicate trends in customer feedback or pain points to our product, design, and engineering teams, to help identify areas of our product that may be particularly confusing or error-prone</li><li>be an indispensable part of delivering industry-changing software to our customers!</li></ul><p><br></p><b>Perks + Benefits:</b><ul><li>Robust medical, vision, &amp; dental coverage (~100% of employee premiums are covered)</li><li>401(K) plan offering</li><li>Meaningful parental leave - 16 weeks fully paid for all new parents, birthing &amp; non-birthing parents (applies to adoptions as well!)</li><li>Remote-first culture with a hub in San Francisco</li><li>Generous Work-From-Anywhere &amp; Wellness Benefits</li><li>Monthly Doordash benefits</li><li>Open &amp; encouraged flexible time off</li><li>Company offsites to get to know the team!</li></ul><p><br></p><p></p>\\n<p>Our cash compensation amount for this role is targeted at $80,000 - $120,000/yr.&nbsp; Final offer amounts are determined by multiple factors including candidate experience and expertise and may vary from the amounts listed above.</p><p><br></p><p>At Vesta, we believe that the only way we can tackle the challenging problems in front of us is by having diverse perspectives and an environment that promotes inclusivity. Weâ\u0080\u0099re committed to equal opportunity regardless of race, color, ancestry, religion, gender, gender identity, parental or pregnancy status, national origin, sexual orientation, age, citizenship, marital status, disability, or veteran status.&nbsp;Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. As part of our onboarding process, we participate in the E-Verify program.</p><br/><br/>Please mention the word **WONDROUS** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Remote",
  "salary_min": 55000,
  "salary_max": 77500,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-support-specialist-vesta-1093153",
  "url": "https://remoteOK.com/remote-jobs/remote-support-specialist-vesta-1093153"
}