{
  "slug": "remote-data-analyst-canada-wide-newton-1093292",
  "id": "1093292",
  "epoch": 1748869211,
  "date": "2025-06-02T13:00:11+00:00",
  "company": "Newton",
  "company_logo": "https://remoteok.com/assets/img/jobs/8fcb27372437b4a4f26d8e7b092b9cde1748869211.png",
  "position": "Data Analyst Canada Wide",
  "tags": [
    "analyst",
    "crypto",
    "python",
    "financial",
    "operational",
    "analytics"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/8fcb27372437b4a4f26d8e7b092b9cde1748869211.png",
  "description": "<p><span style=\"font-size: 16px\">Say hello to Newton! We're changing how Canadians trade crypto. Our goal? To make financial freedom something everyone can achieve. We give our customers the tools and knowledge they need to navigate the crypto world.</span></p><p><br></p><p><span style=\"font-size: 16px\">At Newton, you'll work with a remote team spread across Canada, but you'll never feel distant. Ready to be part of something meaningful? Join a team thatâ\u0080\u0099s all about pushing boundaries and getting things done.</span></p><p><br></p><p><b style=\"font-size: 16px\">Some of our values:</b></p><p><span style=\"font-size: 16px\">â\u0097\u008f&nbsp; Customer first mindset - Commitment to integrity and transparency to our users!</span></p><p><span style=\"font-size: 16px\">â\u0097\u008f&nbsp; A dynamic team fueled by collaboration uniting our strengths to overcome any obstacles. Together we build success. We persevere, adapt, and come back stronger, turning obstacles into opportunities.</span></p><p><span style=\"font-size: 16px\">â\u0097\u008f&nbsp; We strive for continuous improvement and embrace creativity and encourage experimentation. We push the boundaries of whatâ\u0080\u0099s possible and continuously explore new ideas, technologies, and solutions.</span></p><p><br></p><p><b><span style=\"font-size: 16px;\">Role Overview:</span></b></p><p><span style=\"font-size: 16px;\">We are searching for a Data Analyst, a role focused on turning business data into actionable insights. Your mission is to empower teams to make smarter, faster decisions through clear analysis and automated reporting.&nbsp;</span></p><p><br></p><p><b><span style=\"font-size: 16px;\">Responsibilities will include:</span></b></p><p><span style=\"font-size: 16px;\">â\u0097\u008f Identifying key metrics and building standardized reports to track business performance&nbsp;</span></p><p><span style=\"font-size: 16px;\">â\u0097\u008f Investigate and resolve data inconsistencies and irregularities</span></p><p><span style=\"font-size: 16px;\">â\u0097\u008f Aggregating and analyzing data across departments to uncover trends and patterns</span></p><p><span style=\"font-size: 16px;\">â\u0097\u008f Performing investigative analysis on large/diverse datasets</span></p><p><span style=\"font-size: 16px;\">â\u0097\u008f Assisting with analyzing results of experiments/pilots, new methods, data sources, and making actionable recommendations</span></p><p><span style=\"font-size: 16px;\">â\u0097\u008f Leading analytics on projects of varying sizes and complexity. This includes report automation, data visualization, gathering and documenting tool implementation requirements, split testing, and conducting ad hoc analysis and data mining.&nbsp;</span></p><p><span style=\"font-size: 16px;\">â\u0097\u008f Managing and delivering on business research initiatives&nbsp;</span></p><p><span style=\"font-size: 16px;\">â\u0097\u008f Collaborating with cross-functional teams to resolve data discrepancies and address inquiries efficiently</span></p><p><br></p><p><b><span style=\"font-size: 16px;\">Who you are:</span></b></p><p><span style=\"font-size: 16px;\">â\u0097\u008f Proficiency in SQL, Python and Excel</span></p><p><span style=\"font-size: 16px;\">â\u0097\u008f Experience in using analytics to effectively drive strategic and operational decision making&nbsp;</span></p><p><span style=\"font-size: 16px;\">â\u0097\u008f Able to work independently&nbsp;</span></p><p><span style=\"font-size: 16px;\">â\u0097\u008f Strong attention to detail and accuracy</span></p><p><span style=\"font-size: 16px;\">â\u0097\u008f Excellent communication and interpersonal skills</span></p><p><br></p>\\n<p></p><p><br></p><p></p>\\n<p><span style=\"font-size: 16px\">At Newton, we celebrate our inclusive work environment and welcome members of all backgrounds and perspectives to apply. We are committed to providing reasonable accommodations and will work with you to meet your needs. If you are a person with a disability and require assistance during the application process, please donâ\u0080\u0099t hesitate to reach out!</span></p><br/><br/>Please mention the word **GUTSY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Toronto, Ontario",
  "salary_min": 60000,
  "salary_max": 100000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-data-analyst-canada-wide-newton-1093292",
  "url": "https://remoteOK.com/remote-jobs/remote-data-analyst-canada-wide-newton-1093292"
}