{
  "slug": "remote-account-executive-leadr-1093299",
  "id": "1093299",
  "epoch": 1748937660,
  "date": "2025-06-03T08:01:00+00:00",
  "company": "Leadr ",
  "company_logo": "https://remoteok.com/assets/img/jobs/ca1a96e63b128e75cda3278816f3d2b41748937660.png",
  "position": "Account Executive",
  "tags": [
    "hr",
    "teach",
    "training",
    "support",
    "software",
    "growth",
    "web",
    "manager",
    "leader",
    "sales",
    "go",
    "executive"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/ca1a96e63b128e75cda3278816f3d2b41748937660.png",
  "description": "<p><b style=\"font-size: 18px\">First of all - Thank You! </b></p><p><span style=\"font-size: 11pt\">This probably isnâ\u0080\u0099t the first job description youâ\u0080\u0099ve read today. Maybe this is one of over 100 you reviewed this week. So, before we go any further, we want to stop and say thank you for considering this role. We know you have options and weâ\u0080\u0099d like you to consider adding us to that list.</span></p><p><br></p><p><b style=\"font-size: 18px\">About Leadr:</b></p><p><span style=\"font-size: 11pt;\">At Leadr, weâ\u0080\u0099re on a mission to rid the world of bad management, by empowering middle managers to become exceptional leaders who transform the culture and outcomes of their teams.</span></p><p><br></p><p><span style=\"font-size: 11pt;\">Today, too many companies leave managers to fend for themselves, resulting in a 60% failure rate within their first two years for first-time leaders. The rapid growth of AI is worsening this problem, as the purview of the modern manager expands. While many organizations respond to these challenges with internal training programs, these are frequently relegated to already overwhelmed HR leaders, who are taught to prioritize compliance and administration rather than genuinely improving team clarity, cohesion, and performance.</span></p><p><br></p><p><span style=\"font-size: 11pt;\">We see middle managers differently: they are the heartbeat of company culture and the driving force behind team results. At Leadr, we build AI-powered software tools that improve quality of life for those managers, while coaching them toward better leadership and outcomes â\u0080\u0093 paired with hands-on training for these leaders to teach them the most critical skills overlooked by companies.</span></p><p><br></p><p><span style=\"font-size: 11pt;\">When you join Leadr, youâ\u0080\u0099re committing to help us tackle this important and rewarding challenge: transforming how people lead.</span></p><p><br></p><p><br></p><p><b style=\"font-size: 18px;\">Your Role:</b></p><p><span style=\"font-size: 11pt;\">Leadr is seeking an entrepreneurial, results-driven Account Executive to help us take Leadr to the next level of growth. If you thrive on strategic selling and taking ownership of your results, youâ\u0080\u0099ll find a home here.</span></p>\\n<p></p><p><br></p><b>Responsibilities:</b><ul><li>Prospect strategic accounts</li><li>Manage deals through a sales funnel from initial call through close</li><li>Conduct product demonstrations of Leadr to potential customers</li><li>Conduct in person demonstrations with C-Suite prospects</li><li>Understand an accountâ\u0080\u0099s needs and effectively communicate how Leadr will meet those needs</li><li>Shape, iterate, and scale our sales strategy, taking initiative to improve the teamâ\u0080\u0099s practices, tools, and content</li><li>Work collaboratively across engineering, marketing, product and customer success</li></ul><div><br></div><p><br></p><b>Qualifications:</b><ul><li>3+ years of proven hunting &amp; closing experience&nbsp;</li><li>Proven track record of success</li><li>Superb listening skills, empathy, and skilled at answering unexpected questions with ease</li><li>Experience executing detailed web and onsite product presentations preferred</li><li>Willingness and desire to work in a fast-paced and high growth environment</li><li>Highly organized and able to adapt to changing priorities</li></ul><p><br></p><b>Benefits of Joining Our Team:</b><ul><li>100% Remote (with exceptions of travel)</li><li>AWARD-WINNING CULTURE: At Leadr, weâ\u0080\u0099re proud to foster a workplace where people thrive. We've been recognized as one of The Dallas Morning News Best Places to Work every year from 2022 to 2024, earning the prestigious Best at Values award. We ranked #12 on Will Reedâ\u0080\u0099s Top 100 Workplaces and #8 on LinkedInâ\u0080\u0099s Top Startupsâ\u0080\u0094because we believe people deserve to be led and developed, not just managed</li><li>An opportunity to work in a Tech start-up with unlimited growth potential</li><li>We offer PTO, Paid Holidays, Flex Holidays, etc</li><li>Medical insurance offered (health, dental, vision, life)</li><li>We are committed to developing you as a leader and providing career growth throughout your employment with us</li><li>We promise to care for you as a person, and have meaningful conversations with you so you have the clarity and support you need to do your best work!</li></ul><p><br></p><p></p>\\n<p><i>Leadr is an Equal Opportunity Employer. Our goal is that everyone, regardless of their culture, background, and perspective, has the opportunity to love Mondays as much as Fridays. Thank you again for your time and interest!</i></p><br/><br/>Please mention the word **GENEROUS** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "United States",
  "salary_min": 37500,
  "salary_max": 55000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-account-executive-leadr-1093299",
  "url": "https://remoteOK.com/remote-jobs/remote-account-executive-leadr-1093299"
}