{
  "slug": "remote-senior-full-stack-engineer-elevate-1093263",
  "id": "1093263",
  "epoch": 1748466014,
  "date": "2025-05-28T21:00:14+00:00",
  "company": "Elevate",
  "company_logo": "",
  "position": "Senior Full Stack Engineer",
  "tags": [
    "engineer",
    "senior",
    "dev",
    "full stack",
    "english",
    "javascript"
  ],
  "description": "<p>ð\u009f\u009a\u0080 <strong>Join Our Mission</strong> https://www.elevateab.com</p><p><br />Elevate is reshaping the future of e-commerce optimization through innovative A/B testing solutions. We're helping Shopify stores unlock higher conversions and revenue by providing actionable insights and growth strategies to some of the world's leading e-commerce brands.<br /><br />This isn't just another development role â\u0080\u0093 you'll be a key team member building the platform that directly impacts thousands of merchants and millions of shoppers, driving real revenue growth through better optimization tools.<br /><br />ð\u009f\u0092¡ <strong>The Opportunity</strong></p><p>We have a thriving A/B testing platform that's already helping e-commerce merchants optimize their stores for better conversions. Our foundation is strong, but we're scaling rapidly and need experienced engineers to help us build the next generation of our platform.</p><p><br />As our Senior Fullstack Developer, you'll architect and build critical features across our entire stack, working on both the user-facing experiences that merchants love and the robust backend systems that power our analytics and testing infrastructure.<br /><br />ð\u009f\u009b ï¸\u008f <strong>What We've Built So Far</strong><br /><br />Modern A/B testing platform serving leading e-commerce brands<br />React and Next.js frontend with intuitive user interfaces<br />Scalable backend APIs and services<br />ClickHouse database handling massive volumes of user interaction data<br />Comprehensive analytics and reporting systems<br /><br />ð\u009f¤\u0096<strong> AI-Powered Developmen</strong>t<br />We expect our engineers to leverage AI tools to accelerate development and maintain high productivity:<br /></p><ul><li><strong>Experience with AI coding tools</strong> - You should be proficient with Cursor, Claude, ChatGPT, and Devin for development work<br /></li><li><strong>AI-assisted coding</strong> - Ability to use these tools effectively for code generation, debugging, and problem-solving<br /></li></ul><p><br />This isn't optional - we rely on these tools to move quickly while maintaining quality, so experience using AI for development is essential for success in this role.<br /><br />ð\u009f\u0094\u008d <strong>Who We're Looking For</strong><br />You're not just a developer â\u0080\u0093 you're a builder, problem-solver, and scaling expert with:<br /><br />5+ years of professional software development experience<br />Strong expertise in React and modern JavaScript/TypeScript<br />Proven experience with Next.js framework (SSR, SSG, API routes)<br />Proficiency in backend development (Node.js)<br />Experience with RESTful APIs and GraphQL<br />Knowledge of database design SQL and (ClickHouse experience a plus)<br /><br />ð\u009f\u008c\u009f <strong>The Ideal Candidate</strong><br />You thrive in environments where you can:<br /><br />Transform complex requirements into elegant, scalable solutions<br />Move fast while building for long-term maintainability<br />Work collaboratively with product, design, and engineering teams<br />Take ownership of features from conception to deployment<br /><br />ð\u009f\u0094® What Happens Next<br />Our interview process is straightforward and focused:<br /><br />Initial conversation about your background and our technical vision<br />Technical interview exploring your experience and problem-solving approach<br /><br />ð\u009f\u0092¼ The Opportunity<br /><br />Key team member with significant impact on product direction<br />Remote-friendly with flexible hours<br />Work with modern technologies and best practices<br />Be part of a fast-growing company with massive potential<br /><br />Preferred Qualifications:<br /><br />Shopify development experience (Liquid, Shopify APIs, app development)<br />Experience with cloud platforms (AWS)<br />Experience with state management libraries (Redux, Zustand, etc.)<br />Experience with Shopify<br /><br /></p><br/><br/>Please mention the word **CLEARLY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 40000,
  "salary_max": 60000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-senior-full-stack-engineer-elevate-1093263",
  "original": true,
  "logo": "",
  "url": "https://remoteOK.com/remote-jobs/remote-senior-full-stack-engineer-elevate-1093263"
}