{
  "slug": "remote-software-engineer-titan-1093216",
  "id": "1093216",
  "epoch": 1747922404,
  "date": "2025-05-22T14:00:04+00:00",
  "company": "Titan",
  "company_logo": "https://remoteok.com/assets/img/jobs/85bd5ce46e0b73a45f2fe6132a725a511747922405.png",
  "position": "Software Engineer",
  "tags": [
    "software",
    "design",
    "frontend",
    "test",
    "growth",
    "code",
    "web",
    "lead",
    "marketing",
    "health",
    "engineer",
    "backend",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/85bd5ce46e0b73a45f2fe6132a725a511747922405.png",
  "description": "<p><b>About Titan :&nbsp;</b></p><p>At Titan, weâ\u0080\u0099re redefining email for entrepreneurs, innovators, and creatorsâ\u0080\u0094transforming it into a powerful tool for business growth. Built by a team that deeply cares about helping businesses succeed, Titan is more than just an email platform.</p><p>Founded by Bhavin Turakhia, who also founded Directi, Radix, and Zeta, with a combined enterprise value exceeding $2 billionâ\u0080\u0094Titan is backed by a strong legacy of innovation. Today, Titan powers millions of conversations, with 2.4 million emails sent and received every week. In 2021, Automattic (the parent company of WordPress) invested $30M in Titan, valuing the company at $300M. This partnership fuels our mission to revolutionize email and build the future of digital communication.</p><p>At Titan, youâ\u0080\u0099ll be part of a fast-growing business, solving meaningful problems and shaping a product that empowers millions. Join us to make a real impact.</p><p><br></p><p><b>About Neo:</b></p><p>Neo is our fast-growing direct-to-customer platform designed to help small businesses, solopreneurs, and professionals establish a professional online presence with ease. Our offering includes domain name registration, an AI-powered website builder, and professional emailâ\u0080\u0094packaged at an affordable monthly rate to ensure accessibility for businesses of all sizes. We are now poised for our next phase of growth and are seeking a Growth Marketing Lead to accelerate new customer acquisition.</p>\\n<p></p><p><br></p><b>About the role :&nbsp;</b><ul><li>Weâ\u0080\u0099re hiring a Software Engineer for our frontend team who is passionate about building high-quality web software. If you enjoy solving real-world problems through clean, scalable code â\u0080\u0094 weâ\u0080\u0099d love to talk.</li></ul><p><br></p><b>Roles and responsibilities :&nbsp;</b><ul><li>Build and maintain complex web applications across products like Site Builder, Email, Calendar, and more. Collaborate with cross-functional teams to deliver features, explore new ideas, and enhance frontend infrastructure.</li><li>Write robust, maintainable, and well-tested code with strong focus on performance and architecture.</li></ul><p><br></p><b>Skills and Qualifications :&nbsp;</b><ul><li><u>Experience range</u> : 1 to 3 years</li><li>Strong understanding of <i>TypeScript/JavaScript</i> and modern frontend frameworks (<i>React preferred</i>).</li><li>Strong understanding of <b>computer science fundamentals, data structures &amp; algorithms.</b></li><li>Good understanding of design patterns and programming paradigms.</li><li>Understanding of frontend and backend concepts, databases, and building/working with APIs.</li><li>Experience writing unit and integration test cases.</li><li>Ability to think clearly, write structured code, and own what you build.</li><li>Knowledge of various frameworks/libs like angular, NestJS, tailwind, is a plus</li></ul><p><br></p><b>Perks and Benefits :</b><ul><li>We at Titan love our jobs. And itâ\u0080\u0099s no surprise â\u0080\u0093 we get to work on exciting and new projects, in a vibrant atmosphere that is designed to be comfortable and conducive for our personal and professional growth. And Titan goes the extra mile to make you feel at home. We offer benefits ranging from affordable catered meals and even snacks on the house. Our workspaces are welcoming and fun, complete with bean bag chairs and ping pong tables. You are free to wear what makes you comfortable and choose the hours you keep as a team. Oh, and weâ\u0080\u0099ve got your family covered too, with excellent health insurance plans and other benefits. In short, everything you need to be your best self at work! If you like the idea of working on solutions that have a truly global impact, get in touch!</li></ul><p><br></p><p></p>\\n<br/><br/>Please mention the word **ACCLAMATION** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Bengaluru, Karnataka",
  "salary_min": 70000,
  "salary_max": 110000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-software-engineer-titan-1093216",
  "url": "https://remoteOK.com/remote-jobs/remote-software-engineer-titan-1093216"
}