{
  "slug": "remote-senior-software-engineer-contra-1093221",
  "id": "1093221",
  "epoch": 1748011468,
  "date": "2025-05-23T14:44:28+00:00",
  "company": "Contra",
  "company_logo": "https://remoteOK.com/assets/img/jobs/202631a77beb756868ba36b7bf6aebd51748011468.png",
  "position": "Senior Software Engineer",
  "tags": [
    "engineer",
    "full stack",
    "dev"
  ],
  "logo": "https://remoteOK.com/assets/img/jobs/202631a77beb756868ba36b7bf6aebd51748011468.png",
  "description": "<p><strong>Who We Are And What We Do:</strong></p><p>Contra is a network of independent creatives, connecting you with the talent and tools to get work underway. Our platform offers all the necessary tools for discovering, hiring, onboarding, managing, and paying flexible talent.</p><p><strong>Why Join Contra's Journey?</strong></p><p>Contra is building the platform for the future of work. People, companies, and agencies are looking to adopt more flexible working styles, and we are leading the way, with a network of over 1M freelancers and 50k clients who depend on Contra to work together and collaborate, 100% commission-free. Weâ\u0080\u0099ve raised over $44M from top VCâ\u0080\u0099s including NEA, Unusual Ventures and Cowboy Ventures.</p><p><strong>About You:</strong></p><ul><li>You understand modern AI systems, products and workflows. You have opinions and taste in these areas, and know how to build polished AI-driven user experiences that delight, not detract.</li><li>You are an excellent, independent problem solver.</li><li>You have high standards for craft, quality, and attention-to-detail for the work that you ship, and motivate others to raise the bar.</li><li>You know how to articulate and balance the tradeoffs of rapid pace exploration and building performant, scalable, reliable, and quality systems.</li><li>You have high standards for verbal and written communication and are experienced at working in a remote organization, preferring to over-communicate and collaborate synchronously when able.</li><li>You thrive in a fast-paced and dynamic environment. Our team knows how to execute and is relentless about our velocity. You smartly use AI to increase your personal velocity, but are experienced enough an engineer on your own to navigate and keep it in check.</li><li>You apply an ownership mentality to everything you ship, and collaborate cross-functionally with other teams to achieve success.</li><li>You dedicate effort to staying up to date with new technologies, patterns, and AI.</li></ul><p><strong>In a day at Contra, youâ\u0080\u0099ll probably:</strong></p><ul><li>Contribute to our end-to-end TypeScript, GraphQL, React monorepo. Youâ\u0080\u0099ll work across the stack â\u0080\u0094 including our AI stack (LLMs, embeddings, vector search, evals, etc.)</li><li>Contribute to our Vitest/Playwright test suite.</li><li>Participate in the RFC process, building alignment around new database and API schemas and new patterns.</li><li>Participate in all parts of the product development process, like design critiques, code reviews, and cross-functional planning with your team.</li><li>Work on maintaining a tidy home: eliminate technical debt, improve performance, address customer bugs, improve developer experience, etc.</li></ul><p><strong>Our Stack:</strong></p><ul><li>Backend: TypeScript, PostgreSQL, GraphQL, NodeJS, Redis, Temporal</li><li>Frontend: React, Relay, PandaCSS</li><li>Data: Airbyte, dbt, Google BigQuery</li><li>DevOps: ArgoCD, Docker, GitHub, Google Cloud Platform, Kubernetes</li><li>Testing: Playwright, Vitest</li><li>Tools: Linear, Mergify, PostHog, Slack, Turbo</li><li>AI: OpenAI, Cursor, Supermaven, CodeRabbit (for code reviews â\u0080\u0094 itâ\u0080\u0099s actually great!)</li></ul><p><strong>Total Comp:</strong></p><ul><li>Salary: $170,000 - $200,000 CAD</li><li>Health + dental benefits</li><li>Home Office Budget</li><li>We will provide you with a company laptop on your start date</li></ul><p><strong>Interview Process</strong></p><ol><li>Intro Call with Recruiting Team (15-20 minutes)</li><li>Technical Interview with Hiring Manager (45 minutes)</li><li>Culture &amp; Cross-Functional Interview (45 minutes)</li><li>Paid Technical Assessment (3 hours) + Presentation (60 minutes)<ol><li>CTO &amp; Co-Founder</li><li>Engineering Manager</li></ol></li><li>Interview with CEO &amp; Co-Founder (30 minutes)</li></ol><p><em>Note: Contra communicates with applicants through @contra.com domains only. We never ask for money from potential employees. For the latest job postings, visit <a href=\"https://www.contra.com/careers\">Contra Careers</a>.</em></p><p><br /></p><br/><br/>Please mention the word **SUBSIDIZES** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 120000,
  "salary_max": 150000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-senior-software-engineer-contra-1093221",
  "original": true,
  "url": "https://remoteOK.com/remote-jobs/remote-senior-software-engineer-contra-1093221"
}