{
  "slug": "remote-implementation-specialist-distru-1093242",
  "id": "1093242",
  "epoch": 1748217798,
  "date": "2025-05-26T00:03:18+00:00",
  "company": "Distru",
  "company_logo": "https://remoteok.com/assets/img/jobs/f7670b3fd8f8ca77dc081af02eca35d71748217798.png",
  "position": "Implementation Specialist",
  "tags": [
    "training",
    "cfo",
    "technical",
    "software",
    "happiness",
    "management",
    "operations",
    "sales",
    "engineering",
    "full-time"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/f7670b3fd8f8ca77dc081af02eca35d71748217798.png",
  "description": "<p><b style=\"font-size: 18px;\">Salary</b></p><p><span style=\"font-size: 18px;\">$80,000/year plus bonus</span></p><p>The starting compensation for this role is $80,000/year base + bonus based on NRR attainment</p><p><br></p><p><b style=\"font-size: 18px;\">Powering Trade For The Emerging Cannabis Industry</b></p><p><span style=\"font-size: 10pt;\">Distru is the </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 10pt;\" href=\"https://www.g2.com/products/distru/reviews\">#1 ERP in the Cannabis Industry</a><span style=\"font-size: 10pt;\"> with $8B in sales processed through our platform! We are a fully remote and global team building a software platform to streamline the supply chain for the cannabis industry. Most of the top cannabis brands and distributors across the United States use our software to manage their entire operation and stay compliant. We take a tremendous amount of pride in our culture and have </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 10pt;\" href=\"https://www.glassdoor.com/Reviews/Distru-Reviews-E2957092.htm\">4.8/5 stars on Glassdoor</a><span style=\"font-size: 10pt;\"> because we truly care about our people. We are stable, </span><b style=\"font-size: 10pt;\">profitable</b><span style=\"font-size: 10pt;\">, and heavily investing in growing new product lines to expand our reach. Our investors include </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 10pt;\" href=\"https://www.felicis.com/\">Felicis Ventures</a><span style=\"font-size: 10pt;\">, </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 10pt;\" href=\"https://www.globalfounders.vc/\">Global Founders Capital</a><span style=\"font-size: 10pt;\">, </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 10pt;\" href=\"https://www.poseidonassetmanagement.com/\">Poseidon Asset Management</a><span style=\"font-size: 10pt;\">, and </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 10pt;\" href=\"https://www.villageglobal.vc/\">Village Global</a><span style=\"font-size: 10pt;\"> who have funded companies such as Shopify, Cruise, HelloFresh, Facebook, Slack, and Opendoor.</span></p><p><br></p><p><b style=\"font-size: 18px;\">Our Team Culture</b></p><p><span style=\"font-size: 10pt;\">Rather than us defining our culture, </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 10pt;\" href=\"https://www.glassdoor.com/Reviews/Distru-Reviews-E2957092.htm\">check out what the team has to say!</a><span style=\"font-size: 10pt;\">&nbsp;</span></p><p><br></p><p><b style=\"font-size: 18px;\">About the Opportunity</b></p><p>We are an intrinsically motivated team that works without ego, is constantly learning, and gains a deep sense of satisfaction when our customers email us thank you letters like this one:</p><p><br></p><p><i>\"I canâ\u0080\u0099t praise Distru enough, itâ\u0080\u0099s head and shoulders above any platform Iâ\u0080\u0099ve encountered to date. Thank you for your persistence and providing us with the right tools.\"&nbsp;</i></p><p><br></p><p>You will be working closely with the customer success team and take ownership over making sure our customers are able to use Distru to its fullest to stay compliant and efficient in the cannabis industry. You are passionate about helping people and customer-obsessed. You enjoy and are exceptional at building relationships. You thrive working with a positive team and staying organized. You get excited about the success of Distru customers that will in turn help them build a thriving business in a fascinating growing market. </p><p><br></p><p>In addition to our competitive pay plan with equity, we will actively enable you to reach your career goals and grow with us. </p><p><br></p><p>We are constantly learning and solving real problems for the cannabis industry. The success of this industry matters! </p><p><br></p><p>This is a remote full-time opportunity. </p>\\n<p></p><p><br></p><b>Things you may work on </b><ul><li>Manage customers through onboarding driving education, solutions, and their perceived business outcomes&nbsp;</li><li>Manage a book of business of customers and drive account expansion, happiness and retention</li><li>Interact with customers on a daily basis, responding to their questions and guiding them to the appropriate solutions</li><li>Update customer information in the customer service database during and after interactions</li><li>Stay updated on product knowledge and be informed of how it affects your customers</li><li>Appropriately manage accounts to maximize their revenue and value received</li><li>Break down customer workflows with high detail to isolate bottlenecks and recommend real-world creative solutions</li><li>Drive usage of new features and workflows&nbsp;</li><li>Give regular actionable product feedback/recommendations</li><li>Innovate on customer training with new or improved tools and strategies</li><li>Maintaining a high level of professionalism with clients and working to establish a positive rapport with every interaction</li><li>Work cross-functionally with customer success teammates, engineering, product, and sales</li></ul><p><br></p><b>Desired Experience </b><ul><li>A strong desire to learn and succeed in supporting the cannabis industry and the operations in it</li><li>2+ year experience in the cannabis industry or adjacent industry i.e. supply chain, wine/beer, ERP, etc. is a major bonus </li><li>Personally educated humans to use a tool or learn a concept</li><li>Proposes solutions, doesn't just point out problems</li><li>Organized and managed customer and/or peer relationships</li><li>Curiosity and/or deep knowledge of our customers and their business models</li><li>Exceptional organizational, presentation, and communication skills, both verbal and written</li></ul><div><br></div><div>Preferred not required</div><ul><li>Previous experience using or working with ERP, supply chain, SaaS, or other Cannabis technology</li><li>Strong and proven track record of successfully managing client relationships and technical projects</li><li>Worked directly with a product and/or engineering team to prioritize customer requests</li><li>Financial background and/or working closely with a CFO </li><li>Enterprise-level onboarding customer management </li><li>Organized, grown, and managed a book of business to increase revenue</li><li>Managed a multi-step onboarding process  </li></ul><p><br></p><b>Benefits</b><ul><li>Fully remote work environment. We have teammates in 4 continents!</li><li>Competitive medical, dental and vision plan options for the employee and their dependents&nbsp;</li><li>18 days Paid Time Off (We want you to use these!) + 11 Holidays. Sick days do not count toward these</li><li>Competitive compensation structure</li></ul><p><br></p><p></p>\\n<p>Once youâ\u0080\u0099re a part of the Distru team, it is our job to make sure that youâ\u0080\u0099re empowered to build high-quality service that you believe in. We are a lean startup team and want everyone to feel like they have a real impact on our software and companyâ\u0080\u0099s success. In addition to managing the success of customers, youâ\u0080\u0099ll be working directly with the founding team during the early stages of a fast-growing startup.</p><p><br></p><p>Distru was formed by an environment of mutual respect and trust made up by people working together without regard to race, color, religion, sex, pregnancy (including childbirth, lactation and related medical conditions), national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, gender expression, genetic information (including characteristics and testing), military and veteran status, and any other characteristic protected by law. We believe that diversity and inclusion among our team members is critical to our success and we proactively strive to recruit, develop and retain the best and brightest people from the most diverse candidate pools we can find all over the world.</p><br/><br/>Please mention the word **MAGNANIMOUSLY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Remote",
  "salary_min": 55000,
  "salary_max": 70000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-implementation-specialist-distru-1093242",
  "url": "https://remoteOK.com/remote-jobs/remote-implementation-specialist-distru-1093242"
}