{
  "slug": "remote-data-analyst-foodsmart-1093207",
  "id": "1093207",
  "epoch": 1747785609,
  "date": "2025-05-21T00:00:09+00:00",
  "company": "Foodsmart",
  "company_logo": "https://remoteok.com/assets/img/jobs/f79562259d62997398a7338165cebfb41747785612.png",
  "position": "Data Analyst",
  "tags": [
    "analyst",
    "python",
    "growth",
    "education",
    "investment",
    "operations",
    "health",
    "healthcare",
    "engineering",
    "executive"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/f79562259d62997398a7338165cebfb41747785612.png",
  "description": "<p><b style=\"font-size: 18px\">About us:</b></p><p><span style=\"font-size: 10pt\">Foodsmart is the leading telenutrition and foodcare solution, backed by a robust network of Registered Dietitians. Our platform is designed to foster healthier food choices, drive lasting behavior change, and deliver long-term health outcomes. Through our highly personalized, digital platform, we guide our 2.2 million membersâ\u0080\u0094including those in employer-sponsored health plans, regional and national Medicaid managed care organizations, Medicare Advantage plans, and commercial insurersâ\u0080\u0094on a tailored journey to eating well while saving time and money.</span></p><p><br></p><p><span style=\"font-size: 10pt\">Foodsmart seamlessly integrates dietary assessments and nutrition counseling with online food ordering and cost-effective meal planning for the entire family, optimizing ingredients both at home and on the go. We partner with national and regional retailers across the U.S., many of whom accept SNAP/EBT, making healthier food more accessible. Additionally, we assist members with SNAP enrollment and management, providing tangible access to nutritious </span><a class=\"postings-link\" style=\"font-size: 10pt\" href=\"http://food.in/\">food.In</a><span style=\"font-size: 10pt\"> 2024, Foodsmart secured a $200 million investment from TPGâ\u0080\u0099s Rise Fund, which supports entrepreneurs dedicated to achieving the United Nationsâ\u0080\u0099 Sustainable Development Goals. This investment will help us expand our reach, particularly to low-income workers who are disproportionately affected by diet-related diseases.&nbsp;</span></p><p><br></p><p><span style=\"font-size: 10pt\">At Foodsmart, our mission is to make nutritious food accessible and affordable for everyone, regardless of economic status. We are committed to a set of core values that shape our culture and work environment:</span></p><p><br></p><p><b style=\"font-size: 10pt\">Measured:</b><span style=\"font-size: 10pt\"> We make data-driven, truth-seeking decisions.</span></p><p><b style=\"font-size: 10pt\">Impactful:</b><span style=\"font-size: 10pt\"> We are fueled by achieving our mission and vision.</span></p><p><b style=\"font-size: 10pt\">Collaborative: </b><span style=\"font-size: 10pt\">We help each other be better and create a positive environment.</span></p><p><b style=\"font-size: 10pt\">Hungry:</b><span style=\"font-size: 10pt\"> We maintain a healthy growth mindset, seeking to overcome challenges with courage.</span></p><p><b style=\"font-size: 10pt\">Joyful: </b><span style=\"font-size: 10pt\">We take joy in each other, our work, and the privilege of doing this work.</span></p><p><br></p><p><span style=\"font-size: 10pt\">Whether you're a dietitian, a commercial leader, or a technologist, working at Foodsmart means being part of a team that is passionate, supportive, and driven by a shared purpose. Join us in transforming the way people access and enjoy healthy food.</span></p><p><br></p><p>Learn more at <a class=\"postings-link\" href=\"http://www.foodsmart.com/\">www.foodsmart.com</a></p><p><br></p><p><b>About the role:</b></p><p><br></p><p>The Data Analyst will join our dynamic team responsible for managing and interpreting data to provide actionable insights to our operations and product teams. The Data Analyst is responsible for developing, implementing, and maintaining cutting-edge analytic systems, conducting data analysis to derive business insights, and designing scalable data models and pipelines. This role also involves collaborating closely with stakeholders from various departments to prioritize business and information needs, and presenting data-driven recommendations to the executive team.&nbsp;</p><p><br></p>\\n<p></p><p><br></p><b>You will:</b><ul><li>Own the development, implementation, and maintenance of advanced analytic systems, simplifying intricate problems through streamlined frameworks.</li><li>Conduct thorough data analysis to uncover valuable business insights, trends, and growth opportunities.</li><li>Design, build, and manage scalable data models and pipelines within our data warehouse.</li><li>Identify, interpret, and analyze patterns and trends within complex datasets.</li><li>Collaborate closely with stakeholders in Marketing, Sales, Product, and Engineering to prioritize data-driven decision-making.</li></ul><div><br></div><p><br></p><b>You are:</b><ul><li>Proactive and act as an advocate for your customers&nbsp;</li><li>Take pride in your work and approach every project with enthusiasm and excitement&nbsp;</li><li>Experienced in&nbsp; data warehousing, data design, and data analysis.&nbsp;</li><li>Knowledgeable of healthcare industry standards and compliance regulations.</li></ul><p><br></p><b>You have:</b><ul><li>Accumulated 2+ years of experience in a data analyst role, preferably within healthcare or startup environments.</li><li>Proficiency in SQL and other data manipulation languages.</li><li>Experience with business intelligence tools such as Tableau, Looker, or Power BI.</li><li>Proficiency in at least one scripting language, with a preference for Python or R.</li><li>A self-starting attitude, capable of thriving in a fast-paced, agile environment.</li><li>Familiarity with ETL (Extract, Transform, Load) processes.</li><li>Understanding of machine learning algorithms and statistical models.</li></ul><p><br></p><p></p>\\n<div>$103,000 - $135,000 a year</div><small><div>Role: Data Analyst</div><div>Location:&nbsp; Remote</div><div>Base Salary Range: $103,000/yr to $135,000/yr + equity + benefits</div><div><br></div><div><span style=\"font-size: 10pt\">Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries at our headquarters in San Francisco, California. Individual pay is determined by work location, job-related skills, experience, and relevant education or training.</span></div></small>\\n<p><b style=\"font-size: 18px\">About our benefits and perks:</b></p><p><br></p><p>Remote-First Company</p><p>Unlimited PTO</p><p>Healthcare Coverage (Medical, Dental, Vision)</p><p>401k, bonus, &amp; stock options</p><p>Gym reimbursement&nbsp;</p><p><br></p><br/><br/>Please mention the word **WOWED** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "US",
  "salary_min": 75000,
  "salary_max": 110000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-data-analyst-foodsmart-1093207",
  "url": "https://remoteOK.com/remote-jobs/remote-data-analyst-foodsmart-1093207"
}