{
  "slug": "remote-ai-technical-program-manager-dscout-1093243",
  "id": "1093243",
  "epoch": 1748217810,
  "date": "2025-05-26T00:03:30+00:00",
  "company": "Dscout",
  "company_logo": "https://remoteok.com/assets/img/jobs/d4ab63e6f4ee7446428d4b0c30dc4d791748217811.png",
  "position": "AI Technical Program Manager",
  "tags": [
    "manager",
    "full-stack",
    "technical",
    "support",
    "software",
    "test",
    "growth",
    "code",
    "education",
    "leader",
    "lead",
    "content",
    "senior"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/d4ab63e6f4ee7446428d4b0c30dc4d791748217811.png",
  "description": "<p><span style=\"font-size: 16px\">Dscout is a flexible Experience Research Platform for capturing in-context insights from high-quality participants, bridging the gap between product teams and users. Leading brands like Sonos, Spotify, Duolingo and Best Buy use Dscout to test ideas, iterate quickly, collaborate, and build confidently. We are expanding our smart and driven team and would love for you to join us.</span></p><p><br></p><p><span style=\"font-size: 16px;\">As Dscoutâ\u0080\u0099s </span><b style=\"font-size: 16px;\">AI Technical Program Manager</b><span style=\"font-size: 16px;\">, you will report directly to our Head of AI and spearhead efforts to harness breakthroughs in ML/AI. You will lead a full-stack team of experts in user research, AI, and software development, driving the strategic direction and execution of AI-powered initiatives. Your role will be critical in project managing a cross-functional team and delivering innovative features - from initial research to production - advancing Dscoutâ\u0080\u0099s AI capabilities and product offerings.</span></p><p><br></p><p><b style=\"font-size: 16px;\">Working Hours</b></p><p><span style=\"font-size: 16px;\">Standard Hours: 9:00 AM â\u0080\u0093 5:00 PM CT</span></p><p><span style=\"font-size: 16px;\">While working these core hours is expected in this role, we know that from time-to-time life happens and we can be flexible to meet your needs.</span></p>\\n<p></p><p><br></p><b>What you will do:</b><ul><li>6-8 years of experience</li><li>Lead a cross-functional team to drive AI/ML exploration and development.</li><li>Influence the strategic direction and define roadmaps for AI/ML exploration, aligning it with the overall business objectives and user research goals.</li><li>Design and execute cross-functional experiments and studies to explore the capabilities and potential applications of AI/ML in user research.</li><li>Collaborate with other stakeholders, such as product managers, designers, and engineers, to integrate AI/ML findings into product development processes and drive user-centric decision-making.</li><li>Stay up-to-date with the latest developments and advancements in AI/ML technology, user research methodologies, and industry trends, and apply this knowledge to continuously improve the team's approaches and methodologies.</li><li>Communicate and present research findings, insights, and recommendations to internal and external stakeholders, including senior management, product teams, and customers, in a clear and concise manner.</li></ul><p><br></p><b>What you need to have:</b><ul><li>Advanced degree in a relevant field such as computer science, data science, human-computer interaction, or related disciplines.</li><li>Proficiency in programming languages commonly used in AI, such as Python, and experience with data analysis techniques.</li><li>Strong expertise in large language models, and their applications in natural language processing, sentiment analysis, and content generation.</li><li>Proven experience in leading teams and managing complex projects in the field of user research, AI, machine learning, or related areas.</li><li>Strong product orientation and experience being part of teams that ship machine learning and AI code to production.</li><li>Solid understanding of user research methodologies, data analysis, and statistical techniques.</li><li>Excellent communication skills, both written and verbal, with the ability to effectively convey complex research findings to diverse audiences.</li><li>Ability to work in a fast-paced, collaborative, and dynamic environment, and adapt to changing priorities and requirements.</li><li>Strong analytical, critical thinking, and problem-solving skills, with a keen eye for detail and accuracy.</li><li>Passion for innovation, curiosity, and a drive to push the boundaries of what is possible in user research using AI/ML.</li></ul><p><br></p><p></p>\\n<p><span style=\"font-size: 16px\">Of course, what is outlined above is an ideal set of expectations, but things may shift based on business needs, and other projects and tasks could be added at the discretion of your manager.</span></p><p><br></p><p><b><span style=\"font-size: 16px\">About Dscout </span></b></p><p><br></p><p><span style=\"font-size: 16px\">Dscout is a team of passionate, empathetic, and curious professionals. As a recognized leader in the Forrester Wave, weâ\u0080\u0099re at the cutting edge of experience research technology. The power of research drives usâ\u0080\u0094how in-context insights from real people can build more enjoyable products and services.&nbsp;</span></p><p><span style=\"font-size: 16px\">We prioritize learning, sharing, and building. We also deeply value being a diverse and inclusive team and company and look for team members who align with that belief. Join our dynamic team and help shape product roadmaps and business strategies for the worldâ\u0080\u0099s most loved brands.</span></p><p><br></p><p><span style=\"font-size: 16px\">It doesn't stop there. When you join the Dscout team, you will get:</span></p><p><br></p><p><span style=\"font-size: 16px\">* A strong and competitive compensation package with a built-in bonus and equity program.</span></p><p><span style=\"font-size: 16px\">* An incredible and progressive benefits package (for both you and your dependents) to support work/life balance, including flexible PTO, 16 company holidays, 12 weeks of paid parental leave, 401k match, and much more.</span></p><p><span style=\"font-size: 16px\">* An education stipend to support your growth &amp; development and a remote work stipend.</span></p><p><span style=\"font-size: 16px\">* A company that is open and transparent with our team. You will know what is happening and why it matters.</span></p><p><br></p><p><br></p><p><span style=\"font-size: 16px\">Dscout is an equal-opportunity employer that values diversity. We do not discriminate based on identity, including race, color, religion, national origin or ancestry, sex, gender identity and expression, age, physical or mental disability, pregnancy, veteran or military status, unfavorable discharge from military service, genetic information, sexual orientation, marital status, order of protection status, citizenship status, arrest record or expunged or sealed convictions, or any other legally recognized protected basis under federal, state, or local law.</span></p><p><br></p><p><span style=\"font-size: 16px\">If you need reasonable accommodations for any part of the employment process, please email us at accommodations@dscout.com with the nature of your request and your contact information. We'll do all we can to ensure you're set up for success during our interview process while upholding your privacy, including accommodation requests. Please note that only inquiries concerning a request for reasonable accommodation will be responded to from this email address.</span></p><p><br></p><p><span style=\"font-size: 16px\">When you apply at Dscout, we will process your job applicant data, including your employment and education history, transcript, writing samples, and references, as necessary to consider your job application for open positions. For more information about our privacy practices, please visit our&nbsp;Privacy Policy.&nbsp;</span></p><p><br></p><p><span style=\"font-size: 16px\">Dscout participates in the E-Verify program in certain locations, as required by law.</span></p><p><br></p><p><span style=\"font-size: 16px\">NOTE: DSCOUT NEVER CONTACTS JOB APPLICANTS VIA TEXT, MESSENGER, OR OTHER SIMILAR APPLICATIONS. BE AWARE OF PHISHING AND SPOOFING SCAMS, BOTH VIA TEXT AND EMAIL. ONLY RESPOND TO EMAILS FROM DSCOUT.COM</span></p><p><br></p><p><span style=\"font-size: 16px\">#BI-Remote</span></p><p><span style=\"font-size: 16px\">#LI-Remote</span></p><br/><br/>Please mention the word **NOVELTY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "United States",
  "salary_min": 80000,
  "salary_max": 130000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-ai-technical-program-manager-dscout-1093243",
  "url": "https://remoteOK.com/remote-jobs/remote-ai-technical-program-manager-dscout-1093243"
}