{
  "slug": "remote-member-support-unicorn-interaction-design-foundation-1093181",
  "id": "1093181",
  "epoch": 1747309301,
  "date": "2025-05-15T11:41:41+00:00",
  "company": "Interaction Design Foundation",
  "company_logo": "https://remoteOK.com/assets/img/jobs/f3f7a071bb3f69e3d4e2050f7ef3aeee1747309301.png",
  "position": "Member Support Unicorn",
  "tags": [
    "admin",
    "customer support",
    "social media"
  ],
  "logo": "https://remoteOK.com/assets/img/jobs/f3f7a071bb3f69e3d4e2050f7ef3aeee1747309301.png",
  "description": "<p>Imagine waking up each day<strong>Â excited for work</strong>, knowing that your efforts contribute to aÂ <strong>global movementÂ </strong>that impacts the world. If youâ\u0080\u0099re ready for a career transformation, then we have an exhilarating opportunity for you at the Interaction Design Foundation (IxDF)!</p><p>Join us, and you wonâ\u0080\u0099t just be changing jobsâ\u0080\u0094youâ\u0080\u0099ll be elevating your career on a global scale. At IxDF, weâ\u0080\u0099re not just a company; weâ\u0080\u0099re a movement dedicated to making high-quality design education accessible to everyone, everywhere. With team members and learners from over 100 countries, your role at IxDF will have a worldwide impact. From engaging with diverse cultures to contributing to a platform that reaches millions, your daily activities will be anything but ordinary.</p><h2><strong>Our Commitment to Our Members</strong></h2><p>At the core of every decision we make and every strategy we implement lies our unwavering commitment to our membersâ\u0080\u0094they are the fundamental reason for our existence. This profound dedication drives us to exceed their expectations at every turn. We are on the lookout for a candidate who embodies our ethos: someone who is not only exceptionally talented and diligent but who also possesses a profound empathy for our learners' needs and a relentless pursuit of excellence. Your role will be pivotal in ensuring that each member feels valued, supported, and inspired throughout their educational journey with us.</p><h2><strong>Your place in the IxDF Universe</strong></h2><ul><li><p><strong>Correspond daily with members and prospective learners</strong>Â across multiple channelsâ\u0080\u0094email, chat, and social mediaâ\u0080\u0094providing quick, accurate responses to their questions. Youâ\u0080\u0099ll troubleshoot issues, offer guidance, and ensure a seamless user experience.</p></li><li><p><strong>Act as a brand ambassador</strong>Â by upholding our excellent reputation in every interaction. Youâ\u0080\u0099ll communicate our mission and values clearly, taking pride in representing a global community dedicated to design education. Itâ\u0080\u0099s a big responsibility, but also incredibly rewarding!</p></li><li><p><strong>Collaborate cross-functionally</strong>Â with teams across the organization to improve internal workflows and enhance the platformâ\u0080\u0099s user experience. Youâ\u0080\u0099ll be the bridge between departments, ensuring that our operations are efficient and focused on delivering the best outcomes for our members.</p></li><li><p><strong>Support our Growth team</strong>Â in executing digital marketing initiatives, including managing paid media campaigns and overseeing content and engagement across our social media channels.<br /></p></li><li><p><strong>Perform general administrative and ad-hoc project support</strong>, assisting extended team members as needed. Whether itâ\u0080\u0099s organizing tasks, scheduling, or helping with project coordination, youâ\u0080\u0099ll ensure everything runs smoothly and efficiently.</p></li><li><p><strong>Maintain and improve documentation</strong>Â by ensuring that our knowledge resources are up-to-date, easy to access, and provide value to both our internal teams and learners. Your work will directly contribute to helping others succeed.</p></li><li><p><strong>Shape internal processes</strong>Â that directly impact engagement and key performance indicators (KPIs). Youâ\u0080\u0099ll analyze workflows and recommend improvements to help us provide even better services for our members.</p></li><li><p><strong>Update our internal knowledge base</strong>Â and contribute to department-wide initiatives focused on knowledge sharing. Youâ\u0080\u0099ll ensure that important insights and best practices are easily available to all, driving continuous improvement.</p></li><li><p><strong>Communicate and collaborate effectively</strong>Â with other teams to relay customer needs and insights. By sharing valuable feedback, youâ\u0080\u0099ll help us maximize retention, improve member satisfaction, and drive growth.</p></li><li><p><strong>Embody our values</strong>Â as you are often the first point of contact for our community. Youâ\u0080\u0099ll play a key role in welcoming and supporting members, helping our foundation grow and strengthen through meaningful interactions.</p></li><li><p><strong>Take full accountability for your tasks</strong>, managing your responsibilities with independence and self-discipline. Youâ\u0080\u0099ll consistently deliver high-quality results, meet deadlines, and maintain focus while balancing multiple priorities with minimal supervision.</p></li></ul><h2><strong>About You</strong></h2><ul><li><p><strong>You thrive in a fast-paced environment</strong>Â where you handle ad-hoc projects of varying complexities with ease and enthusiasm.</p></li><li><p><strong>You have experience in customer success</strong>, with bonus points if youâ\u0080\u0099ve worked in digital marketing or managed social media channels.<br /></p></li><li><p><strong>Helping people excites you</strong>, and you take pride in earning their gratitude through your support and problem-solving skills.</p></li><li><p><strong>You are resourceful and autonomous</strong>, always ready to take on new tasks and projects with a problem-solving mindset that ensures everything gets done efficiently.</p></li><li><p><strong>Attention to detail and thoroughness</strong>Â come naturally to you. You enjoy ensuring that every task is completed with care and precision.</p></li><li><p><strong>You relish solving problems</strong>â\u0080\u0094especially the ones that haven't even been noticed yet. Meeting specific needs of different people brings you satisfaction, and you enjoy proactively addressing challenges before they arise.</p></li><li><p>You areÂ <strong>fluent in written and spoken English</strong> with exceptional writing skills, perfect grammar and an appreciation for the power of tone, brevity and microcopy.</p></li><li><p><strong>You take full ownership of tasks</strong>, knowing what it means to see something through to completion and deliver high-quality results.</p></li><li><p><strong>Consistency is key for you</strong>, and you stay focused even when tasks become repetitive, ensuring nothing slips through the cracks.</p></li><li><p><strong>You are comfortable with tight deadlines</strong>Â and excel at prioritizing tasks to meet them, keeping projects on track.</p></li><li><p><strong>Resilience is one of your strengths</strong>, and when things go off-track, you bounce back quickly, offering valuable solutions to move forward.</p></li><li><p><strong>You are highly self-disciplined</strong>, thriving in a flat hierarchy where you enjoy the freedom and minimal supervision that comes with it.</p></li><li><p><strong>You are located within a time zone</strong>Â from Europe (UTC+0) to East Asia (UTC+8), making it easy to collaborate with our global team.</p></li></ul><h2><strong>Bonus Points</strong></h2><ul><li><p><strong>You get bonus points</strong>Â if the art of writing isnâ\u0080\u0099t just a skill, but a passion. You find joy in crafting each sentence with care and precision.</p></li><li><p><strong>You have a genuine curiosity about user experience (UX) design</strong>Â and are interested in how it can improve the quality of life for people around the world.</p></li><li><p><strong>You love making complex concepts accessible</strong>, and you enjoy teaching or explaining ideas in a way thatâ\u0080\u0099s engaging and easy to understand.</p></li><li><p><strong>You have an exceptional talent for creating structure</strong>, and you take pride in organizing processes and tasks in a way thatâ\u0080\u0099s efficient and clear.</p></li></ul><h2><strong>What We Can Offer</strong></h2><ul><li><p><strong>A highly valued role</strong>: Many organizations undervalue admin and support employees, but at IxDF, youâ\u0080\u0099ll be joining one of our most valued and cherished teams. Your contributions will be recognized as essential to our success.</p></li><li><p><strong>Opportunities for growth and impact</strong>: At IxDF, youâ\u0080\u0099ll have room to grow professionally while making a real difference. Youâ\u0080\u0099ll contribute to projects that directly impact our global community, adding value to the educational experience of thousands of learners.</p></li><li><p><strong>A Global, Purpose-Driven Team</strong>Â â\u0080\u0093 Work alongsideÂ <strong>passionate professionals</strong>Â from all over the world, united by a common mission.</p></li><li><p><strong>Engagement with a Thriving Global Community</strong>Â â\u0080\u0093 Youâ\u0080\u0099ll have the opportunity to support and interact with ourÂ <strong>local groups, educational partners, and community initiatives</strong>. Whether itâ\u0080\u0099s helping organizeÂ <strong>IxDF Local Groups</strong>, facilitating partnerships with educational institutions, or engaging with our vibrantÂ <strong>design community</strong>, your work will contribute to aÂ <strong>stronger, more connected global network of UX professionals and learners</strong>.</p></li><li><p>AÂ <strong>full-time position</strong>, within a fully remote organization. DailyÂ <strong>video-based collaboration</strong>Â with your colleagues from elsewhere on the planet, and youâ\u0080\u0099ll get to meet up on team trips every year.</p></li><li><p>A work culture with noÂ <strong>fluffy titles, political agendas and corporate drama</strong>. Your colleagues valueÂ <strong>your warm character, your strong work ethic, and the results you deliver.</strong>Â Junior or senior, if you embody old-school virtues of always striving to deliver results, learn and become better every day, you'll thrive at the IxDF.</p></li><li><p>A daily mission to help impact,Â <strong>empower, and enrich the lives of millions of people</strong>Â by creatingÂ <strong>affordable high-end design education</strong>Â for everyone across the planet. Itâ\u0080\u0099ll be yours too.</p></li><li><p>A companyÂ <strong>where the distance between idea and execution is minimal.Â </strong>Weâ\u0080\u0099re a highly agile organization withÂ <strong>zero bureaucracy or corporate politics</strong>Â â\u0080\u0093 and withÂ <strong>exceptional order and efficiency</strong>.</p></li><li><p>A company culture where<strong>Â passion meets high performance and excellence</strong>. To help us improve the world (and yourself in the process),Â <strong>youâ\u0080\u0099ll need grit, strong work ethic, long-term thinking, and self-discipline</strong>.</p></li><li><p>We thrive because we have aÂ <strong>hands-on attitude and a bias towards action</strong>Â as opposed to fluff-filled, unrealistic strategies. Youâ\u0080\u0099ll needÂ <strong>crisp execution skills yourself</strong>Â and the ability toÂ <strong>impress your colleagues with concrete results</strong>, just like theyâ\u0080\u0099ll impress you.</p></li></ul><h2><strong>How to Learn More and ApplyÂ </strong>Â </h2><p>To submit your application as well as learn more about our Work Culture and Values, please visitÂ <a href=\"https://www.interaction-design.org/about/careers\">https://www.interaction-design.org/about/careers</a>Â </p><p>Please apply as soon as you canâ\u0080\u0094weâ\u0080\u0099re firm believers of â\u0080\u009cthe sooner, the betterâ\u0080\u009d and weâ\u0080\u0099re looking forward to working with you!Â </p><br/><br/>Please mention the word **LUCRATIVE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 10000,
  "salary_max": 750000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-member-support-unicorn-interaction-design-foundation-1093181",
  "original": true,
  "url": "https://remoteOK.com/remote-jobs/remote-member-support-unicorn-interaction-design-foundation-1093181"
}