{
  "slug": "remote-project-manager-rainfocus-1093239",
  "id": "1093239",
  "epoch": 1748217777,
  "date": "2025-05-26T00:02:57+00:00",
  "company": "RainFocus",
  "company_logo": "https://remoteok.com/assets/img/jobs/5bbd781ca3110bd7609da4c2f633fee61748217777.png",
  "position": "Project Manager",
  "tags": [
    "manager",
    "training",
    "consulting",
    "technical",
    "support",
    "software",
    "travel",
    "financial",
    "microsoft",
    "management",
    "marketing"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/5bbd781ca3110bd7609da4c2f633fee61748217777.png",
  "description": "<p><b>RainFocus, one of the most innovative software companies, is in search of an exceptional Project Manager.</b></p><p>&nbsp;</p><p><b>About RainFocus</b></p><p>RainFocus cares about its employees, customers, and the world in which we live. Our rapidly growing team serves Fortune 500 companies like Adobe, Cisco, IBM, Oracle, VMware, and others to prepare and execute in-person, virtual, and hybrid events, across the world. Those events are delivered through our industry-disrupting software platform, with groundbreaking business intelligence, to elevate the attendee experience, streamline event operations, and accelerate marketing results. We are well-funded, growing fast, and building a company that is changing the market â\u0080\u0094 it will be challenging, fun and exciting.</p><p><br></p><p><b>About the Role</b></p><p>Strong project management is a key element of client success at RainFocus. Our project managers are given the autonomy, authority and responsibility of owning and driving project execution and value creation for our clients.</p><p><br></p><p>The Project Manager is a member of our client services team and works closely with clients and internal teams to deploy RainFocus software in support of their event lifecycle. This role plans and drives project implementation; identifies and manages project scope, goals and deliverables; defines tasks and required resources; and disentangles escalations to ensure achievement of project timelines and positive client outcomes.</p><p><br></p><p>This remote role can be located anywhere in the United States of America. Total travel could be up to 20% average 5-7 days in a row. The nature of the travel is being onsite at client events, which may include weekends.&nbsp; Travel may also include post-conference meetings or other client-driven meetings. However, this role will be needed to work 11:00 a.m. - 8:00 p.m. PST.</p>\\n<p></p><p><br></p><b>How You Will Contribute</b><ul><li><b>Planning</b></li><li>Align with clients on key project milestones</li><li>Build and maintain project plans<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"#_msocom_1\">[1]</a>&nbsp;</li><li>Identify and manage dependencies, risks and priorities</li><li>Coordinate multiple work streams to remove obstacles</li><li>Participate in pre-sales planning as a member of client account teams</li><li>Identify and engage appropriate resources across client and RainFocus teams</li></ul><div><br></div><ul><li><b>Communications</b></li><li>Document project activities and status</li><li>Communicate formal weekly status to client &amp; RainFocus stakeholders o Communicate with event steering teams and executive-level committees</li><li>Co-facilitate workshops with clients and solution consultants and architects to define configuration requirements and capture action plans</li><li>Solicit feedback from clients and team members to drive prioritization</li><li>Coordinate post-event reviews between client and RainFocus account team</li><li>Surface decision points and escalations to stakeholders to remove obstacles</li></ul><div><br></div><ul><li><b>Change management</b></li><li>Provide change management support for first-year event clients</li><li>Ensure necessary training is provided to clients and partners to ensure effective adoption of new processes and technology</li><li>Identify impacts to the necessary roles or responsibilities within client teams and escalate resource constraints where needed</li></ul><div><br></div><ul><li><b>Project controls</b></li><li>Manage expectations, scope and priorities of implementation</li><li>Ensure that all project artifacts are captured and maintained</li><li>Monitor and manage project financial performance against targets</li><li>Manage and present change orders for customers to identify tasks and deliverables outside of the original scope of work project plans</li></ul><p><br></p><b>Qualifications</b><ul><li>4+ years project management experience including skills in software implementation, schedule, cost, and risk management</li><li>Ability to utilize various project management tools to coordinate and manage complex projects</li><li>Strong written and verbal communication skills</li><li>Excellent interpersonal, organizational, analytical, and follow-up skills</li><li>Working knowledge of Google and Microsoft Office suite and familiarity with Smartsheet</li><li>Highly self-motivated, autonomous self-starter with excellent follow-through, and takes ownership</li><li>Strong technology acumen and a love of researching new solutions to enhance the event experience and improve event operations</li><li>Experience working in a consulting environment or client-facing role</li><li>Experience designing large-scale complex solutions without losing sight of the details</li><li>Highly detail oriented with proven ability to document systems and processes</li><li>Must be able to work 11:00 a.m. - 8:00 p.m. PST.</li></ul><p><br></p><b>Preferred Qualifications</b><ul><li>Event industry experience a plus</li><li>PMP certification a plus</li><li>Solution-oriented, positive, patient, and persistent in the face of technical and organizational challenges</li><li>Ability to take initiative</li><li>Challenger mentality with the ability to drive client discussions â\u0097\u008f Ability to organize ambiguous ideas into concrete deliverables</li><li>Able to prioritize competing deadlines</li><li>Determined, strong and organized leader</li><li>Team-player</li><li>Self-motivated</li></ul><p><br></p><p></p>\\n<p><b>Location/Travel</b></p><p>This remote role can be located anywhere in the United States of America.&nbsp; Total travel could be up to 20%. The nature of the travel is being onsite at client events, which may include weekends, as well as postmortem and client-driven meetings.</p><p><br></p><p><b>Why work at RainFocus?</b></p><p>At RainFocus we delight millions of attendees at large-scale events by delivering better insights, experiences, and marketing. We were able to pivot our product and services offering in 2020 to continue growing and serving new clients and events.</p><p><br></p><p>As a member of the RainFocus team, you will have the opportunity to experience first-hand the impact of our platform at events around the world. Additionally, RainFocus offers competitive salaries, competitive benefits, 401k, generous PTO, and countless other team building activities.&nbsp;</p><p><br></p><p>What are you waiting for? Apply today! <i>We need more talented, hard-working, fun-loving team members just like yourself!</i></p><br/><br/>Please mention the word **BECKONS** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Lehi, Utah",
  "salary_min": 92500,
  "salary_max": 107500,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-project-manager-rainfocus-1093239",
  "url": "https://remoteOK.com/remote-jobs/remote-project-manager-rainfocus-1093239"
}