{
  "slug": "remote-physician-included-health-1093231",
  "id": "1093231",
  "epoch": 1748217685,
  "date": "2025-05-26T00:01:25+00:00",
  "company": "Included Health",
  "company_logo": "https://remoteok.com/assets/img/jobs/4d48348c5fb41d12418765e3fbc64db11748217686.png",
  "position": "Physician",
  "tags": [
    "support",
    "medical",
    "health",
    "healthcare",
    "recruiting",
    "non tech"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/4d48348c5fb41d12418765e3fbc64db11748217686.png",
  "description": "<p><b>Included Health</b>&nbsp;is seeking experienced and mission-driven&nbsp;<b>Remote Physicians</b>&nbsp;to support our fast-growing virtual care team. If you're passionate about transforming healthcare and providing high-quality, accessible care to diverse populations across the country, weâ\u0080\u0099d love to hear from you.</p><p><br></p><p>This is a general interest posting. By applying, youâ\u0080\u0099ll be considered for future openings aligned with your licensure, specialty, and availability.</p><p><br></p><p><b>What to Expect:</b></p><p>Submitting your information will allow our recruiting team to consider you for future roles as they open up, based on your specialty, availability, and licensing footprint.</p>\\n<p></p><p><br></p><p></p>\\n<p>#LI-Remote&nbsp;&nbsp;</p><p>#Remote&nbsp;&nbsp;</p><p>#VirtualCare&nbsp;&nbsp;</p><p>#Telehealth&nbsp;&nbsp;</p><p>#Physician&nbsp;</p><p>#HealthcareJobs&nbsp;</p><p><br></p><p><b style=\"font-size: 18px\">About Included Health</b></p><p><br></p><p>Included Health is a new kind of healthcare company, delivering integrated virtual care and navigation. Weâ\u0080\u0099re on a mission to raise the standard of healthcare for everyone. We break down barriers to provide high-quality care for every person in every community â\u0080\u0094 no matter where they are in their health journey or what type of care they need, from acute to chronic, behavioral to physical. We offer our members care guidance, advocacy, and access to personalized virtual and in-person care for everyday and urgent care, primary care, behavioral health, and specialty care. Itâ\u0080\u0099s all included. Learn more at<b>&nbsp;<a href=\"http://includedhealth.com/\">includedhealth.com</a>. </b></p><p><br></p><p><span style=\"font-size: 11pt\">-----</span></p><p><span style=\"font-size: 10.5pt;\">Included Health is an Equal Opportunity Employer and considers applicants for employment without regard to race, color, religion, sex, orientation, national origin, age, disability, genetics or any other basis forbidden under federal, state, or local law. Included Health considers all qualified applicants with arrest or conviction records in accordance with the San Francisco Fair Chance Ordinance, the Los Angeles County Fair Chance Ordinance, and California law.</span></p><br/><br/>Please mention the word **UNQUESTIONABLE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Remote",
  "salary_min": 50000,
  "salary_max": 70000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-physician-included-health-1093231",
  "url": "https://remoteOK.com/remote-jobs/remote-physician-included-health-1093231"
}