{
  "slug": "remote-salesforce-lead-bounteous-1093155",
  "id": "1093155",
  "epoch": 1746979219,
  "date": "2025-05-11T16:00:19+00:00",
  "company": "Bounteous",
  "company_logo": "https://remoteok.com/assets/img/jobs/47bd49ba67c90d0c722211e13cad0b021746979219.png",
  "position": "Salesforce Lead",
  "tags": [
    "salesforce",
    "design",
    "security",
    "consultancy",
    "technical",
    "software",
    "management",
    "lead",
    "analytics",
    "legal",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/47bd49ba67c90d0c722211e13cad0b021746979219.png",
  "description": "<p>Bounteous x Accolite is a premier end-to-end digital transformation consultancy dedicated to partnering with ambitious brands to create digital solutions for todayâ\u0080\u0099s complex challenges and tomorrowâ\u0080\u0099s opportunities. With uncompromising standards for technical and domain expertise, we deliver innovative and strategic solutions in Strategy, Analytics, Digital Engineering, Cloud, Data &amp; AI, Experience Design, and Marketing.</p><p><br></p><p>Our Co-Innovation methodology is a unique engagement model designed to align interests and accelerate value creation. Our clients worldwide benefit from the skills and expertise of over 4,000+ expert team members across the Americas, APAC, and EMEA. By partnering with leading technology providers, we craft transformative digital experiences that enhance customer engagement and drive business success.</p><p><br></p><p><b>About Bounteous ( <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://nam12.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.bounteous.com%2F&amp;data=05%7C01%7Csenthilkumar.senguttuvan%40bounteous.com%7C2e50ac4517634bc4a4ce08daed5d305e%7C9d343c00481447ebabcde3a0761d628b%7C1%7C0%7C638083281759333841%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=a0XcamBFzbqJ%2B%2BLi9lvmYKnoG%2FazLW0vX3Pzbd7tMB8%3D&amp;reserved=0\">https://www.bounteous.com/</a> )</b></p><p>Founded in 2003 in Chicago,&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://nam12.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.bounteous.com%2F&amp;data=05%7C01%7Csenthilkumar.senguttuvan%40bounteous.com%7C2e50ac4517634bc4a4ce08daed5d305e%7C9d343c00481447ebabcde3a0761d628b%7C1%7C0%7C638083281759333841%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=a0XcamBFzbqJ%2B%2BLi9lvmYKnoG%2FazLW0vX3Pzbd7tMB8%3D&amp;reserved=0\">Bounteous</a>&nbsp;is a leading digital experience consultancy that co-innovates with the world's most ambitious brands to create transformative digital experiences. With services in Strategy, Experience Design, Technology, Analytics and Insight, and Marketing, Bounteous elevates brand experiences through technology partnerships and drives superior client outcomes. For more information, please visit&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://nam12.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.bounteous.com%2F&amp;data=05%7C01%7Csenthilkumar.senguttuvan%40bounteous.com%7C2e50ac4517634bc4a4ce08daed5d305e%7C9d343c00481447ebabcde3a0761d628b%7C1%7C0%7C638083281759333841%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=a0XcamBFzbqJ%2B%2BLi9lvmYKnoG%2FazLW0vX3Pzbd7tMB8%3D&amp;reserved=0\">www.bounteous.com</a></p>\\n<p></p><p><br></p><b>Information Security Responsibilities</b><ul><li>Promote and enforce awareness of key information security practices, including acceptable use of information assets, malware protection, and password security protocols</li><li>Identify, assess, and report security risks, focusing on how these risks impact the confidentiality, integrity, and availability of information assets</li><li>Understand and evaluate how data is stored, processed, or transmitted, ensuring compliance with data privacy and protection standards (GDPR, CCPA, etc.)</li><li>Ensure data protection measures are integrated throughout the information lifecycle to safeguard sensitive information</li></ul><p><br></p><b>Role and Responsibilities</b><ul><li>Design, develop, test, document, and deploy high quality business solutions on the force.com platform, leveraging design patterns (standards solution specific). Provide the design and estimation for the requirement with defined process and quality</li><li>Build, mentor, train, lead teams </li><li>Conform to software development lifecycle processes and <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://force.com\">force.com</a> configuration best practices during implementation. Partner with functional teams through all phases, independent of the delivery methodology chosen</li><li>Support business development and pre-sales during bids and pursuits; understand business requirements and issues; develop demos and winning solutions to help customers to meet their business objectives</li><li>Proactively communicate with internal teams and clients regarding status, technical issues, and creative solutions</li><li>Engage client; participate in process flow analysis and design</li><li>Demonstrate good judgment and pragmatic approach to deliver solutions on the force.com platform in compliance with the best practices</li></ul><p><br></p><b>Preferred Qualifications </b><ul><li>BE/B.Tech/MCA (Bachelor's Degree preferably in Computer Science) </li><li>6+ years of overall IT experience; 5+ years of hands-on experience developing and delivering solutions on the Salesforce force.com platform including apex, triggers, Batch Apex, Visualforce and Integration with external systems etc. </li><li>Extensive knowledge and expertise within Salesforce and in the use of project management methodologies, tools, resource management practices, change management and project reporting</li><li>Deep understanding of CRM practices</li><li>Excellent communication (verbal and written); articulates clearly, concisely&nbsp;and with context at all times </li><li>Ability to be proactive and work effectively with limited supervision</li><li>High confidence and assertiveness; share concerns and feedback, even during challenging situations</li><li>A collaborative, positive team member who builds good working relationship with team members; foster a cordial work relationship with peers and manager</li><li>Experience with Agile development practices a plus</li></ul><p><br></p><b>Information Security and Data Privacy</b><ul><li>Ensure any sensitive information of the project/organization stays protected as per the guidelines of General Data Protection Regulation (GDPR) and report any breach, vulnerability or threat to the respective Data Protection Officer (DPO) without delay</li><li>Ensure all data of the customer/organization processed must be done on one of the following lawful bases: consent, contract, legal obligation, vital interests, public task or legitimate interests</li><li>Adherence to GDPR and ISMS standards to value privacy at every level</li></ul><p><br></p><p></p>\\n<p>We invite you to subscribe to our monthly and quarterly newsletters to stay up to date with the latest job openings as well as resources and tips for job seekers <a class=\"postings-link\" href=\"https://www.bounteous.com/careers/#recruiting_email_updates\">here</a>.</p><p><br></p><p>Research shows that women and other underrepresented groups apply only if they meet 100% of the criteria of a job posting. If you have passion and intelligence, and possess a technical knack (even if youâ\u0080\u0099re missing some of the above), we encourage you to apply.</p><p><br></p><p>Bounteous is focused on promoting an inclusive environment and is proud to be an equal opportunity employer. We celebrate the different viewpoints and experiences our diverse group of team members bring to Bounteous. Bounteous does not discriminate on the basis of race, religion, color, sex, gender identity, sexual orientation, age, physical or mental disability, national origin, veteran status, or any other status protected under federal, state, or local law. </p><p><br></p><p>In addition, you have the opportunity to participate in several Team Member Networks, sometimes referred to as employee resource groups (ERGs), that host space with individuals with shared identities, interests, and passions. Our Team Member Networks celebrate communities of color, life as a working parent or caregiver, the 2SLGBTQIA+ community, wellbeing, and more. Regardless of your respective identity, there are various avenues we involve team members in the Bounteous community.</p><p><br></p><p>Bounteous is willing to sponsor eligible candidates for employment visas.</p><p><br></p><p><b>#LI-Remote</b></p><br/><br/>Please mention the word **WISELY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "India",
  "salary_min": 60000,
  "salary_max": 130000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-salesforce-lead-bounteous-1093155",
  "url": "https://remoteOK.com/remote-jobs/remote-salesforce-lead-bounteous-1093155"
}