{
  "slug": "remote-meta-ads-specialist-97focus-1093265",
  "id": "1093265",
  "epoch": 1748507260,
  "date": "2025-05-29T08:27:40+00:00",
  "company": "97Focus",
  "company_logo": "https://remoteOK.com/assets/img/jobs/f7055051d2be4a64c6a69f0894e126ca1748507260.png",
  "position": "Meta Ads Specialist",
  "tags": [
    "marketing"
  ],
  "logo": "https://remoteOK.com/assets/img/jobs/f7055051d2be4a64c6a69f0894e126ca1748507260.png",
  "description": "<p>Role Description</p><p>Weâ\u0080\u0099re looking for a Performance Marketing Manager (focus on Meta) to join our team at 97focus. This is a full-time remote position, giving you the flexibility to work from anywhere while staying closely connected with a fast-moving team.</p><p>Youâ\u0080\u0099ll be responsible for driving performance, managing budgets, continuously optimizing campaigns, and turning data into actionable insights. This role requires a strong focus on attention to detail and a mindset of continuous improvement â\u0080\u0094 always looking for ways to test, learn, and refine.</p><p>Responsibilities</p><ul><li>Plan, execute, and optimize paid marketing campaigns (Focus on Meta for now)</li><li>Manage budgets with precision and ensure efficient ROI</li><li>Analyze data and performance metrics to identify trends and opportunities</li><li>Collaborate with creative, sales, and product teams to align messaging and goals</li><li>Report results regularly and suggest experiments for continuous improvement</li></ul><p>Qualifications</p><ul><li>Proven experience in performance marketing with large budget (over $100'000 per month)</li><li>Deep proficiency in Meta Ads Manager (Facebook/Instagram), Google Ads is a plus</li><li>Exceptionally detail-oriented and organized, with a love for process and data</li><li>Strong analytical skills and a track record of data-driven decisions</li><li>Proactive mindset with a passion for testing and optimization</li><li>Self-starter who thrives in a remote work environment and communicates clearly</li></ul><br/><br/>Please mention the word **WHOOOA** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 40000,
  "salary_max": 80000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-meta-ads-specialist-97focus-1093265",
  "original": true,
  "url": "https://remoteOK.com/remote-jobs/remote-meta-ads-specialist-97focus-1093265"
}