{
  "slug": "remote-staff-machine-learning-engineer-warner-music-inc-1093176",
  "id": "1093176",
  "epoch": 1747267220,
  "date": "2025-05-15T00:00:20+00:00",
  "company": "Warner Music Inc.",
  "company_logo": "https://remoteok.com/assets/img/jobs/e5be9d21fbc8e4f83c22267276e570c11747267227.png",
  "position": "Staff Machine Learning Engineer",
  "tags": [
    "music",
    "design",
    "system",
    "training",
    "software",
    "cloud",
    "junior",
    "engineer",
    "engineering",
    "full-time",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/e5be9d21fbc8e4f83c22267276e570c11747267227.png",
  "description": "<p><span style=\"font-size: 16px;\">At Warner Music Group, weâ\u0080\u0099re a global collective of music makers and music lovers, tech innovators and inspired entrepreneurs, game-changing creatives and passionate team members. Here, we turn dreams into stardom and audiences into fans. We are guided by three core values that underpin everything we do across all our diverse businesses:&nbsp;</span></p><p><span style=\"font-size: 16px\">&nbsp;</span></p><p><span style=\"font-size: 16px;\">â\u0080¢ <b>Curiosity</b>: We do our best work when weâ\u0080\u0099re immersing ourselves in culture and breaking through barriers. Curiosity is the driving force behind creativity and ingenuity. It fuels innovation, and innovation is the key to our future.&nbsp;</span></p><p><br></p><p><span style=\"font-size: 16px;\">â\u0080¢ <b>Collaboration</b>: Making music and bringing it to the world is all about the power of originality amplified by teamwork. A great idea, like a great song, travels globally. We ignite passions and build connections across our diverse community of artists, songwriters, partners, and fans.</span></p><p><br></p><p><span style=\"font-size: 16px;\">â\u0080¢ <b>Commitment</b>: We pursue excellence for our team and our talent. Everything in music starts with a leap into the unknown, and weâ\u0080\u0099re committed to keeping the faith, acting with integrity, and delivering on our promises.</span></p><p><br></p><p><span style=\"font-size: 16px\">Technology is one of the most important parts of our business. Whether itâ\u0080\u0099s signing up new artists; ensuring we provide the right data&nbsp;to Spotify, YouTube, and other digital service providers; or helping artists use the latest AI tools and make thoughtful decisions with data-driven insights â\u0080\u0093 technology plays an invaluable role in our success. The engineering team at Warner Music Group makes all of it a reality.&nbsp;</span></p><p><br></p><p><span style=\"font-size: 16px;\">WMG is home to a wide range of artists, musicians, and songwriters that fuel our success. That is why we are committed to creating a work environment that actively values, appreciates, and respects everyone. We encourage applications from people with a wide variety of backgrounds and experiences.</span></p><p><br></p><p><span style=\"font-size: 16px;\">Consider a career at WMG and get the best of both worlds â\u0080\u0093 an innovative global music company that retains the creative spirit of a nimble independent.</span></p><p><br></p><p><span style=\"font-size: 16px;\">At Warner Music Group, we are building cutting edge inference systems to better understand the landscape of music consumption toward the goal of providing actionable insights that drive business growth.&nbsp; We are hiring talented Machine Learning Engineers to collaborate with our Data Science and Data Platform teams in order to build scalable Machine Learning systems that enable rapid iteration, experimentation, and continual improvement in our modeling efforts.&nbsp; Our ideal candidate will have strong ML and Data Science skills along with experience and a passion for building efficient, robust software.</span></p>\\n<p></p><p><br></p><b>Responsibilities:</b><ul><li>Develop a strong understanding of the business problems we are trying to solve.</li><li>Together with tech leadership and data scientists, identify the business problems that are amenable to machine learning solutions.&nbsp; Then own models for those solutions end to end: define, design, train, evaluate, launch, maintain, improve.</li><li>Together with tech leadership and data scientists, identify the systems we need that enable us to scale our model training, iteration, and serving capabilities.&nbsp; Then design, implement, and launch those systems.&nbsp;</li><li>Ensure that we are able to run modeling experiments and launches with maximal efficiency, quality, reliability, and repeatability in a large-scale environment with &gt; 2TB of incoming data per day and a total corpus in excess of 20PB.</li><li>Mentor more junior MLEs and Data Scientists.</li><li>Work closely with cross-functional partners to define project objectives and deliverables.</li></ul><p><br></p><b>Requirements:</b><ul><li>9+ years of full-time hands-on experience building scaled ML systems, training large ML models, or equivalent experience.</li><li>Excellent coding and system design skills.&nbsp; Strong practical ML knowledge, working knowledge of ML theory and how it influences modeling choices.</li><li>Experience using LLMs and other AI techniques in practical contexts.</li><li>High sense of ownership and a drive to deliver impact in a fast-paced, evolving, ambiguous environment</li><li>Ability to collaborate closely with Data Scientists, Software Engineers, and Product Managers.</li><li>Strong communication skills and ability to influence roadmaps and ML strategy.</li><li>Experience with cloud computing services or platforms (preferably AWS)</li><li>Experience with both Snowflake and Databricks is a plus</li><li>Bachelorâ\u0080\u0099s Degree or above in a quantitative field</li></ul><p><br></p><p></p>\\n<p><span style=\"font-size: 16px\">As the home to 10K Projects, Asylum, Atlantic Music Group, East West, FFRR, Fueled by Ramen, Nonesuch, Parlophone, Rhino, Roadrunner, Sire, Warner Records, Warner Classics, and several other of the worldâ\u0080\u0099s premier recording labels, Warner Music Group champions emerging artists and global superstars alike. And our renowned publishing company, Warner Chappell Music, represents genre-spanning songwriters and producers through a catalog of more than one million copyrights worldwide. Warner Music Group is also home to ADA, which supports the independent community, as well as artist services division WMX. In addition, WMG counts film and television storytelling powerhouse Warner Music Entertainment among its many brands.</span></p><p><br></p><p><span style=\"font-size: 16px\">Together, we are Warner Music Group: Independent Minds. Major Sound.</span></p><p><br></p><p><span style=\"font-size: 16px\">Love this job and want to apply?</span></p><p><br></p><p><span style=\"font-size: 16px\">Click the â\u0080\u009cApplyâ\u0080\u009d link at the top of the page, or apply directly with your LinkedIn. Applying with LinkedIn will import all of the information you put in your profile, but will still allow you to upload a resume and cover letter.</span></p><p><br></p><p><span style=\"font-size: 16px\">Donâ\u0080\u0099t be discouraged if you donâ\u0080\u0099t hear from us right away. Weâ\u0080\u0099re taking our time to review all resumes, and to find the best people for WMG.</span></p><p><br></p><p><span style=\"font-size: 16px\">Thanks for your interest in working for WMG.&nbsp; We love it here, and think you will, too.</span></p><p><br></p><p><span style=\"font-size: 16px\">WMG is committed to inclusion and diversity in all aspects of our business. We are proud to be an equal opportunity workplace and will evaluate qualified applicants without regard to race, religious creed, color, age, sex, sexual orientation, gender, gender identity, gender expression, national origin, ancestry, marital status, medical condition as defined by state law (genetic characteristics or cancer), physical or mental disability, military service or veteran status, pregnancy, childbirth and related medical conditions, genetic information or any other characteristic protected by applicable federal, state or local law.</span></p><p><br></p><p><span style=\"font-size: 16px\">Copyright Â© 2025 Warner Music Inc.</span></p><br/><br/>Please mention the word **REFRESHED** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 60000,
  "salary_max": 97500,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-staff-machine-learning-engineer-warner-music-inc-1093176",
  "url": "https://remoteOK.com/remote-jobs/remote-staff-machine-learning-engineer-warner-music-inc-1093176"
}