{
  "slug": "remote-member-of-compliance-sanctions-anchorage-digital-1093202",
  "id": "1093202",
  "epoch": 1747742404,
  "date": "2025-05-20T12:00:04+00:00",
  "company": "Anchorage Digital",
  "company_logo": "https://remoteok.com/assets/img/jobs/f8f2e8245ffd512a3475f0cb40e41d501747742406.png",
  "position": "Member of Compliance Sanctions",
  "tags": [
    "crypto",
    "cryptocurrency",
    "system",
    "security",
    "support",
    "testing",
    "growth",
    "travel",
    "manager",
    "financial",
    "finance",
    "bank",
    "strategy",
    "management",
    "analytics",
    "legal"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/f8f2e8245ffd512a3475f0cb40e41d501747742406.png",
  "description": "<p><span style=\"font-size: 18px\"><b>At Anchorage Digital, we are building the worldâ\u0080\u0099s most advanced digital asset platform for institutions to participate in crypto.</b></span></p><p><br></p><p>Anchorage Digital is a crypto platform that enables institutions to participate in digital assets through custody, staking, trading, governance, settlement, and the industry's leading security infrastructure. Home to Anchorage Digital Bank N.A., the only federally chartered crypto bank in the U.S., Anchorage Digital also serves institutions through Anchorage Digital Singapore, Porto by Anchorage Digital<span style=\"font-size: 15px;\">, and other offerings.</span></p><p><br></p><p>The company is funded by leading institutions including Andreessen Horowitz, GIC, Goldman Sachs, KKR, and Visa, with its Series D valuation over $3 billion. Founded in 2017 in San Francisco, California, Anchorage Digital has offices in New York, New York; Porto, Portugal; Singapore; and Sioux Falls, South Dakota. Learn more at anchorage.com, on X @Anchorage, and on LinkedIn.&nbsp;</p><p><br></p><p>As a Member of Compliance, Sanctions you will assist the Global Compliance Lead, Sanctions in the design, development and roll out of Anchorage Digitalâ\u0080\u0099s Sanctions Compliance Program. You will be an expert with deep understanding and knowledge of regulatory requirements on Sanctions Screening, OFAC Reporting, and Travel Rule/Value Transfer regulations and be able to apply those requirements to support business development and manage risks appropriately for the Company. You will be provided the opportunity to work across different financial crime compliance areas while leveraging intuitive systems, such as blockchain analytics (e.g., TRM Labs, Chainalysis etc.) and screening tools (LexisNexis Bridger). Most importantly, you will be on the front lines of implementing and developing the most advanced Sanctions Compliance program in the digital asset industry.</p><p><br></p><p>You are responsible for the management of Anchorage Digitalâ\u0080\u0099s sanctions screening alerts for all its global affiliates, as well as working closely with leadership in providing feedback on workflow or system enhancements and implementations. This role will assist the OFAC Officer and the Sanctions Compliance Team with building out and/or executing the Sanctions Compliance Program across different regulatory regimes, products and services. Additional duties require clear speaking within meetings, collaboration with team members and other stakeholders, as well as presenting oneself as a mentor for other team members in order to obtain consistency in work output and knowledge across team functions. The role is a critical element of Anchorage Digitalâ\u0080\u0099s defense against money laundering, terrorist financing, sanctions evasion and fraud. In addition to Anchorage Digital Bank or Anchorage Digital Singapore, you will also assist in compliance related support, specifically for sanctions related tasks to other Anchor Labs entities within the global structure, including but not limited to: A1 Ltd., Anchorage Digital Neo, Porto, and Anchorage Digital NY, etc. (as applicable/necessary).</p><p><br></p><p>We have created the Factors of Growth &amp; Impact to help Villagers better measure impact and articulate coaching, feedback, and the rich and rewarding learning that happens while exploring, developing, and mastering the capabilities and contributions within and outside of the Member of Compliance, Sanctions role:</p>\\n<p></p><p><br></p><b>Technical Skills:</b><ul><li>Demonstrate strong knowledge in evolving cryptocurrency regulations, custody and brokerage operations.</li><li>Understanding of United States and/or Singapore BSA/AML and Sanctions Regulations. Plus familiarity with OFACâ\u0080\u0099s Specially Designated Nationals (SDN) List and sanction programs. This is inclusive of MAS AML and sanctions regulations and reporting requirements.</li><li>Expertise or experience in using blockchain analytics tools to disposition alerts and review on-chain risk.</li><li>Review and disposition or escalate screening alerts originating from client onboarding or KYC reviews, incoming deposits or outgoing withdrawals, digital asset support reviews and ad-hoc screening requests.</li><li>Determine sanction risk using blockchain analytics, IP address monitoring or geo-location blocking tools.</li><li>Perform in-depth research on companies and/or individuals who are clients, prospective clients and/or connected parties by utilizing a range of internal data (e.g. transaction activity, KYC etc.) and external data (e.g. blockchains, internet, media, legal, corporate and other publicly available records and databases).</li><li>Analysis of both quantitative and qualitative data sets to produce in-depth and high-quality written reports that provide assessments of financial crime (e.g. money laundering, bribery and corruption, fraud, tax evasion, sanctions and terrorist financing). Maintain thorough records and supporting documentation for all sanctions alerts and investigations.</li><li>Manage Sanctions-related screening lists, including assisting the OFAC/Sanctions Officer with the selection and testing of Sanctions screening lists and system.</li><li>Refine and build upon our sanctions and transaction monitoring compliance frameworks, including maintenance and enhancement of relevant policies and procedures.</li><li>Prepare monthly management reporting for sanctions metrics for the OFAC Officer and BSA Officer.</li><li>Actively develop knowledge of criminal methods and AML/sanctions typologies, applying these characteristics through analysis of transaction data to identify unusual activity.</li><li>Stay abreast of industry standards and developments in the areas of KYC/AML, and sanctions, and apply regulatory requirements and internal policies and procedures to sanctions related duties and responsibilities.</li></ul><p><br></p><b>Complexity and Impact of Work:</b><ul><li>Works collaboratively with the team and internal stakeholders on the analysis and assessment of key financial regulatory developments, consultations or discussion papers.</li><li>Prepares and/or coordinates submission of periodic or ad hoc regulatory returns.</li><li>Assists management in ensuring relevant compliance policies and procedures are up to date.</li><li>Consistently demonstrates on-time delivery and high quality work product. Where a deadline or commitment is at risk, escalates to manager to help manage priorities, if appropriate, and alerts affected stakeholders so \"no surprises.\"</li><li>Ability to determine false positives and true matches in regards to screening alerts with minimal supervision.</li></ul><p><br></p><b>Organizational Knowledge:</b><ul><li>Is aware of Anchorage regulatory, licensing, and business expansion strategy to assist in successful implementation and is considered when defining the planning and goals of the team.</li><li>Influences the Compliance and Tech roadmap for implementing necessary controls.</li><li>Monitors the development of the company objectives and new product innovation to ensure compliance has a seat at the table.</li><li>Ensures that knowledge is shared amongst the Compliance Teams and does not position themselves or others as a single point of failure.</li></ul><p><br></p><b>Communication and Influence</b><ul><li>Mentors and guides new hires and others within Compliance to help understand Complianceâ\u0080\u0099s impact, importance, and strategic goals for Anchorage.</li><li>Promotes positive working environments for inside and outside of the team with proper listening, speaking and empathy with colleagues, as well as embodies as a role model of our culture pillars.</li><li>Works closely with the team in order to solve problems and assist or guide other members in processes or workflows within their area of specialization or domain, helping others understand the strategic goals of Anchorage and how their work relates to these.</li><li>Uses expert judgment, insight, recommendations, conclusion, and ideas on how to improve the team (e.g., workflows, inventory, etc.)</li><li>Consistently expresses clear, thoughtful, analytical and solution-oriented communications, whether in high-impact slides/decks, written communications in slack or email, or verbal communications.</li><li>Have slack installed on your personal device.</li><li>Have a working relationship across Anchorage legal entities to ensure seamless handover between global compliance teams at the end of the day.</li></ul><p><br></p><b>You may be a fit for this role if you have: </b><ul><li>Experience in BSA/AML transactional reviews</li><li>Knowledge in BSA/AML and/or Sanctions regulations</li><li>Expertise in using sanctions screening systems and working ongoing monitoring alerts</li><li>A passion for building out programs in their early stages, including creation and maintenance of policies, procedures, and new tools</li><li>A proven track record of being able to work independently</li><li>A strong attention to detail</li><li>Highly curious and a fast learner</li></ul><p><br></p><b>Although not a requirement, bonus points if: </b><ul><li>You have expertise in data analytics and/or spreadsheet pivots/formulas for data analysis.</li><li>Blockchain Analytics experience and Certifications (TRM, Chainalysis, etc.)</li><li>You were emotionally moved by the soundtrack to Hamilton, which chronicles the founding of a new financial system. :)</li></ul><p><br></p><p></p>\\n<p><span style=\"font-size: 18px\"><b>About Anchorage Digital: Who we are</b></span></p><p><br></p><p>The Anchorage Village, what we call our team, brings together the brightest minds from platform security, financial services, and distributed ledger technology to provide the building blocks that empower institutions to safely participate in&nbsp; the evolving digital asset ecosystem. As&nbsp;a diverse team of more than 300 members, we are united in one common goal: building the future of finance by providing the foundation upon which value moves safely in the new global economy.&nbsp;</p><p><br></p><p>Anchorage Digital is committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported, and connected at workâ\u0080\u0094regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.</p><p>&nbsp;</p><p>Anchorage Digital is an Equal Opportunity Employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or veteran status. Anchorage Digital considers qualified applicants regardless of criminal histories, consistent with other legal requirements. â\u0080\u009cAnchorage Digitalâ\u0080\u009d refers to services that are offered either through Anchorage Digital Bank National Association, an OCC-chartered national trust bank, or Anchorage Lending CA, LLC a finance lender licensed by the California Department of Financial Protection and Innovation, License No. 60DBO-11976, or Anchorage Digital Singapore Pte Ltd, a Singapore private limited company, all wholly-owned subsidiaries of Anchor Labs, Inc., a Delaware corporation.</p><p><br></p><p>Protecting your privacy rights is important to Anchorage Digital, and we work to maintain the trust and confidence of our clients when handling personal or financial information. Please see our <a class=\"postings-link\" href=\"https://www.anchorage.com/privacy-policy\">privacy policy notices here.</a></p><br/><br/>Please mention the word **AGILELY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "United States",
  "salary_min": 60000,
  "salary_max": 100000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-member-of-compliance-sanctions-anchorage-digital-1093202",
  "url": "https://remoteOK.com/remote-jobs/remote-member-of-compliance-sanctions-anchorage-digital-1093202"
}