{
  "slug": "remote-frontend-software-engineer-bitwise-asset-management-1093220",
  "id": "1093220",
  "epoch": 1748008810,
  "date": "2025-05-23T14:00:10+00:00",
  "company": "Bitwise Asset Management",
  "company_logo": "https://remoteok.com/assets/img/jobs/a8a9789f714da4edce31c1ba3bf736da1748008810.png",
  "position": "Frontend Software Engineer",
  "tags": [
    "frontend",
    "software",
    "design",
    "crypto",
    "bitcoin",
    "ethereum",
    "ui",
    "ux",
    "code",
    "financial",
    "investment",
    "finance",
    "css",
    "typescript",
    "exec",
    "management",
    "lead",
    "marketing",
    "analytics",
    "engineer",
    "engineering",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/a8a9789f714da4edce31c1ba3bf736da1748008810.png",
  "description": "<p><b style=\"font-size: 17pt;\">About Bitwise</b></p><p><span style=\"font-size: 11pt;\">Bitwise is a leading crypto asset manager, overseeing </span><b style=\"font-size: 11pt;\">$12B in client assets</b><span style=\"font-size: 11pt;\"> through a diverse range of investment solutions, including ETFs, separately managed accounts, private funds, staking solutions, and hedge fund strategies. Trusted by thousands of financial advisors, family offices, and institutional investors, we empower our partners to navigate and seize opportunities in the crypto market.</span></p><p><br></p><p><span style=\"font-size: 11pt;\">Recently, we raised a </span><b style=\"font-size: 11pt;\">$70M funding round</b><span style=\"font-size: 11pt;\"> reinforcing our position as profitable, innovative leaders in digital assets. We're backed by top-tier investors like Electric Capital, MassMutual, Highland Capital, MIT Investment Management Company, Haun Ventures, ParaFi Capital, etc.</span></p><p><br></p><p><span style=\"font-size: 11pt;\">We're deeply committed to the crypto ecosystem, donating 10% of gross profits from our Bitcoin ETF (BITB) and Ethereum ETF (ETHW) to </span><b style=\"font-size: 11pt;\">support open-source software development</b><span style=\"font-size: 11pt;\">â\u0080\u0094contributing over </span><b style=\"font-size: 11pt;\">$250,000</b><span style=\"font-size: 11pt;\"> last year alone to organizations like </span>Brink, OpenSats, Protocol Guild, <span style=\"font-size: 11pt;\">and PBS Foundation.</span></p><p><br></p><p><span style=\"font-size: 11pt;\">Our lean engineering team is at the heart of our success, building cutting-edge solutions that drive critical company functions. You'll work closely with key stakeholders in a collaborative, high-impact environment where autonomy and adaptability are key.</span></p><p><br></p><p><span style=\"font-size: 11pt;\">At Bitwise, engineers are empowered to act as their own product managers, setting priorities, defining timelines, and delivering impactful solutions that push our business forward. Join us to shape the future of finance with code that matters.</span></p>\\n<p></p><p><br></p><b>What You'll Do:</b><ul><li><b>Craft delightful production experiences.</b> Collaborate with marketing &amp; engineering teams to build <b>polished user interfaces</b> with exceptional <b>code quality and performance</b>. You'll transform designs into pixel-perfect implementations with attention to every interaction detail.</li><li><b>Evolve our frontend architecture.</b> Take ownership of our <b>React/Next.js and TypeScript codebase</b>, ensuring it remains <b>maintainable, scalable, and performant</b>. You'll implement best practices and architectural patterns that help our systems grow with the business.</li><li><b>Lead critical frontend migrations.</b> Spearhead the <b>transition from Next Pages router to App router</b>, establishing patterns and practices while ensuring minimal disruption. You'll create a roadmap and execute the migration that modernizes our application architecture.</li><li><b>Enable global product reach.</b> Introduce <b>localization and multi-country support</b> to our Expert Portal, making it accessible for our European team. You'll implement internationalization best practices while maintaining a consistent user experience.</li><li><b>Build new crypto experiences.</b> Help develop a <b>new staking application frontend</b> for Bitwise Onchain, applying your frontend expertise to create intuitive interfaces for complex financial operations.</li><li><b>Drive engineering excellence.</b> Continuously improve our <b>processes, tools, and systems</b> to scale both our codebase and team productivity. You'll participate in <b>code reviews</b> and help establish quality standards across the organization.</li><li><b>Collaborate with stakeholders.</b> Work closely with business teams to translate requirements into <b>reliable, scalable frontend solutions</b>. You'll own projects end-to-end while aligning stakeholders to common goals and driving to finished outputs.</li></ul><p><br></p><b>What We're Looking For:</b><ul><li>3+ years of React/Next.js and TypeScript frontend development experience</li><li>Portfolio demonstrating UI and engineering work</li><li>Familiarity with CSS styling approaches (css-in-js and Tailwind)</li><li>Knowledge of design patterns and common UX flows</li><li>Experience with headless CMS platforms and REST APIs</li><li>Fast-moving with a bias for impact and willingness to advocate for your work</li><li>Strong sense of ownership and ability to lead projects while aligning stakeholders</li><li>Clear written and verbal communication skills</li><li>Interest in learning about crypto and investments</li><li>(Plus) Understanding of design principles and experience with design tools like Figma&nbsp;</li><li>(Plus) Experience with monorepo structures like Turborepo</li><li>(Plus) Familiarity with analytics tools (GA4, Mixpanel) and data-driven validation </li><li>(Plus) Bachelorâ\u0080\u0099s degree in Computer Science or equivalent</li></ul><p><br></p><b>What We Offer:</b><ul><li>Competitive salary</li><li>Eligible for equity </li><li>Health, dental, vision insurance</li><li>401K plan (company funded, no match required)</li><li>Unlimited PTO plus 10 paid holidays</li><li>Meals/snacks in office</li><li>Paid cell phone or stipend</li><li>Bitwise \"Buddy\" Program (30 day onboarding)</li><li>Annual birthday/anniversary gifts</li><li>Company wide events</li></ul><p><br></p><p></p>\\n<div>$150,000 - $170,000 a year</div><small><div>Equity compensation as a component of all offers</div></small>\\n<p><i>Bitwise is an equal opportunity employer. We are committed to building a team of people with a variety of backgrounds, perspectives, and skills. It is the policy of Bitwise to ensure equal opportunity. All candidates are considered without regard to race, color, religion, national origin, age, sex, sexual orientation, gender identity, marital status, ancestry, physical or mental disability, veteran status, or any other legally protected characteristics.</i></p><br/><br/>Please mention the word **GAINFUL** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Remote",
  "salary_min": 72500,
  "salary_max": 120000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-frontend-software-engineer-bitwise-asset-management-1093220",
  "url": "https://remoteOK.com/remote-jobs/remote-frontend-software-engineer-bitwise-asset-management-1093220"
}