{
  "slug": "remote-social-media-manager-caiz-1093296",
  "id": "1093296",
  "epoch": 1748908804,
  "date": "2025-06-03T00:00:04+00:00",
  "company": "Caiz",
  "company_logo": "https://remoteok.com/assets/img/jobs/b4df1dad0ff1f3c98ed2f3003d494c101748908804.jpg",
  "position": "Social Media Manager",
  "tags": [
    "manager",
    "crypto",
    "system",
    "security",
    "support",
    "voice",
    "financial",
    "finance",
    "strategy",
    "management",
    "content",
    "senior",
    "operations",
    "marketing"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/b4df1dad0ff1f3c98ed2f3003d494c101748908804.jpg",
  "description": "&lt;p&gt;&lt;strong&gt;Caiz&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Revolutionizing Islamic Finance with Blockchain Technology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you ready to be part of a groundbreaking initiative that combines Islamic finance principles with cutting-edge blockchain technology?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Look no further than Caiz â\u0080\u0093 THE FIRST ISLAMIC ECOSYSTEM BUILT ON BLOCKCHAIN.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Caiz, our mission is clear: to create a Fiqh compliant financial ecosystem that provides our community with fair and easy access to ethical financial products and services. We believe in empowering individuals to build a strong financial future while engaging in long-term economically beneficial behavior.&lt;/p&gt;\n&lt;p&gt;Our native coin, Caizcoin, that fuels the Caizblockchain. With Caizcoin, you can make seamless payments, store value, and interact with a range of ethical financial products we are developing. The centerpiece of our ecosystem is the innovative Caizapp, giving users complete control over their digital assets.&lt;/p&gt;\n&lt;p&gt;We are a passionate team reshaping finance, and we are expanding our dynamic workforce. Join us in a collaborative work environment focused on creating a fast and compliant money transfer structure.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHY TO JOIN Caiz?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Innovative &amp;amp; Purpose-Driven&lt;/strong&gt;: At Caiz, we combine advanced blockchain technology with the principles of Islamic finance to create an innovative and modern financial system. Join us to be part of a forward-thinking organization that is reshaping the future of finance.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Ethical Impact&lt;/strong&gt;: As part of Caiz, you&amp;#39;ll be working in an Organization that prioritizes &lt;strong&gt;ethics&lt;/strong&gt; and &lt;strong&gt;integrity&lt;/strong&gt; in all its operations, ensuring that every solution we offer aligns with the core values of fairness, transparency, and respect.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Growth &amp;amp; Learning Opportunities&lt;/strong&gt;: At Caiz, we value personal and professional growth. You&amp;#39;ll have the opportunity to learn, innovate, and grow within a dynamic, supportive environment, while contributing to the development of ethical financial solutions.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Global Vision, Local Impact&lt;/strong&gt;: Caiz is focused on creating an inclusive, sustainable financial system that empowers individuals globally. Youâ\u0080\u0099ll be contributing to a company that has a positive impact on local communities and the global financial landscape.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Collaborative Culture&lt;/strong&gt;: We believe in teamwork and collaboration. You&amp;#39;ll work alongside passionate professionals who are committed to driving change in the crypto and blockchain space, working together to create an ethical financial future.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Secure &amp;amp; Transparent Environment&lt;/strong&gt;: We emphasize &lt;strong&gt;trust&lt;/strong&gt; and &lt;strong&gt;security&lt;/strong&gt; in all aspects of our operations. As part of Caiz, youâ\u0080\u0099ll be part of a transparent organization that values customer trust and ensures the highest security standards in the crypto space.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2 id=&quot;tasks&quot;&gt;Tasks&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Caiz&lt;/strong&gt; is looking for a crypto and tech-savvy Senior Social Media Manager to join our marketing team. In this role, you will maintain and strengthen our brand presence as leaders in the crypto space by managing our existing social channels. The ideal candidate is fascinated and actively engaged within the crypto sector and has experience with social media platforms, including Twitter and YouTube. They also enjoy identifying and exploring new crypto trends and cultures and are hungry to expand their social media and marketing skills as they pertain to this exciting new sector. You will report to the Head of Marketing.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Run the day-to-day operations of Caizâ\u0080\u0099s social platforms (Twitter, LinkedIn, YouTube Facebook, etc.)&lt;/li&gt;\n&lt;li&gt;Strong writing skills and the ability to create engaging and compelling content for social media posts and campaigns&lt;/li&gt;\n&lt;li&gt;Develop and execute a comprehensive social media strategy aligned with the overall marketing goals and target audiences.&lt;/li&gt;\n&lt;li&gt;Track performance metrics, measure the success of campaigns, and make data-driven decisions for optimization.&lt;/li&gt;\n&lt;li&gt;Run Live events and AMA sessions&lt;/li&gt;\n&lt;li&gt;Manage multiple social media accounts and campaigns simultaneously, adhering to timelines and deadlines.&lt;/li&gt;\n&lt;li&gt;Ideate unique and engaging social media ideas and campaigns.&lt;/li&gt;\n&lt;li&gt;Engage in online conversations with Caizâ\u0080\u0099s social community about our services&lt;/li&gt;\n&lt;li&gt;Coordinate with other teams to ensure a cohesive brand message across all channels&lt;/li&gt;\n&lt;li&gt;Continue to grow current social channels, identify new platform opportunities to continue expansion, and identify opportunities and/or potential issues&lt;/li&gt;\n&lt;li&gt;Strategize and coordinate social media distribution of new research reports published on a daily basis and new product releases&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2 id=&quot;requirements&quot;&gt;Requirements&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Experience:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;5+ years of professional experience in a Social Media Manager role&lt;/li&gt;\n&lt;li&gt;Previous experience with growing communities. Preferably among crypto exchanges/wallets / Layer 1-2 ecosystems&lt;/li&gt;\n&lt;li&gt;Demonstrate knowledge of the crypto ecosystem subject matter and trending topics&lt;/li&gt;\n&lt;li&gt;3-5 years of experience in social management&lt;/li&gt;\n&lt;li&gt;Experience using social media platforms (Twitter, YouTube, LinkedIn, etc.)&lt;/li&gt;\n&lt;li&gt;Familiarity with social media management tools like Hootsuite, etc&lt;/li&gt;\n&lt;li&gt;Excellent verbal and written communication skills, with the ability to convey ideas effectively.&lt;/li&gt;\n&lt;li&gt;A team player, but independent and self-motivated&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Level of studies:&lt;/strong&gt; Bachelor or Master Degree in Marketing, Communications or similar&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Language Requirements&lt;/strong&gt;: Fluent in English&lt;/p&gt;\n&lt;h2 id=&quot;benefits&quot;&gt;Benefits&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Benefits AT Caiz :&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Financial Compensation&lt;/strong&gt;: We offer financial benefits that reflect the value of your work and dedication.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work Flexibility&lt;/strong&gt;: Enjoy the flexibility to work from home, the office, or even abroad.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Annual Holidays&lt;/strong&gt;: Generous paid time off to help you maintain a healthy work-life balance.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Relocation Assistance&lt;/strong&gt;: We provide relocation support for employees moving to new locations.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional Development&lt;/strong&gt;: Opportunities for training, certifications, and career growth.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Employee Recognition&lt;/strong&gt;: Programs to celebrate and reward your achievements and contributions.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Inclusive &amp;amp; Collaborative Culture&lt;/strong&gt;: A supportive and diverse work environment where your voice matters.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Diversity, Equality, and Inclusion&lt;/strong&gt;: We are committed to fostering a workplace that values diversity and promotes equality and inclusion for all employees.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Don&amp;#39;t miss this opportunity â\u0080\u0093 apply now and be part of the Caiz revolution.&lt;/p&gt;\n<br/><br/>Please mention the word **SEASONED** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 40000,
  "salary_max": 75000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-social-media-manager-caiz-1093296",
  "url": "https://remoteOK.com/remote-jobs/remote-social-media-manager-caiz-1093296"
}