{
  "slug": "remote-wattpad-marketing-intern-webtoon-entertainment-inc-wattpad-amp-webtoon-family-of-brands-1093255",
  "id": "1093255",
  "epoch": 1748361624,
  "date": "2025-05-27T16:00:24+00:00",
  "company": "WEBTOON Entertainment Inc. (Wattpad &amp; WEBTOON Family of Brands)",
  "company_logo": "https://remoteok.com/assets/img/jobs/e1e0b44648a424c17cf7ba192e29c1cb1748361624.png",
  "position": "Wattpad Marketing Intern",
  "tags": [
    "software",
    "management",
    "content",
    "marketing",
    "internship"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/e1e0b44648a424c17cf7ba192e29c1cb1748361624.png",
  "description": "<p><span style=\"font-size: 14.6667px\">Wattpad WEBTOON Studios brings together technology, a diverse new generation of creators, and passionate global fandoms to create data-backed, audience-driven TV shows, films, and books. Leveraging incredible stories and insights from WEBTOON and Wattpadâ\u0080\u0099s combined audience of more than 166 million people, Wattpad WEBTOON Studios has pioneered a bold, global, fan-first approach to entertainment. Wattpad WEBTOON Studios has worked with Netflix, Sony Pictures Television, Crunchyroll, The Jim Henson Company, Vertigo Entertainment, Constantin Film, Penguin Random House, and many other leaders in entertainment and publishing. </span></p><p><br></p><p>We are currently in the process of searching for two Marketing Interns to join our Social Media team! The internship will be approximately 4 months in duration.&nbsp;</p>\\n<p></p><p><br></p><b>What you'll be doing:</b><ul><li>Create trending and evergreen content for @wattpadâ\u0080\u0099s global social channels, with a particular focus on Instagram and TikTok.</li><li>Ideate and pitch creative social post ideas that will aid in Wattpadâ\u0080\u0099s brand awareness.</li><li>Bringing to life the character and spirit of our organization by portraying our beloved W Mascot in social media posts.</li><li>Plan content using project management tools and work with stakeholders to ensure they review and approve social posts on time.</li><li>Assist in executing social media marketing initiatives across Meta, TikTok, X, and Pinterest using social, marketing and product tools (e.g. Sprinklr, Asana, AppsFlyer, Canva, and native social media platforms).</li><li>Stay up-to-date on social trends, tools, and best practices in order to surface insights and learnings to help optimize content and engagement.</li></ul><p><br></p><b>What we're looking for:</b><ul><li>A highly engaged Wattpadder! Passion for the platform, Wattpad stories, and their creators is a must.</li><li>A content creator whoâ\u0080\u0099s comfortable being on camera and behind it.</li><li>You have an instinct for knowing what visuals will work for social - and have edited or created your own (on platforms like YouTube and TikTok and with tools like Canva, CapCut, Adobe).</li><li>You can demonstrate success using social media channels and have a point of view on which brands are doing amazing work in social.</li><li>Strong organizational and execution skills, with an ability to handle multiple tasks and meet deadlines in a fast-paced environment.</li><li>An eagerness to take initiative and an ability to juggle multiple priorities with ease.</li><li>Must be located in Toronto, ON with the ability to work from our downtown Toronto HQ 2-3 times per week.</li></ul><p><br></p><p></p>\\n<p>Wattpad WEBTOON Studios is conducting all interviews in a distributed manner using applicable third party software where needed and using visual interface tools such as Google Hangouts and Zoom.</p><p><br></p><p><b>About Wattpad</b></p><p><br></p><p><b>Who are we?&nbsp;</b>Entrepreneurs and Do-ers. Our vision is to entertain and connect the world through stories, and our mission is to use the power of community and technology to unleash the full potential of stories to the world.</p><p><b>What does that mean?&nbsp;</b>We are visionaries, community builders, passionate problem solvers, storytellers, coffee snobs (tea drinkers, too!), curious by nature, and culturally diverse.</p><p><b>What are we obsessed with?&nbsp;</b>Our users. Solving complex problems and maximizing flow. Learning constantly. Building the next great storytelling product. Finding the greatest stories ever told. Dogs (and cats), coffee, and good snacks.</p><p><b>How do we work?&nbsp;</b>Autonomously, collaboratively, respectfully. Balancing with work, family, and play...and all while having a great time.</p><p><br></p><p>We are a remote friendly company and encourages remote candidates to apply as long as they are located and authorized to work in either the US or Canada (excluding Quebec) as a precondition of employment. We are not able to sponsor applicants for work permits.</p><p><br></p><p><b>Culture and Diversity</b></p><p><br></p><p>Wattpad is an equal opportunity employer. We do not discriminate. Period.&nbsp;</p><p><br></p><p>Wattpad welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.&nbsp;We have taken a leadership position on creating a culture and an organization that truly values diversity. We are committed to fostering a global team that reflects the diversity of the Wattpad community. At Wattpad, we believe cultural fit doesnâ\u0080\u0099t mean culturally identical, and diversity of thought helps us to challenge one another to think big and think differently. We consider employment applicants without regard to age, race, colour, national origin, citizenship, religion, creed, sex, sexual orientation, veteran status, marital status, disability status or any other protected status.&nbsp;&nbsp;</p><p><br></p><p>If you have any special needs or accessibility requirements, please let us know. We will do our utmost to accommodate, in accordance with applicable local legislation.</p><br/><br/>Please mention the word **ADMIRING** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Toronto, Ontario",
  "salary_min": 32500,
  "salary_max": 62500,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-wattpad-marketing-intern-webtoon-entertainment-inc-wattpad-amp-webtoon-family-of-brands-1093255",
  "url": "https://remoteOK.com/remote-jobs/remote-wattpad-marketing-intern-webtoon-entertainment-inc-wattpad-amp-webtoon-family-of-brands-1093255"
}