{
  "slug": "remote-software-engineer-ii-everbridge-1093283",
  "id": "1093283",
  "epoch": 1748649608,
  "date": "2025-05-31T00:00:08+00:00",
  "company": "Everbridge ",
  "company_logo": "https://remoteok.com/assets/img/jobs/da8ef9b78acf0487db3d1250b00ddc261748649609.png",
  "position": "Software Engineer II",
  "tags": [
    "software",
    "system",
    "front-end",
    "security",
    "full-stack",
    "developer",
    "web",
    "scrum",
    "devops",
    "javascript",
    "financial",
    "typescript",
    "mongodb",
    "api",
    "management",
    "health",
    "engineer",
    "engineering",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/da8ef9b78acf0487db3d1250b00ddc261748649609.png",
  "description": "<p>We are looking for a developer to continue enhancing our SaaS-based Critical Event Management platform. Our platform runs on a .NET stack, and we are continuously expanding our capabilities to meet the needs of our customers. Our application processes critical event data, provides visualization, and the ability to communicate worldwide with impacted users. Its purpose is to protect lives by processing and communicating about critical events.&nbsp;</p>\\n<p></p><p><br></p><b>What you'll do</b><ul><li>Work collaboratively with a team of full-stack developers. </li><li>Develop using modern web technologies (e.g. C#, TypeScript &amp; JavaScript) </li><li>Develop using modern platform technologies (e.g. Kubernetes, Docker, API Gateway) </li><li>Participate in sprint planning sessions </li><li>Implement new capabilities within the platform </li><li>Collaborate across engineering teams and guide adoption of best practices within the team</li><li>Participate in routine maintenance of the system to include software deficiency resolution</li><li>Willingness to learn new skills and technologies&nbsp;</li></ul><p><br></p><b>What you'll bring:</b><ul><li>2+ years of experience developing in a .NET full-stack environment </li><li>1+ years of experience building scalable web applications with .NET Core, <a href=\"http://ASP.NET\">ASP.NET</a> and MongoDB (or equivalent technologies) </li><li>1+ years of experience with front-end development using JavaScript frameworks (e.g. Angular, React) </li><li>Experience writing scalable multi-threaded Web applications and Services </li><li>Experience working with DevOps automation tools (e.g. Jenkins, GitLab) </li><li>Experience using AI Dev tools (e.g. GitHub Co-Pilot, Curser) </li><li>Bachelorâ\u0080\u0099s degree in Computer Engineering, Computer Science or related fields&nbsp;</li></ul><p><br></p><b>Bonus if you have:</b><ul><li>Experience working in a cloud-based deployment environment </li><li>Agile and Scrum experience </li><li>Experience with geospatial technologies </li><li>Experience with containerization (e.g. Kubernetes, Docker)&nbsp;</li></ul><p><br></p><p></p>\\n<p><span style=\"font-size: 12pt\">The reasonably estimated salary for this role at Everbridge ranges from $105,000 - $140,000 and may also include variable compensation. Actual compensation is based on factors such as the candidate's skills, qualifications, and experience. In addition, Everbridge offers a wide range of best in class, comprehensive and inclusive employee benefits for this role including healthcare, dental, parental planning, and mental health benefits, disability income benefits, life and AD&amp;D insurance, a 401(k) plan and match, paid time off, and fitness reimbursements.</span></p><p><br></p><p><b style=\"font-size: 12pt\">Fair Chance Statement US &amp; Canada</b></p><p><span style=\"font-size: 12pt\"> We are committed to providing equal employment opportunities in compliance with all applicable Federal, Provincial/State and Local laws, including the California Fair Chance Act and any local County Fair Chance Ordinance (or local equivalent). Pursuant to these and other relevant regulations, we consider qualified applicants with criminal histories in a manner consistent with the law.</span></p><p><span style=\"font-size: 12pt\">&nbsp;</span></p><p><span style=\"font-size: 12pt\">For roles subject to background checks, the following material job duties may be affected by an applicantâ\u0080\u0099s criminal history:</span></p><p><span style=\"font-size: 12pt\">- Access to sensitive or confidential information, such as financial records, proprietary data, or client information.</span></p><p><span style=\"font-size: 12pt\">- Management of cash, company funds, or other valuable assets.</span></p><p><span style=\"font-size: 12pt\">- Work in environments requiring heightened security measures.</span></p><p><span style=\"font-size: 12pt\">- Compliance with contractual or regulatory requirements specific to the position.</span></p><p><span style=\"font-size: 12pt\">&nbsp;</span></p><p><span style=\"font-size: 12pt\">We evaluate each applicant's criminal history individually, considering its nature, timing, and relevance to the specific job duties, while maintaining our commitment to fair hiring practices and promoting workplace equity.</span></p><p><br></p><p><b><span style=\"font-size: 12pt\">About Everbridge</span></b></p><p><br></p><p><span style=\"font-size: 12pt\">Everbridge empowers enterprises and government organizations to anticipate, mitigate, respond to, and recover stronger from critical events. In todayâ\u0080\u0099s unpredictable world, resilient organizations minimize impact to people and operations, absorb stress, and return to productivity faster when deploying critical event management (CEM) technology. Everbridge digitizes organizational resilience by combining intelligent automation with the industryâ\u0080\u0099s most comprehensive risk data to Keep People Safe and Organizations Runningâ\u0084¢. For more information, visit&nbsp;</span><a class=\"postings-link\" style=\"font-size: 12pt\" href=\"http://www.everbridge.com/\">www.everbridge.com</a><span style=\"font-size: 12pt\">, read the company blog, and follow on Twitter. Everbridgeâ\u0080¦ Empowering Resilience</span></p><p><span style=\"font-size: 12pt\">&nbsp;</span></p><p><i style=\"font-size: 12pt\">Everbridge is an Equal Opportunity/Affirmative Action Employer. All qualified Applicants will receive consideration for employment without regard to race, creed, color, religion, or sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.</i></p><br/><br/>Please mention the word **HANDSOME** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "United States",
  "salary_min": 70000,
  "salary_max": 110000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-software-engineer-ii-everbridge-1093283",
  "url": "https://remoteOK.com/remote-jobs/remote-software-engineer-ii-everbridge-1093283"
}