{
  "slug": "remote-lead-data-engineer-open-architects-1093295",
  "id": "1093295",
  "epoch": 1748903574,
  "date": "2025-06-02T22:32:54+00:00",
  "company": "Open Architects",
  "company_logo": "https://remoteOK.com/assets/img/jobs/228c6a0bed3db1ff9b0e113b8252c0c31748903574.png",
  "position": "Lead Data Engineer",
  "tags": [
    "engineer",
    "dev",
    "devops",
    "python",
    "data",
    "dataops"
  ],
  "logo": "https://remoteOK.com/assets/img/jobs/228c6a0bed3db1ff9b0e113b8252c0c31748903574.png",
  "description": "<p><a href=\"https://www.openarchitectsk12.com/\">Open Architects</a> (OA) seeks a Lead Data Engineer to strategically enhance our ETL processes and data connectors, enabling reliable, sustainable, and scalable integration with diverse data systems. Reporting directly to OAâ\u0080\u0099s Director of Technology, you will guide the development of our data engineering strategy, drive key architectural decisions, and build pipelines to extract customer data. Our ideal candidate is an experienced Python developer with a complementary DevOps skillset that allows them to make informed decisions.<br /><br />OA supports school districts, municipalities, and education non-profits with custom-built visualizations and data tools that empower leaders to make informed decisions. In our ninth year, OA provides a collaborative and inclusive environment driven by a deep commitment to our clients and the students they serve, and we eagerly get into the trenches to help solve our clientsâ\u0080\u0099 problems. We are also a learning organization that embraces the messiness of the work and has fun along the way. We take our work seriously but not ourselves.<br /><br /><strong>Role &amp; Responsibilities</strong></p><ul><li>Lead and implement strategic improvements to OAâ\u0080\u0099s ETL infrastructure and processes.</li><li>Build and maintain robust data connectors to dozens of systems, ensuring reliability, scalability, and sustainability.</li><li>Monitor data pipeline performance, proactively troubleshooting and resolving issues to maintain data integrity and system uptime.</li><li>Collaborate with district IT departments to address and resolve technical issues beyond client service capabilities.</li><li>Develop internal documentation, guidelines, and best practices to support growth and onboarding.</li><li>Influence platform and technology decisions to improve pipeline resilience and transparency.</li></ul><p><strong>Qualifications</strong></p><p><em>Required Technical Skills and Experience</em></p><ul><li>4+ years of experience as a data engineer with Python as the primary programming language</li><li>Strong DevOps skills in a Linux environment, including CI/CD, Git, and containerization tools such as Docker</li><li>Experience with data pipeline orchestration and management technologies (e.g., Docker, Airflow, Kubernetes)</li><li>Proven ability to establish and document technical standards and operational best practices.</li><li>Bachelorâ\u0080\u0099s degree required</li></ul><p><em>Required Personal Skills and Experience</em></p><ul><li>Highly self-motivated and able to structure independent work effectively in a fully remote environment.</li><li>Exceptional communication skills, capable of translating complex technical concepts clearly<br />for internal stakeholders and clients.</li><li>Enthusiastic collaborator, comfortable working within a flexible and flat organizational structure.</li><li>Commitment to maintaining strict confidentiality and ethical standards when handling<br />sensitive client data.</li><li>Experience effectively engaging with diverse stakeholders, especially education and<br />municipal leaders.</li></ul><p><em>Preferred Skills and Experience</em></p><ul><li>Familiarity with educational technology (EdTech) or experience working with student data<br />systems.</li><li>Availability during standard U.S. Eastern Time business hours.</li></ul><br/><br/>Please mention the word **STRONG** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 120000,
  "salary_max": 140000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-lead-data-engineer-open-architects-1093295",
  "original": true,
  "url": "https://remoteOK.com/remote-jobs/remote-lead-data-engineer-open-architects-1093295"
}