{
  "slug": "remote-senior-data-analytics-engineer-fullscript-1093152",
  "id": "1093152",
  "epoch": 1746910803,
  "date": "2025-05-10T21:00:03+00:00",
  "company": "Fullscript",
  "company_logo": "https://remoteok.com/assets/img/jobs/9604cf514f8d53119440386d0a36feb41746910805.png",
  "position": "Senior Data Analytics Engineer",
  "tags": [
    "design",
    "python",
    "technical",
    "support",
    "testing",
    "growth",
    "code",
    "devops",
    "financial",
    "cloud",
    "leader",
    "senior",
    "junior",
    "analytics",
    "health",
    "healthcare",
    "engineer",
    "engineering",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/9604cf514f8d53119440386d0a36feb41746910805.png",
  "description": "<p><b><span style=\"font-size: 18px;\">At Fullscript, weâ\u0080\u0099re not just changing healthcareâ\u0080\u0094weâ\u0080\u0099re making it whole.</span></b></p><p><br></p><p>We help <b>100,000+ healthcare practitioners</b> support <b>10 million patients</b> with a platform that delivers evidence-based health solutions, diagnostic support, and practitioner toolsâ\u0080\u0094all in one place.</p><p><br></p><p>Healthcare today is disconnected. Weâ\u0080\u0099re fixing that. <b>Fullscript makes it easier for practitioners to treat the whole person, not just symptoms, so patients get the support they needâ\u0080\u0094when they need it.</b></p><p><br></p><p>Weâ\u0080\u0099re building a better wayâ\u0080\u0094one where healthcare is connected, complete, and built for impact.</p><p><br></p><p><br></p><p><b>ð\u009f\u0093\u008a BUILD DATA. DRIVE INSIGHTS. IMPACT HEALTHCARE.</b></p><p><br></p><p>Weâ\u0080\u0099re seeking a <b>Senior Data Analytics Engineer </b>for our Data Commercial team. The Data team is both a support function and strategic partner at Fullscript and will continue to be a key area of business value going forward. Data is used to drive effective decision-making and growth through opportunity analysis, experiment design and iteration,, and building dynamic experiences for our customers. We are investing heavily in the coming years to make data more accessible to our internal teams and to leverage it within our application to provide our practitioners and patients with data-driven tools and experiences.</p><p><br></p><p>As the <b>Senior Data Analytics Engineer</b>, you will be building the data platform that powers our decision-making and growth. This same platform also provides key insights about our practitioners and their patients through analytics and advanced metrics.</p>\\n<p></p><p><br></p><b>What you'll do: </b><ul><li>Work cross-functionally to help maintain, build and deploy a Commercial data warehouse to serve reporting, analytical, and self-service needs for key Fullscript stakeholders</li><li>Work with your leader and team to collaborate on initiatives across functions such as Analytics, Commercial, and RevOps to understand and improve their data</li><li>Write data transformation code in ELT pipelines to integrate that data into our data warehouse for consumption by the reporting and data analytics functions</li><li>Mentor and provide technical guidance to junior members of the data engineering team</li><li>Work with other data engineers to create and populate the data models for downstream consumption, and write the necessary tests to ensure data quality</li><li>Apply advanced data engineering techniques to optimize performance and scalability of data pipelines</li><li>Leverage AI and machine learning to build models that are responsive to business requirements and enable the delivery of streamlined, dynamic experiences for customers</li><li>Apply version control, testing and continuous integration (CI) in the data transformation code</li><li>Create and maintain data documentation and definitions</li></ul><p><br></p><b>What you bring to the table: </b><ul><li>5+ years in Data Analytics and/or Data Engineering position as part of ETL/ELT process or data insights development</li><li>Strong proficiency with SQL and experience using Python for data transformation</li><li>Experience working with dbt (data build tool)</li><li>Experience working with Cloud Data warehouses like Snowflake, BigQuery, Redshift and RDBMS (PostgreSQL, MySQL)</li><li>Hands-on experience with data modeling, schema design, and optimization techniques</li><li>Proven track record of implementing and maintaining data transformation pipelines using tools like dbt (data build tool), Argo, Airflow, or similar workflow orchestration tools</li><li>Deep understanding of data engineering best practices, including version control, testing, and CI/CD methodologies</li><li>Ability to communicate complex technical concepts effectively to both technical and non-technical stakeholders</li><li>Continuous learning mindset with a keen interest in exploring new technologies and methodologies in the data engineering space</li></ul><p><br></p><b>Bonus qualifications: </b><ul><li>Experience with DevOps practices and tools for automated deployment and infrastructure management</li><li>Practical experience building and deploying data models that leverage AI and machine learning (using Azure, AWS, Snowflake, etc.)</li><li>Familiarity with machine learning concepts and frameworks for implementing predictive analytics solutions</li><li>Previous experience in a leadership or mentorship role within a data engineering team</li><li>Write us a cover letter explaining why data engineering is of special interest to you</li></ul><p><br></p><b>What we can offer you:</b><ul><li>Generous PTO and competitive pay&nbsp;</li><li>Fullscriptâ\u0080\u0099s RRSP match program for financial health&nbsp;</li><li>Flexible benefits package and workplace wellness program</li><li>Training budget and company-wide learning initiatives&nbsp;</li><li>Discount on Fullscript catalog of products&nbsp;</li><li>Ability to work Wherever You Work Well*</li></ul><p><br></p><p></p>\\n<p><span style=\"font-size: 18px;\">Why Fullscript?</span></p><p><br></p><p>Great work happens when people are supported, challenged, and inspired. Here, youâ\u0080\u0099ll be part of a team that:</p><p><br></p><p>â¬¦ Values innovationâ\u0080\u0094we push boundaries and always look for better ways.</p><p>â¬¦ Supports growthâ\u0080\u0094through learning, mentorship, and meaningful work.</p><p>â¬¦ Cares about balanceâ\u0080\u0094with flexible work options and time off when you need it.</p><p><br></p><p>ð\u009f\u0093\u008c <b>Apply nowâ\u0080\u0094letâ\u0080\u0099s build the future of healthcare, together.</b></p><p><br></p><p>Fullscript is an equal-opportunity employer committed to creating an inclusive workplace. Accommodations are available upon requestâ\u0080\u0094email accommodations@fullscript.com for support.</p><p><br></p><p>Before joining the team, all candidates who receive and accept an offer will complete a background check.</p><p><br></p><p>ð\u009f\u009a\u0080 <b>MORE INFO: </b><a href=\"http://www.fullscript.com\">www.fullscript.com</a> | <a href=\"http://www.rupahealth.com\">www.rupahealth.com</a> | <b>Follow us on social media </b><a href=\"https://www.instagram.com/fullscripthq/?hl=en\">@fullscriptHQ</a></p><p>ð\u009f\u0094¥ <b>IN THE NEWS: </b><a href=\"https://fullscript.com/blog/fullscript-acquires-rupa-health\">Fullscript acquires Rupa Health</a></p><p>ð\u009f\u0093º<a href=\"https://youtu.be/ebcF2Vz3xf8\">Letâ\u0080\u0099s make healthcare whole</a></p><br/><br/>Please mention the word **FAVORITE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 67500,
  "salary_max": 120000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-senior-data-analytics-engineer-fullscript-1093152",
  "url": "https://remoteOK.com/remote-jobs/remote-senior-data-analytics-engineer-fullscript-1093152"
}