{
  "slug": "remote-tech-cofounder-cto-founders-factory-1093267",
  "id": "1093267",
  "epoch": 1748519089,
  "date": "2025-05-29T11:44:49+00:00",
  "company": "Founders Factory",
  "company_logo": "https://remoteOK.com/assets/img/jobs/9cf537874ada76d422baf5a6aaf4ca3c1748519089.png",
  "position": "Tech Cofounder CTO",
  "tags": [
    "dev",
    "full stack",
    "api",
    "engineer",
    "senior",
    "mobile"
  ],
  "logo": "https://remoteOK.com/assets/img/jobs/9cf537874ada76d422baf5a6aaf4ca3c1748519089.png",
  "description": "<p dir=\"ltr\"><strong>Tech Co-Founder - Tetto Assicurazione (LLM-Powered Home Contents Insurance)</strong></p><p><strong><br /></strong></p><p dir=\"ltr\">Founders Factory builds and funds startups together with exceptional entrepreneurs and the worldâ\u0080\u0099s leading companies. Created by IPO-exited founders, we offer founders capital, operational support from a team of hands-on experts, and unrivaled access to a coalition of industry-leading corporate partners. Since 2015, our 300+ portfolio companies have raised $900mm follow-on funding from a roster of notable investors.</p><p><strong><br /></strong></p><p dir=\"ltr\">Our Studio partners with entrepreneurs at day one, developing new ideas, technologies and business models into high growth companies. Together with Fastweb, one of Italyâ\u0080\u0099s leading telecommunications companies, weâ\u0080\u0099re now exploring concepts at the intersection of insurance and technology.Â </p><p><strong><br /></strong></p><p dir=\"ltr\">Weâ\u0080\u0099re looking for an experienced operator with entrepreneurial ambitions to lead a new venture as Cofounder &amp; CTO with our investment and the full backing of Founders Factory.</p><p><strong><br /></strong></p><p dir=\"ltr\"><strong>The Opportunity</strong></p><p><strong><br /></strong></p><p dir=\"ltr\">Italy presents a unique opportunity in the insurance sector, particularly for home and contents coverage. Despite being the 7th largest market for life insurance in the OECD, Italy ranks only 25th in property and casualty premiums relative to GDP. This underinsurance, coupled with a slow-moving, broker-dominated market, creates a significant opening for innovation. With 77% of Italian consumers expressing high interest in purchasing more policies digitally in the future, and the insurance industry poised to be the second-most impacted by generative AI, the timing is perfect for a disruptive entrant to capture market share.</p><p><strong><br /><br /></strong></p><p dir=\"ltr\">Tetto Assicurazione: A new kind of home contents insurance for a new generation</p><p dir=\"ltr\">Tetto Assicurazione aims to revolutionise the Italian insurance market with a mobile-first, AI-powered home and contents insurance subscription service. Targeting young, urban renters, our platform will leverage large language models and multimodal AI to provide instant quotes, personalised coverage, and near-instant claim payouts.Â </p><p dir=\"ltr\">By syncing with customers' digital lives, Tetto will automatically adjust coverage as circumstances change, ensuring users are always adequately protected without overpaying. This tech-forward approach, combined with transparent pricing and a user-friendly interface, positions Tetto to become the go-to insurance provider for Italy's next generation of consumers.</p><p><strong><br /></strong></p><p dir=\"ltr\"><strong>What weâ\u0080\u0099re looking for</strong></p><p dir=\"ltr\">As part of the founding team you will be an instrumental part of shaping the product &amp; business strategy and will have direct industry experience in financial or insurance data. You will own the tech strategy and manage day-to-day engineering execution. Looking ahead, you will be responsible for helping grow the team and set up the technical capabilities of the business for growth.</p><p><strong><br /></strong></p><p dir=\"ltr\"><strong>Responsibilities:Â </strong></p><p><strong><br /></strong></p><ul><li dir=\"ltr\"><p dir=\"ltr\">Leading hands-on coding, testing and delivery of our MVP- responding adaptively to the changing needs of the business and our design partners/first customers.</p></li><li dir=\"ltr\"><p dir=\"ltr\">Spearheading future hiring and development of the tech team and its culture</p></li><li dir=\"ltr\"><p dir=\"ltr\">Taking ownership of platform development, making critical informed decisions on technical architecture and strategy</p></li><li dir=\"ltr\"><p dir=\"ltr\">Working with the rest of the team to prioritise our roadmap and deliver the MVP, enabling us to test, iterate and serve our growing membership base</p></li><li dir=\"ltr\"><p dir=\"ltr\">Ensuring the systems architecture and infrastructure is scalable and can support growth</p></li><li dir=\"ltr\"><p dir=\"ltr\">Ensuring that the product continues to use best practices, utilising advances in AI / machine learningÂ </p></li><li dir=\"ltr\"><p dir=\"ltr\">Feeding into product strategy and commercial goals to identify opportunities to quickly deliver customer value</p></li><li dir=\"ltr\"><p dir=\"ltr\">Involved in shaping the strategic direction of the business and fundraising process</p></li></ul><p><strong><br /></strong></p><p dir=\"ltr\"><strong>What youâ\u0080\u0099ll bring</strong></p><ul><li dir=\"ltr\"><p dir=\"ltr\">Demonstrated experience developing complex platforms, integrating distinct data sources and models</p></li><li dir=\"ltr\"><p dir=\"ltr\">Demonstrated ability to deliver product in a tech startup environment with speed</p></li><li dir=\"ltr\"><p dir=\"ltr\">Experience of working within an agile environmentÂ </p></li><li dir=\"ltr\"><p dir=\"ltr\">Knowledge &amp; passion of the challenges involved in developing a FIntech or Insurtech product, including the regulatory requirements and liaising with agronomists/researchers, would be a bonus</p></li><li dir=\"ltr\"><p dir=\"ltr\">Knowledge of the latest practices in AI / machine learning and can creatively apply them to a consumer application</p></li><li dir=\"ltr\"><p dir=\"ltr\">Experience with API Integrations to pull data from multiple sources</p></li><li dir=\"ltr\"><p dir=\"ltr\">Experience building full stack applications (for example HTML, CSS, React, Node js, Python), ideally both web and mobile applications</p></li></ul><p><strong><br /></strong></p><p dir=\"ltr\">Note - We are reviewing applications on an ongoing basis. If your background and application meets our criteria, we will be in touch to schedule a call.</p><br/><br/>Please mention the word **ENTHUSIAST** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 60000,
  "salary_max": 100000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-tech-cofounder-cto-founders-factory-1093267",
  "original": true,
  "url": "https://remoteOK.com/remote-jobs/remote-tech-cofounder-cto-founders-factory-1093267"
}