{
  "slug": "remote-jr-business-analyst-healthcare-1093213",
  "id": "1093213",
  "epoch": 1747900812,
  "date": "2025-05-22T08:00:12+00:00",
  "company": "HealthCare",
  "company_logo": "",
  "position": "Jr Business Analyst",
  "tags": [
    "analyst",
    "students",
    "technical",
    "support",
    "software",
    "growth",
    "microsoft",
    "senior",
    "operations",
    "operational",
    "marketing",
    "excel",
    "sales",
    "health",
    "medical",
    "internship"
  ],
  "description": "<p>Join Us!</p><p><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://HealthCare.com\">HealthCare.com</a> has become one of Americaâ\u0080\u0099s fastest-growing insurtech companies, revolutionizing how consumers shop for health insurance. Leveraging advanced technology and data science, the company has developed customized proprietary products to better fit consumer requirements, enhance customer satisfaction, and take some of the guesswork and inefficiencies out of buying insurance.</p><p><br></p><p><b>Jr Business Analyst</b></p><p><br></p><p>We are seeking a Business Analyst Intern to support ongoing projects that improve the performance and usability of our custom CRM. This internship is an ideal fit for undergraduate students interested in gaining hands-on experience in business analysis, data interpretation, and cross-functional collaboration. The role provides strong foundational experience for future careers in consulting, business analytics, or product management.&nbsp;</p><p><br></p><p>This will be a 12-week intern to hire program.</p><p><br></p><p><b>Responsibilities&nbsp;</b></p><p>â\u0097\u008fCollaborate with business and product leaders to define and document opportunities for CRM enhancements</p><p>â\u0097\u008fLearn and apply basic SQL to extract and analyze operational and sales data</p><p>â\u0097\u008fBuild dashboards and visual reports to support strategic decision-making across departments</p><p>â\u0097\u008fDocument business processes and assist in developing standard operating procedures (SOPs) for the CRM platform</p><p>â\u0097\u008fParticipate in user feedback sessions and research to better understand stakeholder needs</p><p>â\u0097\u008fContribute to the development of project documentation and analysis summaries for leadership review</p><p>â\u0097\u008fDevelop a practical understanding of sales operations and technology project workflows</p><p><br></p><p><b>Qualifications&nbsp;</b></p><p>â\u0097\u008fCurrently enrolled in a Bachelorâ\u0080\u0099s program in Business Management, Economics, Marketing, Computer Science or a related field (Junior or Senior standing preferred)</p><p>â\u0097\u008fStrong analytical skills with attention to detail and a willingness to learn new technical tools</p><p>â\u0097\u008fImmaculate problem solving capabilities</p><p>â\u0097\u008fInterest in consulting, business analytics, or product management</p><p>â\u0097\u008fStrong written and verbal communication skills</p><p>â\u0097\u008fAbility to work independently in a remote, fast-paced environment</p><p>â\u0097\u008fExperience with Microsoft Excel or Google Sheets; familiarity with SQL or willingness to learn</p><p><br></p><p><b>What You Will Gain&nbsp;</b></p><p>â\u0097\u008fHands-on experience working on customer-facing technical projects</p><p>â\u0097\u008fTraining on how to gather requirements for future features, present those requirements through the software development life cycle, conduct software demonstrations and user acceptance testing, and post-release impact analysis.</p><p>â\u0097\u008fPractical exposure to SQL and data visualization best practices</p><p>â\u0097\u008fFoundational knowledge of business analysis, stakeholder management, and operations</p><p>â\u0097\u008fAn in-depth look at how technology supports sales and marketing in a high-growth environment</p><p>â\u0097\u008fPreparation for entry-level roles or internships in consulting, analytics, or product development</p><p><br></p>\\n<p></p><p><br></p><p></p>\\n<p>Benefits</p><p>Opportunity to work from home</p><p>Excellent work environment</p><p>Medical, dental, and vision insurance</p><p>Up to 15 days of paid time off</p><p>11 company observed holidays</p><p>8 weeks of paid parental leave</p><p>401k plan with company match</p><p>Life insurance</p><p>Professional growth opportunity</p><p>Most importantly, an inclusive company culture established by an incredible team!</p><p><br></p><p>Get to Know Us!</p><p>https://www.healthcare.com/</p><p>linkedin.com/company/healthcare-com</p><br/><br/>Please mention the word **BLESSING** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Remote",
  "salary_min": 55000,
  "salary_max": 70000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-jr-business-analyst-healthcare-1093213",
  "logo": "",
  "url": "https://remoteOK.com/remote-jobs/remote-jr-business-analyst-healthcare-1093213"
}