{
  "slug": "remote-digital-editorial-manager-cozymeal-1093151",
  "id": "1093151",
  "epoch": 1746882008,
  "date": "2025-05-10T13:00:08+00:00",
  "company": "Cozymeal",
  "company_logo": "https://remoteok.com/assets/img/jobs/2e73e142c87b3242ff70b70bb76d90d91746882008.png",
  "position": "Digital Editorial Manager",
  "tags": [
    "manager",
    "support",
    "seo",
    "lead",
    "content"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/2e73e142c87b3242ff70b70bb76d90d91746882008.png",
  "description": "Discover. Savor. Connect. Welcome to the chef's table.\nCozymeal is the leading global marketplace featuring the best culinary experiences and products, including top-rated cooking classes, private chef experiences, culinary tours, chef-curated cookware, free recipes with step-by-step videos, city guides and much more!\nConsumers and companies alike use Cozymeal to discover new ways to connect through classes, food tours, mixology, wine tastings, and other unforgettable culinary experiences. Whether it be for date nights, birthdays, holiday celebrations or team building events, youâ\u0080\u0099re guaranteed a world-class experience. Plus, you can purchase our curated, high-quality cookware as a gift or for use at home.\nIn addition to providing customers access to world-class culinary experiences, products and content, we also provide a great source of income to our partners that includes chefs, sommeliers, guides and mixologists. For this, we were recognized by the Global Good Fund in 2019.\nServing both customers and our culinary partners is our top-priority and ingrained in our culture and in how we run our business every day. We continuously strive to curate the best culinary experiences and products and to create the best content for the millions of customers visiting our site while providing additional support and business to our partners.\nAbout the Role:\nWe are looking for a rockstar Digital Editorial Manager with experience in culinary and lifestyle content (written and visual) to join our team. This role will lead the creation of content on Cozymeal, including content for the Cozymeal Magazine and experience pages.\nResponsibilities Include:\n\nMap and drive the companyâ\u0080\u0099s content strategy, including its annual content plan.\nCreate and maintain an editorial calendar and ensure the content team executes on the deliverables.\nSet publication standards, including goals and expectations for the team.\nHelp assign, edit and create content for the companyâ\u0080\u0099s magazine (Cozymeal Magazine) through creating article outlines for writers, reviewing article drafts and sourcing images for the articles.\nBuild and schedule articles with Cozymealâ\u0080\u0099s custom blog CMS.\nReview and publish new content (visual and written) on the company's website for cooking classes, food tours and other experiences.\nHelp source, curate and oversee the companyâ\u0080\u0099s image gallery and visual content.\nMentor Digital Content Editors and other team members with digital content editing best practices.\n\nManage the onboarding process for new writers, ensuring a smooth transition into the company.\n\n\nRequirements Include:\n\nBachelorâ\u0080\u0099s degree or equivalent.\n4+ years of experience in copywriting.\n4+ years of experience in digital content editing.\n3+ years of experience in editorial calendar and content strategy.\nExcellent verbal and written communication skills.\nStrong visual and photo research skills.\nAdvanced SEO knowledge.\nExceptional organization skills and ability to track multiple projects at once. \nKeen eye for detail.\nFamiliarity with food and culinary culture.\n\nWorking efficiently in a home office environment.\n\n\nWhat We Offer:\n\nWork anywhere in the world (we are a 100% remote team).\nOpportunity to grow within the organization and learn from some of the best in the industry.\nGreat work environment with a strong and friendly team of co-workers.\n\nLocation: Worldwide. This is a remote role and qualified candidates from anywhere in the world can apply for this role.  \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    <br/><br/>Please mention the word **FEISTY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 20000,
  "salary_max": 70000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-digital-editorial-manager-cozymeal-1093151",
  "url": "https://remoteOK.com/remote-jobs/remote-digital-editorial-manager-cozymeal-1093151"
}