{
  "slug": "remote-data-scientist-the-voleon-group-1093286",
  "id": "1093286",
  "epoch": 1748754002,
  "date": "2025-06-01T05:00:02+00:00",
  "company": "The Voleon Group",
  "company_logo": "https://remoteok.com/assets/img/jobs/7401dc98f2e84be1fc677758821238711748754004.png",
  "position": "Data Scientist",
  "tags": [
    "support",
    "software",
    "financial",
    "investment",
    "finance",
    "health",
    "executive"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/7401dc98f2e84be1fc677758821238711748754004.png",
  "description": "<p>Voleon is a technology company that applies state-of-the-art AI and machine learning techniques to real-world problems in finance. For more than a decade, we have led our industry and worked at the frontier of applying AI/ML to investment management. We have become a multibillion-dollar asset manager, and we have ambitious goals for the future.</p><p>&nbsp;</p><p>Your colleagues will include internationally recognized experts in artificial intelligence and machine learning research as well as highly experienced finance and technology professionals.</p><p>&nbsp;</p><p>In addition to our enriching and collegial working environment, we offer highly competitive compensation and benefits packages, technology talks by our experts, a beautiful modern office, daily catered lunches, and more.</p><p><br></p><p>The Voleon Group is forming a new team to help advance our data-driven investment initiatives. As a Data Scientist, you will be responsible for harvesting insights from a complex array of data. Your role will involve data curation, analysis, interpretation, visualization, and communication of your findings to members of the research staff and executive leadership.&nbsp; This role is a means to make a difference: as a machine learning company, data insights are essential to our business.&nbsp;&nbsp;</p>\\n<p></p><p><br></p><b>Responsibilities</b><ul><li>Design and implement systems to ensure data correctness and monitor data health&nbsp;in data stores and live feeds</li><li>Proactively identify abnormal&nbsp;production&nbsp;behavior and communicate them clearly to relevant stakeholders</li><li>Perform&nbsp;extemporaneous&nbsp;analyses&nbsp;on research and production trading systems with leadership&nbsp;&nbsp;&nbsp;</li><li>Harness financial expertise and statistical analysis to gain actionable insights into our production trading and research systems</li><li>Design and implement analysis pipelines that automate those analyses found to be valuable for ongoing monitoring</li></ul><p><br></p><b>Requirements</b><ul><li>1+ years of applied end-to-end industry experience, including internships working with complex datasets, including curation, querying, aggregation, exploratory data analysis, and visualization</li><li>Experience using statistical methods&nbsp;to analyze data,&nbsp;identify patterns, conduct root cause analysis, discover insights, and recommend solutions</li><li>Ability to&nbsp;frame and answer&nbsp;questions mathematically</li><li>Ability to infer useful forward-looking directions from results of retrospective analysis</li><li>Fluency in managing, processing, and visualizing tabular data&nbsp;using a combination of SQL, Pandas, and R</li><li>Basic software development skills and experience with bash, linux/unix, and git</li><li>Ability to refine requirements from ambiguous requests to&nbsp;produce reports demonstrating excellence in communication</li><li>Bachelorâ\u0080\u0099s degree in a quantitative discipline (statistics, biostatistics, data science, computer science, or a related field)</li></ul><p><br></p><b>Preferred</b><ul><li>Masterâ\u0080\u0099s degree in a quantitative discipline</li><li>Prior industry experience or displayed interest in finance, such as related academic projects, coursework in financial engineering, or industry internships&nbsp;</li><li>Experience developing in a production-facing environment and familiarity with standard concepts and tooling, e.g., CI/CD, git, Airflow</li></ul><p><br></p><p></p>\\n<p><b style=\"font-size: 13.5pt\">Compensation</b></p><p>The base salary range for this position is $150,000 to $190,000 in the location(s) of this posting. Individual salaries are determined through a variety of factors, including, but not limited to, education, experience, knowledge, skills, and geography. Base salary does not include other forms of total compensation, such as bonus compensation and other benefits. Our benefits package includes medical, dental, and vision coverage, life and AD&amp;D insurance, 20 days of paid time off, 9 sick days, and a 401(k) plan with a company match.</p><p><br></p><p><b style=\"font-size: 13.5pt\">â\u0080\u009cFriends of Voleonâ\u0080\u009d Candidate Referral Program</b></p><p><span style=\"font-size: 10.5pt\">If you have a great candidate in mind for this role and would like to have the potential to earn $7,500 if your referred candidate is successfully hired and employed by The Voleon Group, please use this&nbsp;</span><a class=\"postings-link\" href=\"https://voleon.com/referrals/\"><u style=\"font-size: 10.5pt\">form</u></a><a class=\"postings-link\" style=\"font-size: 10.5pt\" href=\"https://voleon.com/referrals/\">&nbsp;</a>to submit your referral. For more details regarding eligibility, terms, and conditions, please make sure to review the&nbsp;<u style=\"font-size: 10.5pt\"><a class=\"postings-link\" href=\"https://voleon.com/assets/Voleon-Referral-Bonus-Program.pdf\">Voleon Referral Bonus Program</a></u><a class=\"postings-link\" href=\"https://voleon.com/assets/Voleon-Referral-Bonus-Program.pdf\">.</a></p><p><span style=\"font-size: 10.5pt\">&nbsp;</span></p><p><b style=\"font-size: 13.5pt\">Equal Opportunity Employer</b></p><p><span style=\"font-size: 10.5pt\">The Voleon Group is an Equal Opportunity employer. Applicants are considered without regard to race, color, religion, creed, national origin, age, sex, gender, marital status, sexual orientation and identity, genetic information, veteran status, citizenship, or any other factors prohibited by local, state, or federal law.</span></p><p><span style=\"font-size: 10.5pt\">&nbsp;</span></p><p><b style=\"font-size: 13.5pt\">Vaccination Requirement</b></p><p><span style=\"font-size: 10.5pt\">The Voleon Group has implemented a policy requiring all employees who will be entering our worksite, including new hires, to be fully vaccinated with the COVID-19 vaccine.&nbsp; This policy also applies to remote employees, as such employees will be asked to visit our offices from time to time. To the extent permitted by applicable law, proof of vaccination will be required as a condition of employment. This policy is part of Voleonâ\u0080\u0099s ongoing efforts to ensure the safety and well-being of our employees and community, and to support public health efforts.</span></p><p><br></p><p><span style=\"font-size: 16px\">#LI-MD1</span></p><br/><br/>Please mention the word **PARAMOUNT** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "United States or Remote",
  "salary_min": 20000,
  "salary_max": 60000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-data-scientist-the-voleon-group-1093286",
  "url": "https://remoteOK.com/remote-jobs/remote-data-scientist-the-voleon-group-1093286"
}