{
  "slug": "remote-commercial-content-editor-find-1093167",
  "id": "1093167",
  "epoch": 1747152025,
  "date": "2025-05-13T16:00:25+00:00",
  "company": "Find",
  "company_logo": "https://remoteok.com/assets/img/jobs/9759da72ce52d1d82ce5226e322b2b0c1747152025.png",
  "position": "Commercial Content Editor",
  "tags": [
    "crypto",
    "cryptocurrency",
    "financial",
    "seo",
    "management",
    "content",
    "operations",
    "sales",
    "non tech"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/9759da72ce52d1d82ce5226e322b2b0c1747152025.png",
  "description": "<p><span style=\"font-size: 11pt;\">We seek a detail-driven and crypto-savvy </span><b style=\"font-size: 11pt;\">CommercialContent Editor</b><span style=\"font-size: 11pt;\"> to join our dynamic content team. This contract role is suited to an editorial professional with a deep understanding of cryptocurrency and digital assets, combined with sharp editing and production management skills. As a core member of the </span><b style=\"font-size: 11pt;\">Commercial Content</b><span style=\"font-size: 11pt;\"> team, you'll play a vital role in overseeing the editorial process across our crypto and iGaming platforms. Youâ\u0080\u0099ll ensure our content is accurate, engaging, compliant, and aligned with SEO best practices â\u0080\u0094 all while helping to scale up content operations and maintain high editorial standards.</span></p>\\n<p></p><p><br></p><b>Requirements</b><ul><li>2â\u0080\u00933 years in digital publishing or content editing, ideally focusing on cryptocurrency and/or fintech.</li><li>Exceptional command of English with strong editing, proofreading, and quality control abilities.</li><li>Deep knowledge of blockchain, DeFi, tokens, trading platforms, and emerging trends in the crypto space.</li><li>Skilled in using CMS (especially WordPress), SEO tools (SEMrush, Ahrefs), and familiar with basic HTML.</li><li>Ability to juggle multiple deadlines, prioritise tasks, and deliver under pressure.</li><li>Comfortable analysing content performance and making data-driven editorial decisions.</li><li>Excellent communication skills to work across multiple departments and time zones.</li><li>Bachelorâ\u0080\u0099s degree in Journalism, Communications, Marketing, or a related field.</li><li>Experience with compliance and regulatory content, especially in crypto or financial services.</li><li>Understanding of UX/UI best practices for digital publishing.</li><li>Familiarity with AI-enhanced editing and publishing tools.</li></ul><p><br></p><b>Responsibilities </b><ul><li>Manage and refine the content pipeline for cryptocurrency-related content, from ideation to publication, ensuring editorial quality and timeliness.</li><li>Verify financial data, market insights, and regulatory information specific to the cryptocurrency industry.</li><li>Collaborate with SEO experts to optimise articles without compromising editorial integrity or readability.</li><li>Publish and maintain content within CMS platforms like WordPress, ensuring consistency and quality across layouts.</li><li>Work with editors, designers, developers, and the sales team to streamline workflows and align with business goals.</li><li>Ensure content complies with industry standards, especially in cryptocurrency and financial topics.</li><li>Help enforce editorial style guides and tone-of-voice consistency across all crypto content.</li></ul><div><br></div><p><br></p><p></p>\\n<p><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://find.co/\"><i style=\"font-size: 16px;\">Find.co</i></a><i style=\"font-size: 16px;\">&nbsp;is an Equal Opportunity / Affirmative Action employer committed to diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, age, national origin, disability, protected veteran status, gender identity or any other factor protected by applicable federal, state, or local laws.</i></p><br/><br/>Please mention the word **GODLIKE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "",
  "salary_min": 32500,
  "salary_max": 70000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-commercial-content-editor-find-1093167",
  "url": "https://remoteOK.com/remote-jobs/remote-commercial-content-editor-find-1093167"
}