{
  "slug": "remote-account-coordinator-bluelight-consulting-1093163",
  "id": "1093163",
  "epoch": 1747123210,
  "date": "2025-05-13T08:00:10+00:00",
  "company": "Bluelight Consulting",
  "company_logo": "https://remoteok.com/assets/img/jobs/2ea3081c1fa1c6fb3839e30912c5d7ef1747123210.png",
  "position": "Account Coordinator",
  "tags": [
    "consulting",
    "training",
    "coordinator",
    "support",
    "growth",
    "manager",
    "education",
    "management",
    "content",
    "senior",
    "marketing"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/2ea3081c1fa1c6fb3839e30912c5d7ef1747123210.png",
  "description": "<p>At Bluelight, we are searching for a candidate to join our client's team as a direct hire.</p><p><br></p><p>At The Missing Ingredient, we are passionate about building a better future through food. Founded nearly a decade ago by CJ Bruce, with the mission to \"uncomplicate marketing for the worldâ\u0080\u0099s most impactful food and beverage companies.\" They specialize in partnering with brands that are conscious about creating healthy food and beverage options and sustainable practices. The team of self-professed foodies and digital marketing nerds is dedicated to exceeding results and driving measurable success for the brands they love.</p><p><br></p><p>They focus on digital marketing services for natural food &amp; beverage companies as well as nonprofit organizations.</p><p><br></p><p>Their core services include paid media, social media, email marketing, and influencer relations.</p>\\n<p></p><p><br></p><b>Role Overview</b><ul><li>The Account Coordinator plays a critical role in supporting client account management and ensuring seamless internal operations. Reporting to the Account Manager, this individual will assist with client communication, task coordination, and project support across digital marketing campaigns, social media, and administrative activities. The position is remote and works PST hours.</li></ul><p><br></p><b>Key Responsibilities</b><ul><li>Client &amp; Account Support:</li><li>Support Account Managers in organizing client deliverables and tracking next steps.</li><li>Join client calls for note-taking and exposure to client communication.</li><li>Assist in gathering and preparing materials for client meetings and reports.</li><li>Maintain up-to-date internal documentation to help Account Managers stay aligned.</li><li>Step in with administrative or coordination support when Account Managers are out.</li><li>Offer flexible support to meet the evolving needs of the agency.</li><li>-------------------------------------------------------------------------------------</li><li>Project &amp; Task Coordination:</li><li>Help track project timelines and ensure internal deadlines are documented.</li><li>Send friendly reminders to team members about upcoming or overdue tasks.</li><li>Double-check that briefs and resources are shared before tasks begin.</li><li>Assist in updating task templates and internal workflows under Account Manager guidance.</li><li>-------------------------------------------------------------------------------------</li><li>Team Collaboration &amp; Communication:</li><li>Meet weekly with Account Managers to understand challenges and support needs.</li><li>Check in weekly with internal specialists to surface blockers or support needs.</li><li>Relay specialist feedback to the Account Manager to help inform planning.</li><li>Coordinate hand-offs between departments (e.g., creative to paid media) to maintain flow.</li><li>Help facilitate cross-functional collaboration by keeping communication clear and organized.</li></ul><p><br></p><b>Success Measurements</b><ul><li>Client Satisfaction: Positive feedback and relationship strength with client accounts.</li><li>Project Delivery: Timeliness and quality of deliverables across campaigns.</li><li>Internal Coordination: Effective communication and collaboration with internal teams.</li><li>Task Management: High on-time task completion rate with minimal oversight.</li></ul><p><br></p><b>Required Skills &amp; Experience</b><ul><li>2-3 years in account coordination, marketing, project management, social media, or related fields.</li><li>Previous remote work experience and ability to work PST hours.</li><li>Exceptional written and verbal communication skills.</li><li>Strong organizational and time-management skills.</li><li>Attention to detail and resourceful problem-solving ability.</li><li>Adaptability to fast-paced environments and openness to feedback.</li><li>An strong interest in digital marketing and desire to grow in the marketing industry.</li><li>Bonus: Familiarity with platforms such as Instagram, Facebook, LinkedIn, TikTok, and tools like Teamwork, Notion, Slack, and Google Suite.</li><li>Bonus: Experience in copywriting, content creation, or influencer marketing.</li></ul><p><br></p><b>Career Growth &amp; Advancement</b><ul><li>Potential progression into Account Manager and Senior Account Manager roles based on performance.</li><li>Opportunities to specialize in client strategy, campaign leadership, or team management with demonstrated proficiency and leadership skills.</li></ul><p><br></p><b>Security &amp; Compliance Requirements</b><ul><li>Adherence to internal confidentiality policies and client-specific data handling requirements.</li></ul><p><br></p><b>Reporting &amp; Team Structure</b><ul><li>Reports directly to the Account Manager.</li><li>Collaborates cross-functionally with creative, paid media, and influencer marketing teams.</li><li>No supervisory responsibilities initially but expected to manage tasks and project timelines independently.</li></ul><p><br></p><b>Additional Expectations</b><ul><li>Active participation in weekly team meetings, training sessions, and ongoing process improvements.</li><li>Contribution to a positive, solution-oriented team culture.</li><li>Commitment to professional development and continuous learning in digital marketing trends.</li></ul><p><br></p><b>Compensation Structure</b><ul><li>The compensation philosophy ensures competitive pay aligned with performance, proficiency, and company affordability. Compensation is reviewed annually based on market benchmarks and individual contributions.</li><li>Location: Remote</li><li>Employment Type: Full-Time</li><li>Salary: $45,000 - $60,000 Depending on experience</li></ul><p><br></p><b>What The Missing Ingredient Offers</b><ul><li>Fully remote work environment.</li><li>Full health, dental, and vision insurance coverage.</li><li>401k with 100% matching up to 3% and 50% matching up to 5%. (Eligible after 6 months of employment)</li><li>Flexible paid vacation. (You are responsible for ensuring coverage while out)</li><li>Annual end-of-year profit sharing based on salary, tenure, and performance. Dependent on agency profitability at at the discretion of agency ownership.</li><li>Guaranteed minimum 3% salary increase YoY, with additional increases based on performance.</li><li>Ongoing education paid by The Missing Ingredient (courses, books, conferences, etc.), up to $500/year.</li><li>Opportunities for professional growth across various digital marketing disciplines.</li><li>Dynamic, collaborative, and mission-driven team culture.</li></ul><p><br></p><p></p>\\n<p>If you are interested please apply.</p><br/><br/>Please mention the word **IRRESISTIBLE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Indianapolis, Indiana",
  "salary_min": 80000,
  "salary_max": 150000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-account-coordinator-bluelight-consulting-1093163",
  "url": "https://remoteOK.com/remote-jobs/remote-account-coordinator-bluelight-consulting-1093163"
}