{
  "slug": "remote-paid-media-designer-flex-1093247",
  "id": "1093247",
  "epoch": 1748257203,
  "date": "2025-05-26T11:00:03+00:00",
  "company": "Flex",
  "company_logo": "https://remoteok.com/assets/img/jobs/50c48f7e33f02570d383ad882139550d1748257204.png",
  "position": "Paid Media Designer",
  "tags": [
    "design",
    "designer",
    "software",
    "testing",
    "test",
    "growth",
    "manager",
    "financial",
    "video",
    "finance",
    "fintech",
    "ads",
    "content",
    "marketing",
    "analytics",
    "legal",
    "digital nomad"
  ],
  "logo": "https://remoteok.com/assets/img/jobs/50c48f7e33f02570d383ad882139550d1748257204.png",
  "description": "<p><a style=\"font-size: 15px\" href=\"http://flex.one/\">Flex</a><span style=\"font-size: 15px\">&nbsp;is building a finance super app for business owners â\u0080\u0094 reimagining every single aspect of the financial workflow and financial services for any entrepreneur. The company has grown revenue 25x+ since publicly launching in September 2023 and is on track to achieve profitability by mid 2025. Flex is focused on mid-market businesses ($3 - $100M revenue) that are largely overlooked by existing fintech solutions and reliant on slow and outdated regional banks.&nbsp; We are targeting a ~$1T revenue opportunity that is largely up for grabs.</span></p><p><br></p><p><b>Flex</b> is a fully remote company and this role can be performed from anywhere.</p><p><br></p><p><span style=\"font-size: 10pt;\">ð\u009f\u0095º </span><b style=\"font-size: 10pt;\">About the Role</b></p><p><br></p><p><span style=\"font-size: 10pt;\">Weâ\u0080\u0099re looking for a Paid Media Designer to own ad creative across channels and help drive performance and brand consistency. Youâ\u0080\u0099ll report into the performance marketing manager and work closely with our creative team to generate original ad assets, test rapidly, and scale winners while ensuring brand compliance and financial/legal requirements are met.</span></p>\\n<p></p><p><br></p><b>â\u009c\u0085 What Youâ\u0080\u0099ll Do</b><ul><li><b>Generate original ad content for platforms such as Facebook/Instagram/LinkedIn:</b> Create onâ\u0080\u0091brand visuals (static, dynamic video and animation) optimized for clicks and conversions.</li><li><b>Translate data insights into creative concepts:</b> Review performance metrics weekly and propose fresh ideas that convert.</li><li><b>Produce multiple ad assets every week:</b> Deliver varied designs to fuel rapid testing on a punctual schedule.</li><li><b>Iterate on top performers:</b> Analyze test results and refine winning creatives.</li><li><b>Ensure every asset meets brand compliance and finance and legal requirements:</b> Maintain consistency and meet regulations.</li><li><b>Stay on top of emerging ad formats and source inspiration proactively:</b> Research trends and share learnings.</li><li><b>Work asynchronously and communicate updates clearly</b>: Collaborate across time zones (via Slack) without waiting for real time meetings.</li><li><b>Use Asana to manage projects and deliverables</b>: Track creative tasks timelines and feedback in a centralized system.</li><li><b>Work seamlessly across design and editing software:</b> Create concepts in tools such as Adobe, Figma (and other's like Keyshot or Spline are a plus) and upload into editing review tools such as <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Frame.io\">Frame.io</a> or similar.</li><li><b>Bring your experience leveraging AI:</b> Tapping into tools to develop voice-overs that are polished, or use AIi to help scale creative development.</li><li><b>Align seamlessly and understand brand guidelines and consistency</b>: Develop an understanding and learn the creative brand, to represent the Flex brand well and keep consistency amongst both the brand and&nbsp; the product.</li></ul><p><br></p><b>â\u009a¡ï¸\u008f What You Bring</b><ul><li>Minimum of 2 years of design experience focused on paid media ads in a high growth environment (preferably in B2B/Fintech space).</li><li>A portfolio showcasing original assets optimized for conversion.</li><li>Deep understanding of platform requirements, ad specs and channel best practices.</li><li>Ability to design static, motion (video and animated) ad concepts that match brand guidelines, while also bringing fresh ideas that are intended to convert.</li><li>Strong competency in design tools such as Adobe Creative Suite, Figma, Frame, Motion and creative AI tools, all while keeping the pulse on evolving software and tools in the field. Midjourney is a Plus.</li><li>Excellent time-management, communication, and project-management skills using task-management software such as Asana (or Jira, Monday, etc). </li><li>Data driven mindset with ability to interpret performance metrics and apply learnings.</li><li>Self-starter attitude who needs little direction and actively seeks new ideas and inspiration but also enjoys collaborating with other creatives for critique and design sessions. </li><li>Strong communication skills and experience collaborating with marketing, analytics and product teams. </li><li>Expert verbal and written communication skills including the ability to present and get buy-in at all levels of the organization, and manage a high-growth agile environment.</li></ul><p><br></p><p></p>\\n<div>$70,000 - $85,000 a year</div>\\n<p><span style=\"font-size: 10pt;\">At Flex, we value passion, determination, and honesty. Even if you don't fully match the job specifics, we encourage you to apply. Unusual career paths and unique skills can help you stand out. We believe diversity drives our success.</span></p><br/><br/>Please mention the word **SMILES** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
  "location": "Remote",
  "salary_min": 75000,
  "salary_max": 100000,
  "apply_url": "https://remoteOK.com/remote-jobs/remote-paid-media-designer-flex-1093247",
  "url": "https://remoteOK.com/remote-jobs/remote-paid-media-designer-flex-1093247"
}